// Exporter by @MekuCube

#pragma once

/// Forward Declaration

struct Vec;
struct stPcSaveData;
struct stBtEffect;
class mHRBattle;
class HrMissionResult;
class CHrHUDDemoButton;
class HrScreenStatusBalloon;
struct GXTexObj;
struct tagGHMR_TEX;
class HrScreenStatusSlot;
struct Rectf;
struct Vec2;
struct hPOINT;
class CNYDrawStringBase;
class NYDrawString;
class HrMap;
class NYPhase;
class CHrHUDBase;
class CHrHUDMoney;
class CHrHUDTension;
class HrScreenStatus;
class HrTask;
namespace EE
{
	template<typename T>
	class SmartPtr;
}
namespace EE
{
	class RefObject;
}
class GXTexture;
class GtSimplMes;
struct DVDCommandBlock;
struct DVDFileInfo;
class ghmGcFile;
struct DVDDiskID;
namespace EE
{
	class IFile;
}
struct BATTLESIMPLMESS_SET;
class HrEffectShutter;
class EfBase;
class EfSmoke;
class CTimeRatioInterpolate;
struct stFade;
class CSpringInterpolate;
class CDoubleSpringInterpolate;
class CAmbientShadow;
struct stCharaEffect;
class stCharaFileData;
class ghmSegment;
class ghmCapsule;
class ghmGcOctTreeNodeObj;
class ghmGcCollObj;
class ghmGcCollObjCapsule;
class WAnim;
class WAnimF;
struct stDamageInfo;
class ghmTriangle;
class ghmPlane;
class ghmGcCollObjHitResultObj;
struct stVec;
struct Quaternion;
struct stCharaStatus;
class ghmListObj;
struct CharControlMotID;
struct GXColor;
class vector4f;
class vector4x;
class tiVector;
namespace mot
{
	class IBoneEffectModel;
}
namespace mot
{
	class IBoneEffectModelPJ;
}
class TGmf;
class NYApproachToTargetVal;

	// <eCharaTypeMGN = 0x1a>
	eCharaTypeMGN = 26,

	// <eCharaTypeMOE = 0x1b>
	eCharaTypeMOE = 27,

	// <eCharaTypeLEZ = 0x1c>
	eCharaTypeLEZ = 28,

	// <eCharaTypeCEW = 0x1d>
	eCharaTypeCEW = 29,

	// <eCharaTypeJBJA = 0x1e>
	eCharaTypeJBJA = 30,

	// <eCharaTypeJBJB = 0x1f>
	eCharaTypeJBJB = 31,

	// <eCharaTypeJBJC = 0x20>
	eCharaTypeJBJC = 32,

	// <eCharaTypeAST = 0x21>
	eCharaTypeAST = 33,

	// <eCharaTypeRKT = 0x22>
	eCharaTypeRKT = 34,

	// <eCharaTypeGLB = 0x23>
	eCharaTypeGLB = 35,

	// <eCharaTypeSDP = 0x24>
	eCharaTypeSDP = 36,

	// <eCharaTypeBIKJPY = 0x25>
	eCharaTypeBIKJPY = 37,

	// <CHARACTER_TYPE_BOSS_END = 0x26>
	CHARACTER_TYPE_BOSS_END = 38,

	// <eCharaTypePatroller = 0x27>
	eCharaTypePatroller = 39,

	// <eCharaTypeZKCar_Sedan = 0x28>
	eCharaTypeZKCar_Sedan = 40,

	// <eCharaTypeZKCar_Van = 0x29>
	eCharaTypeZKCar_Van = 41,

	// <eCharaTypePhotoCat = 0x2a>
	eCharaTypePhotoCat = 42,

	// <eCharaTypeFCA = 0x2b>
	eCharaTypeFCA = 43,

	// <eCharaTypeCommonNpc = 0x2c>
	eCharaTypeCommonNpc = 44,

	// <eCharaTypeScorpion = 0x2d>
	eCharaTypeScorpion = 45,

	// <eCharaTypeHelicopter = 0x2e>
	eCharaTypeHelicopter = 46,

	// <eCharaTypeCommonNpc_BUG = 0x2f>
	eCharaTypeCommonNpc_BUG = 47,

	// <eCharaTypeCommonNpc_PIPE = 0x30>
	eCharaTypeCommonNpc_PIPE = 48,

	// <eCharaTypeCommonNpc_COCONUT = 0x31>
	eCharaTypeCommonNpc_COCONUT = 49,

	// <eCharaTypeCommonNpc_DEBLI = 0x32>
	eCharaTypeCommonNpc_DEBLI = 50,

	// <eCharaTypeCommonNpc_PIZZA = 0x33>
	eCharaTypeCommonNpc_PIZZA = 51,

	// <eCharaTypeCommonNpc_TILE = 0x34>
	eCharaTypeCommonNpc_TILE = 52,

	// <eCharaTypeCommonNpc_STEAK = 0x35>
	eCharaTypeCommonNpc_STEAK = 53,

	// <eCharaTypeCommonNpc_SCORPION = 0x36>
	eCharaTypeCommonNpc_SCORPION = 54,

	// <eCharaTypeCommonNpc_CAR_BUG = 0x37>
	eCharaTypeCommonNpc_CAR_BUG = 55,

	// <eCharaTypeCommonNpc_CAR_PIPE = 0x38>
	eCharaTypeCommonNpc_CAR_PIPE = 56,

	// <eCharaTypeCommonNpc_CAR_COCONUT = 0x39>
	eCharaTypeCommonNpc_CAR_COCONUT = 57,

	// <eCharaTypeCommonNpc_CAR_DEBLI = 0x3a>
	eCharaTypeCommonNpc_CAR_DEBLI = 58,

	// <eCharaTypeCommonNpc_CAR_TILE = 0x3b>
	eCharaTypeCommonNpc_CAR_TILE = 59,

	// <eCharaTypeCommonNpc_CAR_STEAK = 0x3c>
	eCharaTypeCommonNpc_CAR_STEAK = 60,

	// <eCharaTypeCommonNpc_CAR_SCORPION = 0x3d>
	eCharaTypeCommonNpc_CAR_SCORPION = 61,

	// <eCharaTypeCmnObj = 0x3e8>
	eCharaTypeCmnObj = 1000,

	// <eCharaTypePlayerWeapon = 0x3e9>
	eCharaTypePlayerWeapon = 1001,

	// <eCustomColliderObject = 0x3ea>
	eCustomColliderObject = 1002

};

// enum eLightRefPriority
enum eLightRefPriority : uint32_t
{
	// <eLightRefPriority_MostHigh = 0x0>
	eLightRefPriority_MostHigh = 0,

	// <eLightRefPriority_PC_CUT = 0x1>
	eLightRefPriority_PC_CUT = 1,

	// <eLightRefPriority_GUARD = 0x2>
	eLightRefPriority_GUARD = 2,

	// <eLightRefPriority_MUZZLE_FLASH = 0x3>
	eLightRefPriority_MUZZLE_FLASH = 3,

	// <eLightRefPriority_Low = 0x4>
	eLightRefPriority_Low = 4

};

// [Structure] struct Vec
/// <summary>
/// 3D Vector (x, y, z). Y-up.
/// </summary>
struct Vec
{
public:
	/// Struct member variables

	// <float x, offset 0x0>
	float x = 0;

	// <float y, offset 0x4>
	float y = 0;

	// <float z, offset 0x8>
	float z = 0;

	/// 0 Functions

	/// Meta

	Vec() { x = 0; y = 0; z = 0; }
	Vec(float inX, float inY, float inZ) { x = inX; y = inY; z = inZ; }
	float Size() const { return sqrtf(x*x + y*y + z*z); }
	float SizeSquared() const { return x*x + y*y + z*z; }
	std::string ToString() const { std::stringstream stream; stream << "Vec(X: " << x << ", Y: " << y << ", Z: " << z << ") [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(Vec& InObject)
	{
		x = InObject.x;
		y = InObject.y;
		z = InObject.z;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Vec>("Vec")
			.addFunction("__tostring", &Vec::ToString)
			.addFunction("GetPtrAddr", &Vec::GetPtrAddr)
			.addProperty("x", &Vec::x)
			.addProperty("y", &Vec::y)
			.addProperty("z", &Vec::z)
			.addConstructor<void (*) (void)>()
			.addConstructor<void (*) (float, float, float)>()
			.addProperty("pitch", &Vec::x)
			.addProperty("yaw", &Vec::y)
			.addProperty("roll", &Vec::z)
			.addFunction("SizeSquared", &Vec::SizeSquared)
			.addFunction("Size", &Vec::Size)
		.endClass();
	}
#endif
};
static_assert(sizeof(Vec::x) == 4, "expected Vec::x to be size 4");
static_assert(sizeof(Vec::y) == 4, "expected Vec::y to be size 4");
static_assert(sizeof(Vec::z) == 4, "expected Vec::z to be size 4");
static_assert(sizeof(Vec) == 0xc, "expected Vec to be size 0xc");

// enum enBattleFrameProc
enum enBattleFrameProc : uint32_t
{
	// <eBtlFrameInit = 0x0>
	eBtlFrameInit = 0,

	// <eBtlFrameMain = 0x1>
	eBtlFrameMain = 1,

	// <eBtlFramePcTermWait = 0x2>
	eBtlFramePcTermWait = 2,

	// <eBtlFramePcInitWait = 0x3>
	eBtlFramePcInitWait = 3,

	// <eBtlFrameReleaseNpc = 0x4>
	eBtlFrameReleaseNpc = 4

};

// [Structure] struct stPcSaveData
struct stPcSaveData
{
public:
	/// Struct member variables

	// <float maxHp, offset 0x0>
	float maxHp = 0;

	// <float hp, offset 0x4>
	float hp = 0;

	// <int32_t WeaponID1, offset 0x8>
	int32_t WeaponID1 = 0;

	// <int16_t CurBattery1, offset 0xc>
	int16_t CurBattery1 = 0;

	// <int16_t MaxBattery1, offset 0xe>
	int16_t MaxBattery1 = 0;

	// <Unidentified data segment, offset 0x10>
private:
	char _UnidentifiedData_16[4];

public:
	// <uint8_t CmbExtend1, offset 0x14>
	uint8_t CmbExtend1 = 0;

	// <Unidentified data segment, offset 0x15>
private:
	char _UnidentifiedData_21[1479];

public:
	// <int32_t CurMoney, offset 0x5dc>
	int32_t CurMoney = 0;

	// <Unidentified data segment, offset 0x5e0>
private:
	char _UnidentifiedData_1504[49];

public:
	// <bool LostBikeFlag, offset 0x611>
	bool LostBikeFlag;

	// <Unidentified data segment, offset 0x612>
private:
	char _UnidentifiedData_1554[82];

public:
	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct stPcSaveData [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(stPcSaveData& InObject)
	{
		maxHp = InObject.maxHp;
		hp = InObject.hp;
		WeaponID1 = InObject.WeaponID1;
		CurBattery1 = InObject.CurBattery1;
		MaxBattery1 = InObject.MaxBattery1;
		CmbExtend1 = InObject.CmbExtend1;
		CurMoney = InObject.CurMoney;
		LostBikeFlag = InObject.LostBikeFlag;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stPcSaveData>("stPcSaveData")
			.addFunction("__tostring", &stPcSaveData::ToString)
			.addFunction("GetPtrAddr", &stPcSaveData::GetPtrAddr)
			.addProperty("maxHp", &stPcSaveData::maxHp)
			.addProperty("hp", &stPcSaveData::hp)
			.addProperty("WeaponID1", &stPcSaveData::WeaponID1)
			.addProperty("CurBattery1", &stPcSaveData::CurBattery1)
			.addProperty("MaxBattery1", &stPcSaveData::MaxBattery1)
			.addProperty("CmbExtend1", &stPcSaveData::CmbExtend1)
			.addProperty("CurMoney", &stPcSaveData::CurMoney)
			.addProperty("LostBikeFlag", &stPcSaveData::LostBikeFlag)
		.endClass();
	}
#endif
};
static_assert(sizeof(stPcSaveData::maxHp) == 4, "expected stPcSaveData::maxHp to be size 4");
static_assert(sizeof(stPcSaveData::hp) == 4, "expected stPcSaveData::hp to be size 4");
static_assert(sizeof(stPcSaveData::WeaponID1) == 4, "expected stPcSaveData::WeaponID1 to be size 4");
static_assert(sizeof(stPcSaveData::CurBattery1) == 2, "expected stPcSaveData::CurBattery1 to be size 2");
static_assert(sizeof(stPcSaveData::MaxBattery1) == 2, "expected stPcSaveData::MaxBattery1 to be size 2");
static_assert(sizeof(stPcSaveData::CmbExtend1) == 1, "expected stPcSaveData::CmbExtend1 to be size 1");
static_assert(sizeof(stPcSaveData::CurMoney) == 4, "expected stPcSaveData::CurMoney to be size 4");
static_assert(sizeof(stPcSaveData::LostBikeFlag) == 1, "expected stPcSaveData::LostBikeFlag to be size 1");
static_assert(sizeof(stPcSaveData) == 0x664, "expected stPcSaveData to be size 0x664");

// enum enPcKind
/// <summary>
/// Player character type (Travis, Shinobu, Henry)
/// </summary>
enum enPcKind : uint32_t
{
	// <ePcUndefined = 0xffffffffffffffff>
	ePcUndefined = UINT32_MAX,

	// <ePcTRV = 0x0>
	ePcTRV = 0,

	// <ePcSNB = 0x1>
	ePcSNB = 1,

	// <ePcHEN = 0x2>
	ePcHEN = 2,

	// <ePcKindMax = 0x3>
	ePcKindMax = 3

};

// [Structure] struct stBtEffect
struct stBtEffect
{
public:
	// enum stBtEffect::SlowType
	enum SlowType : uint32_t
	{
		// <FinishInput = 0x0>
		FinishInput = 0,

		// <BossFinish = 0x1>
		BossFinish = 1

	};

	/// Struct member variables

	// <class HrScreenStatus* pScreenStatus, offset 0x0>
	class HrScreenStatus* pScreenStatus = nullptr;

	// <class HrEffectShutter* pShutter, offset 0x4>
	class HrEffectShutter* pShutter = nullptr;

	// <class EfSmoke* pSmoke, offset 0x8>
	class EfSmoke* pSmoke = nullptr;

	// <int32_t slowMotTotalTick, offset 0xc>
	int32_t slowMotTotalTick = 0;

	// <int32_t slowMotTick, offset 0x10>
	int32_t slowMotTick = 0;

	// <enum stBtEffect::SlowType slowType, offset 0x14>
	enum stBtEffect::SlowType slowType;

	// <int32_t bulletSlowTick, offset 0x18>
	int32_t bulletSlowTick = 0;

	// <int32_t bossBreakSlowTick, offset 0x1c>
	int32_t bossBreakSlowTick = 0;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct stBtEffect [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(stBtEffect& InObject)
	{
		pScreenStatus = InObject.pScreenStatus;
		pShutter = InObject.pShutter;
		pSmoke = InObject.pSmoke;
		slowMotTotalTick = InObject.slowMotTotalTick;
		slowMotTick = InObject.slowMotTick;
		slowType = InObject.slowType;
		bulletSlowTick = InObject.bulletSlowTick;
		bossBreakSlowTick = InObject.bossBreakSlowTick;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stBtEffect>("stBtEffect")
			.addFunction("__tostring", &stBtEffect::ToString)
			.addFunction("GetPtrAddr", &stBtEffect::GetPtrAddr)
			.addProperty("pScreenStatus", &stBtEffect::pScreenStatus)
			.addProperty("pShutter", &stBtEffect::pShutter)
			.addProperty("pSmoke", &stBtEffect::pSmoke)
			.addProperty("slowMotTotalTick", &stBtEffect::slowMotTotalTick)
			.addProperty("slowMotTick", &stBtEffect::slowMotTick)
			.addProperty("slowType", &stBtEffect::slowType)
			.addProperty("bulletSlowTick", &stBtEffect::bulletSlowTick)
			.addProperty("bossBreakSlowTick", &stBtEffect::bossBreakSlowTick)
		.endClass();
	}
#endif
};
static_assert(sizeof(stBtEffect::pScreenStatus) == 4, "expected stBtEffect::pScreenStatus to be size 4");
static_assert(sizeof(stBtEffect::pShutter) == 4, "expected stBtEffect::pShutter to be size 4");
static_assert(sizeof(stBtEffect::pSmoke) == 4, "expected stBtEffect::pSmoke to be size 4");
static_assert(sizeof(stBtEffect::slowMotTotalTick) == 4, "expected stBtEffect::slowMotTotalTick to be size 4");
static_assert(sizeof(stBtEffect::slowMotTick) == 4, "expected stBtEffect::slowMotTick to be size 4");
static_assert(sizeof(stBtEffect::slowType) == 4, "expected stBtEffect::slowType to be size 4");
static_assert(sizeof(stBtEffect::bulletSlowTick) == 4, "expected stBtEffect::bulletSlowTick to be size 4");
static_assert(sizeof(stBtEffect::bossBreakSlowTick) == 4, "expected stBtEffect::bossBreakSlowTick to be size 4");
static_assert(sizeof(stBtEffect) == 0x20, "expected stBtEffect to be size 0x20");

// [Structure] class mHRBattle
class mHRBattle
{
public:
	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[4];

public:
	// <int32_t PlayerInitializedState, offset 0x4>
	int32_t PlayerInitializedState = 0;

	// <Unidentified data segment, offset 0x8>
private:
	char _UnidentifiedData_8[4];

public:
	// <float CameraProjection, offset 0xc>
	float CameraProjection = 0;

	// <Unidentified data segment, offset 0x10>
private:
	char _UnidentifiedData_16[12];

public:
	// <uint8_t LockNavelPos, offset 0x1c>
	uint8_t LockNavelPos = 0;

	// <Unidentified data segment, offset 0x1d>
private:
	char _UnidentifiedData_29[304];

public:
	// <uint8_t CameraMotionEndStop, offset 0x14d>
	uint8_t CameraMotionEndStop = 0;

	// <Unidentified data segment, offset 0x14e>
private:
	char _UnidentifiedData_334[2];

public:
	// <struct stBtEffect btEffect, offset 0x150>
	struct stBtEffect btEffect;

	// <Unidentified data segment, offset 0x170>
private:
	char _UnidentifiedData_368[24];

public:
	// <enum enPcKind PcKind, offset 0x188>
	enum enPcKind PcKind;

	// <class mHRPc* PcPtr, offset 0x18c>
	class mHRPc* PcPtr = nullptr;

	// <Unidentified data segment, offset 0x190>
private:
	char _UnidentifiedData_400[1076];

public:
	// <int32_t WeaponType, offset 0x5c4>
	int32_t WeaponType = 0;

	// <Unidentified data segment, offset 0x5c8>
private:
	char _UnidentifiedData_1480[564];

public:
	// <void* UnknownWeaponPtr, offset 0x7fc>
	void* UnknownWeaponPtr = nullptr;

	// <Unidentified data segment, offset 0x800>
private:
	char _UnidentifiedData_2048[142760];

public:
	// <int32_t TotalKillNum, offset 0x235a8>
	int32_t TotalKillNum = 0;

	// <int32_t KillNum, offset 0x235ac>
	int32_t KillNum = 0;

	// <int32_t RevengeMissionZakoKillNum, offset 0x235b0>
	int32_t RevengeMissionZakoKillNum = 0;

	// <Unidentified data segment, offset 0x235b4>
private:
	char _UnidentifiedData_144820[16];

public:
	// <float NpcAttackRate, offset 0x235c4>
	float NpcAttackRate = 0;

	// <int32_t UnknownInt, offset 0x235c8>
	int32_t UnknownInt = 0;

	// <uint8_t NewGameDataRequest, offset 0x235cc>
	uint8_t NewGameDataRequest = 0;

	// <Unidentified data segment, offset 0x235cd>
private:
	char _UnidentifiedData_144845[7];

public:
	// <struct stPcSaveData SaveData, offset 0x235d4>
	struct stPcSaveData SaveData;

	// <Unidentified data segment, offset 0x23c38>
private:
	char _UnidentifiedData_146488[4];

public:
	/// 170 Functions

	// [Function] class mHRPc* __convention("thiscall") mHRBattle::mGetPcPtr(class mHRBattle* const this) [?mGetPcPtr@mHRBattle@@QAEPAVmHRPc@@XZ]
	typedef class mHRPc*(__thiscall* _mGetPcPtr_mHRBattle__QAEPAVmHRPc__XZ)(class mHRBattle* const thisPtr);
	class mHRPc* mGetPcPtr()
	{
		_mGetPcPtr_mHRBattle__QAEPAVmHRPc__XZ mFunc = (_mGetPcPtr_mHRBattle__QAEPAVmHRPc__XZ)(GameModule + 0x9c010);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetSlowMotionTick(class mHRBattle* const this) [?mGetSlowMotionTick@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetSlowMotionTick_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetSlowMotionTick()
	{
		_mGetSlowMotionTick_mHRBattle__QAEHXZ mFunc = (_mGetSlowMotionTick_mHRBattle__QAEHXZ)(GameModule + 0x9cdf0);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetBulletSlow(class mHRBattle* const this) [?mGetBulletSlow@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetBulletSlow_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetBulletSlow()
	{
		_mGetBulletSlow_mHRBattle__QAEHXZ mFunc = (_mGetBulletSlow_mHRBattle__QAEHXZ)(GameModule + 0x9ce00);
		return mFunc(this);
	}
	// [Function] struct stBtEffect* __convention("thiscall") mHRBattle::mGetBtEffect(class mHRBattle* const this) [?mGetBtEffect@mHRBattle@@QAEPAUstBtEffect@@XZ]
	typedef struct stBtEffect*(__thiscall* _mGetBtEffect_mHRBattle__QAEPAUstBtEffect__XZ)(class mHRBattle* const thisPtr);
	struct stBtEffect* mGetBtEffect()
	{
		_mGetBtEffect_mHRBattle__QAEPAUstBtEffect__XZ mFunc = (_mGetBtEffect_mHRBattle__QAEPAUstBtEffect__XZ)(GameModule + 0x9ce10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetNpcAttackFlag(class mHRBattle* const this, uint8_t arg2) [?mSetNpcAttackFlag@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetNpcAttackFlag_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetNpcAttackFlag(uint8_t arg2)
	{
		_mSetNpcAttackFlag_mHRBattle__QAEX_N_Z mFunc = (_mSetNpcAttackFlag_mHRBattle__QAEX_N_Z)(GameModule + 0x9ce20);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRBattle::mSetNpcAttackRate(class mHRBattle* const this, float arg2) [?mSetNpcAttackRate@mHRBattle@@QAEMM@Z]
	typedef float(__thiscall* _mSetNpcAttackRate_mHRBattle__QAEMM_Z)(class mHRBattle* const thisPtr, float arg2);
	float mSetNpcAttackRate(float arg2)
	{
		_mSetNpcAttackRate_mHRBattle__QAEMM_Z mFunc = (_mSetNpcAttackRate_mHRBattle__QAEMM_Z)(GameModule + 0x9ce50);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::SetNpcDatMax(class mHRBattle* const this, int32_t arg2) [?SetNpcDatMax@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _SetNpcDatMax_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void SetNpcDatMax(int32_t arg2)
	{
		_SetNpcDatMax_mHRBattle__QAEXH_Z mFunc = (_SetNpcDatMax_mHRBattle__QAEXH_Z)(GameModule + 0x9ce90);
		return mFunc(this, arg2);
	}
	// [Function] class EfSmoke* __convention("thiscall") mHRBattle::GetSmokeEf(class mHRBattle* const this) [?GetSmokeEf@mHRBattle@@QAEPAVEfSmoke@@XZ]
	typedef class EfSmoke*(__thiscall* _GetSmokeEf_mHRBattle__QAEPAVEfSmoke__XZ)(class mHRBattle* const thisPtr);
	class EfSmoke* GetSmokeEf()
	{
		_GetSmokeEf_mHRBattle__QAEPAVEfSmoke__XZ mFunc = (_GetSmokeEf_mHRBattle__QAEPAVEfSmoke__XZ)(GameModule + 0x9fbf0);
		return mFunc(this);
	}
	// [Function] enum enPcKind __convention("thiscall") mHRBattle::mGetPcKind(class mHRBattle* const this) [?mGetPcKind@mHRBattle@@QAE?AW4enPcKind@@XZ]
	typedef enum enPcKind(__thiscall* _mGetPcKind_mHRBattle__QAEAW4enPcKind__XZ)(class mHRBattle* const thisPtr);
	/* enum enPcKind */ uint32_t mGetPcKind()
	{
		_mGetPcKind_mHRBattle__QAEAW4enPcKind__XZ mFunc = (_mGetPcKind_mHRBattle__QAEAW4enPcKind__XZ)(GameModule + 0xa2060);
		return (uint32_t)mFunc(this);
	}
	// [Function] enum enBattleFrameProc __convention("thiscall") mHRBattle::mGetFrameProc(class mHRBattle* const this) [?mGetFrameProc@mHRBattle@@QAE?AW4enBattleFrameProc@@XZ]
	typedef enum enBattleFrameProc(__thiscall* _mGetFrameProc_mHRBattle__QAEAW4enBattleFrameProc__XZ)(class mHRBattle* const thisPtr);
	/* enum enBattleFrameProc */ uint32_t mGetFrameProc()
	{
		_mGetFrameProc_mHRBattle__QAEAW4enBattleFrameProc__XZ mFunc = (_mGetFrameProc_mHRBattle__QAEAW4enBattleFrameProc__XZ)(GameModule + 0xa2070);
		return (uint32_t)mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraAngle(class mHRBattle* const this, float arg2) [?mSetCameraAngle@mHRBattle@@QAEXM@Z]
	typedef void(__thiscall* _mSetCameraAngle_mHRBattle__QAEXM_Z)(class mHRBattle* const thisPtr, float arg2);
	void mSetCameraAngle(float arg2)
	{
		_mSetCameraAngle_mHRBattle__QAEXM_Z mFunc = (_mSetCameraAngle_mHRBattle__QAEXM_Z)(GameModule + 0xa2080);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCamMotFlag(class mHRBattle* const this, uint8_t arg2) [?mSetCamMotFlag@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetCamMotFlag_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetCamMotFlag(uint8_t arg2)
	{
		_mSetCamMotFlag_mHRBattle__QAEX_N_Z mFunc = (_mSetCamMotFlag_mHRBattle__QAEX_N_Z)(GameModule + 0xa20b0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCamMotFlagNoUse(class mHRBattle* const this, uint8_t arg2) [?mSetCamMotFlagNoUse@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetCamMotFlagNoUse_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetCamMotFlagNoUse(uint8_t arg2)
	{
		_mSetCamMotFlagNoUse_mHRBattle__QAEX_N_Z mFunc = (_mSetCamMotFlagNoUse_mHRBattle__QAEX_N_Z)(GameModule + 0xa20c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraAutoReturnDisEnable(class mHRBattle* const this, uint8_t arg2) [?mSetCameraAutoReturnDisEnable@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetCameraAutoReturnDisEnable_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetCameraAutoReturnDisEnable(uint8_t arg2)
	{
		_mSetCameraAutoReturnDisEnable_mHRBattle__QAEX_N_Z mFunc = (_mSetCameraAutoReturnDisEnable_mHRBattle__QAEX_N_Z)(GameModule + 0xa20e0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mClearKillNum(class mHRBattle* const this) [?mClearKillNum@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mClearKillNum_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mClearKillNum()
	{
		_mClearKillNum_mHRBattle__QAEXXZ mFunc = (_mClearKillNum_mHRBattle__QAEXXZ)(GameModule + 0xa2100);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetKillNum(class mHRBattle* const this) [?mGetKillNum@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetKillNum_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetKillNum()
	{
		_mGetKillNum_mHRBattle__QAEHXZ mFunc = (_mGetKillNum_mHRBattle__QAEHXZ)(GameModule + 0xa2110);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetKillNum(class mHRBattle* const this, int32_t arg2) [?mSetKillNum@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mSetKillNum_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mSetKillNum(int32_t arg2)
	{
		_mSetKillNum_mHRBattle__QAEXH_Z mFunc = (_mSetKillNum_mHRBattle__QAEXH_Z)(GameModule + 0xa2120);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetRevengeMissionZakoKillNum(class mHRBattle* const this) [?GetRevengeMissionZakoKillNum@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _GetRevengeMissionZakoKillNum_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t GetRevengeMissionZakoKillNum()
	{
		_GetRevengeMissionZakoKillNum_mHRBattle__QAEHXZ mFunc = (_GetRevengeMissionZakoKillNum_mHRBattle__QAEHXZ)(GameModule + 0xa2140);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::ClearRevengeMissionZakoKillNum(class mHRBattle* const this) [?ClearRevengeMissionZakoKillNum@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _ClearRevengeMissionZakoKillNum_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void ClearRevengeMissionZakoKillNum()
	{
		_ClearRevengeMissionZakoKillNum_mHRBattle__QAEXXZ mFunc = (_ClearRevengeMissionZakoKillNum_mHRBattle__QAEXXZ)(GameModule + 0xa2150);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetBattlePause(class mHRBattle* const this, uint8_t arg2) [?mSetBattlePause@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetBattlePause_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetBattlePause(uint8_t arg2)
	{
		_mSetBattlePause_mHRBattle__QAEX_N_Z mFunc = (_mSetBattlePause_mHRBattle__QAEX_N_Z)(GameModule + 0xa2160);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetDispStatusDisEnable(class mHRBattle* const this, uint8_t arg2) [?mSetDispStatusDisEnable@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetDispStatusDisEnable_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetDispStatusDisEnable(uint8_t arg2)
	{
		_mSetDispStatusDisEnable_mHRBattle__QAEX_N_Z mFunc = (_mSetDispStatusDisEnable_mHRBattle__QAEX_N_Z)(GameModule + 0xa2190);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetDispStatusDisEnable(class mHRBattle* const this) [?mGetDispStatusDisEnable@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetDispStatusDisEnable_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetDispStatusDisEnable()
	{
		_mGetDispStatusDisEnable_mHRBattle__QAE_NXZ mFunc = (_mGetDispStatusDisEnable_mHRBattle__QAE_NXZ)(GameModule + 0xa21b0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetChargeDamage(class mHRBattle* const this, uint8_t arg2) [?mSetChargeDamage@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetChargeDamage_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetChargeDamage(uint8_t arg2)
	{
		_mSetChargeDamage_mHRBattle__QAEX_N_Z mFunc = (_mSetChargeDamage_mHRBattle__QAEX_N_Z)(GameModule + 0xa21c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mClearTotalKillNum(class mHRBattle* const this) [?mClearTotalKillNum@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mClearTotalKillNum_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mClearTotalKillNum()
	{
		_mClearTotalKillNum_mHRBattle__QAEXXZ mFunc = (_mClearTotalKillNum_mHRBattle__QAEXXZ)(GameModule + 0xa3860);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetTutoRun(class mHRBattle* const this) [?mGetTutoRun@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetTutoRun_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetTutoRun()
	{
		_mGetTutoRun_mHRBattle__QAE_NXZ mFunc = (_mGetTutoRun_mHRBattle__QAE_NXZ)(GameModule + 0xa3870);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSubRepopNum(class mHRBattle* const this, int32_t arg2) [?mSubRepopNum@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mSubRepopNum_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mSubRepopNum(int32_t arg2)
	{
		_mSubRepopNum_mHRBattle__QAEXH_Z mFunc = (_mSubRepopNum_mHRBattle__QAEXH_Z)(GameModule + 0xa4750);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetRepopTimer(class mHRBattle* const this, int32_t arg2, int32_t arg3) [?mSetRepopTimer@mHRBattle@@QAEXHH@Z]
	typedef void(__thiscall* _mSetRepopTimer_mHRBattle__QAEXHH_Z)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3);
	void mSetRepopTimer(int32_t arg2, int32_t arg3)
	{
		_mSetRepopTimer_mHRBattle__QAEXHH_Z mFunc = (_mSetRepopTimer_mHRBattle__QAEXHH_Z)(GameModule + 0xa4770);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetNewGameDataRequest(class mHRBattle* const this) [?mGetNewGameDataRequest@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetNewGameDataRequest_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetNewGameDataRequest()
	{
		_mGetNewGameDataRequest_mHRBattle__QAE_NXZ mFunc = (_mGetNewGameDataRequest_mHRBattle__QAE_NXZ)(GameModule + 0xa5290);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetDontChangeTeppeiCamera(class mHRBattle* const this) [?mGetDontChangeTeppeiCamera@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetDontChangeTeppeiCamera_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetDontChangeTeppeiCamera()
	{
		_mGetDontChangeTeppeiCamera_mHRBattle__QAE_NXZ mFunc = (_mGetDontChangeTeppeiCamera_mHRBattle__QAE_NXZ)(GameModule + 0xa52a0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetCameraProjection(class mHRBattle* const this) [?mGetCameraProjection@mHRBattle@@QAEMXZ]
	typedef float(__thiscall* _mGetCameraProjection_mHRBattle__QAEMXZ)(class mHRBattle* const thisPtr);
	float mGetCameraProjection()
	{
		_mGetCameraProjection_mHRBattle__QAEMXZ mFunc = (_mGetCameraProjection_mHRBattle__QAEMXZ)(GameModule + 0xa52b0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraMoveFlag(class mHRBattle* const this, uint8_t arg2) [?mSetCameraMoveFlag@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetCameraMoveFlag_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetCameraMoveFlag(uint8_t arg2)
	{
		_mSetCameraMoveFlag_mHRBattle__QAEX_N_Z mFunc = (_mSetCameraMoveFlag_mHRBattle__QAEX_N_Z)(GameModule + 0xa52c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMotionCameraPos(class mHRBattle* const this, struct Vec* arg2) [?mSetMotionCameraPos@mHRBattle@@QAEXPAUVec@@@Z]
	typedef void(__thiscall* _mSetMotionCameraPos_mHRBattle__QAEXPAUVec___Z)(class mHRBattle* const thisPtr, struct Vec* arg2);
	void mSetMotionCameraPos(struct Vec* arg2)
	{
		_mSetMotionCameraPos_mHRBattle__QAEXPAUVec___Z mFunc = (_mSetMotionCameraPos_mHRBattle__QAEXPAUVec___Z)(GameModule + 0xa52d0);
		return mFunc(this, arg2);
	}
	// [Function] struct Vec* __convention("thiscall") mHRBattle::mGetMotionCameraPos(class mHRBattle* const this) [?mGetMotionCameraPos@mHRBattle@@QAEPAUVec@@XZ]
	typedef struct Vec*(__thiscall* _mGetMotionCameraPos_mHRBattle__QAEPAUVec__XZ)(class mHRBattle* const thisPtr);
	struct Vec* mGetMotionCameraPos()
	{
		_mGetMotionCameraPos_mHRBattle__QAEPAUVec__XZ mFunc = (_mGetMotionCameraPos_mHRBattle__QAEPAUVec__XZ)(GameModule + 0xa52e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMotionCameraY(class mHRBattle* const this, float* arg2) [?mSetMotionCameraY@mHRBattle@@QAEXPAM@Z]
	typedef void(__thiscall* _mSetMotionCameraY_mHRBattle__QAEXPAM_Z)(class mHRBattle* const thisPtr, float* arg2);
	void mSetMotionCameraY(float* arg2)
	{
		_mSetMotionCameraY_mHRBattle__QAEXPAM_Z mFunc = (_mSetMotionCameraY_mHRBattle__QAEXPAM_Z)(GameModule + 0xa52f0);
		return mFunc(this, arg2);
	}
	// [Function] float* __convention("thiscall") mHRBattle::mGetMotionCameraY(class mHRBattle* const this) [?mGetMotionCameraY@mHRBattle@@QAEPAMXZ]
	typedef float*(__thiscall* _mGetMotionCameraY_mHRBattle__QAEPAMXZ)(class mHRBattle* const thisPtr);
	// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetMotionCameraY()
	{
		_mGetMotionCameraY_mHRBattle__QAEPAMXZ mFunc = (_mGetMotionCameraY_mHRBattle__QAEPAMXZ)(GameModule + 0xa5300);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetBattlePause(class mHRBattle* const this) [?mGetBattlePause@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetBattlePause_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetBattlePause()
	{
		_mGetBattlePause_mHRBattle__QAE_NXZ mFunc = (_mGetBattlePause_mHRBattle__QAE_NXZ)(GameModule + 0xa5310);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetChargeDamage(class mHRBattle* const this) [?mGetChargeDamage@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetChargeDamage_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetChargeDamage()
	{
		_mGetChargeDamage_mHRBattle__QAE_NXZ mFunc = (_mGetChargeDamage_mHRBattle__QAE_NXZ)(GameModule + 0xa5320);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetChangeCameraRailFlag(class mHRBattle* const this) [?mGetChangeCameraRailFlag@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetChangeCameraRailFlag_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetChangeCameraRailFlag()
	{
		_mGetChangeCameraRailFlag_mHRBattle__QAE_NXZ mFunc = (_mGetChangeCameraRailFlag_mHRBattle__QAE_NXZ)(GameModule + 0xaa7a0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetCameraAngleX(class mHRBattle* const this) [?mGetCameraAngleX@mHRBattle@@QAEMXZ]
	typedef float(__thiscall* _mGetCameraAngleX_mHRBattle__QAEMXZ)(class mHRBattle* const thisPtr);
	float mGetCameraAngleX()
	{
		_mGetCameraAngleX_mHRBattle__QAEMXZ mFunc = (_mGetCameraAngleX_mHRBattle__QAEMXZ)(GameModule + 0xaa7c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockNavelPos(class mHRBattle* const this, uint8_t arg2) [?mSetLockNavelPos@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetLockNavelPos_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetLockNavelPos(uint8_t arg2)
	{
		_mSetLockNavelPos_mHRBattle__QAEX_N_Z mFunc = (_mSetLockNavelPos_mHRBattle__QAEX_N_Z)(GameModule + 0xaa7d0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetTotalKillNum(class mHRBattle* const this) [?mGetTotalKillNum@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetTotalKillNum_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetTotalKillNum()
	{
		_mGetTotalKillNum_mHRBattle__QAEHXZ mFunc = (_mGetTotalKillNum_mHRBattle__QAEHXZ)(GameModule + 0xaa7f0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetTotalKillNum(class mHRBattle* const this, int32_t arg2) [?mSetTotalKillNum@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mSetTotalKillNum_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mSetTotalKillNum(int32_t arg2)
	{
		_mSetTotalKillNum_mHRBattle__QAEXH_Z mFunc = (_mSetTotalKillNum_mHRBattle__QAEXH_Z)(GameModule + 0xaa800);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetBossBreakSlow(class mHRBattle* const this) [?mGetBossBreakSlow@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetBossBreakSlow_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetBossBreakSlow()
	{
		_mGetBossBreakSlow_mHRBattle__QAEHXZ mFunc = (_mGetBossBreakSlow_mHRBattle__QAEHXZ)(GameModule + 0xaffb0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetNpcAttackFlag(class mHRBattle* const this) [?mGetNpcAttackFlag@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetNpcAttackFlag_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetNpcAttackFlag()
	{
		_mGetNpcAttackFlag_mHRBattle__QAE_NXZ mFunc = (_mGetNpcAttackFlag_mHRBattle__QAE_NXZ)(GameModule + 0xbade0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetNpcAttackRate(class mHRBattle* const this) [?mGetNpcAttackRate@mHRBattle@@QAEMXZ]
	typedef float(__thiscall* _mGetNpcAttackRate_mHRBattle__QAEMXZ)(class mHRBattle* const thisPtr);
	float mGetNpcAttackRate()
	{
		_mGetNpcAttackRate_mHRBattle__QAEMXZ mFunc = (_mGetNpcAttackRate_mHRBattle__QAEMXZ)(GameModule + 0xbae00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::AddRevengeMissionZakoKillNum(class mHRBattle* const this) [?AddRevengeMissionZakoKillNum@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _AddRevengeMissionZakoKillNum_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void AddRevengeMissionZakoKillNum()
	{
		_AddRevengeMissionZakoKillNum_mHRBattle__QAEXXZ mFunc = (_AddRevengeMissionZakoKillNum_mHRBattle__QAEXXZ)(GameModule + 0xbae10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::SetCameraMotionEndStop(class mHRBattle* const this, uint8_t arg2) [?SetCameraMotionEndStop@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _SetCameraMotionEndStop_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void SetCameraMotionEndStop(uint8_t arg2)
	{
		_SetCameraMotionEndStop_mHRBattle__QAEX_N_Z mFunc = (_SetCameraMotionEndStop_mHRBattle__QAEX_N_Z)(GameModule + 0xc1f40);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::IsBgmEffect(class mHRBattle* const this) [?IsBgmEffect@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _IsBgmEffect_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t IsBgmEffect()
	{
		_IsBgmEffect_mHRBattle__QAE_NXZ mFunc = (_IsBgmEffect_mHRBattle__QAE_NXZ)(GameModule + 0xc64c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetDontChangeTeppeiCamera(class mHRBattle* const this, uint8_t arg2) [?mSetDontChangeTeppeiCamera@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetDontChangeTeppeiCamera_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetDontChangeTeppeiCamera(uint8_t arg2)
	{
		_mSetDontChangeTeppeiCamera_mHRBattle__QAEX_N_Z mFunc = (_mSetDontChangeTeppeiCamera_mHRBattle__QAEX_N_Z)(GameModule + 0xc8b00);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::UpdateMassKillAchievement(class mHRBattle* const this) [?UpdateMassKillAchievement@mHRBattle@@AAEXXZ]
	typedef void(__thiscall* _UpdateMassKillAchievement_mHRBattle__AAEXXZ)(class mHRBattle* const thisPtr);
	void UpdateMassKillAchievement()
	{
		_UpdateMassKillAchievement_mHRBattle__AAEXXZ mFunc = (_UpdateMassKillAchievement_mHRBattle__AAEXXZ)(GameModule + 0x3f38c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::UpdateMainScreenUI(class mHRBattle* const this) [?UpdateMainScreenUI@mHRBattle@@AAEXXZ]
	typedef void(__thiscall* _UpdateMainScreenUI_mHRBattle__AAEXXZ)(class mHRBattle* const thisPtr);
	void UpdateMainScreenUI()
	{
		_UpdateMainScreenUI_mHRBattle__AAEXXZ mFunc = (_UpdateMainScreenUI_mHRBattle__AAEXXZ)(GameModule + 0x3f39e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::BgmEffectProc(class mHRBattle* const this) [?BgmEffectProc@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _BgmEffectProc_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void BgmEffectProc()
	{
		_BgmEffectProc_mHRBattle__QAEXXZ mFunc = (_BgmEffectProc_mHRBattle__QAEXXZ)(GameModule + 0x3f3cb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::SetBgmEffect(class mHRBattle* const this, float arg2, int32_t arg3) [?SetBgmEffect@mHRBattle@@QAEXMH@Z]
	typedef void(__thiscall* _SetBgmEffect_mHRBattle__QAEXMH_Z)(class mHRBattle* const thisPtr, float arg2, int32_t arg3);
	void SetBgmEffect(float arg2, int32_t arg3)
	{
		_SetBgmEffect_mHRBattle__QAEXMH_Z mFunc = (_SetBgmEffect_mHRBattle__QAEXMH_Z)(GameModule + 0x3f3d00);
		return mFunc(this, arg2, arg3);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::GetNpc(class mHRBattle* const this, int32_t arg2) [?GetNpc@mHRBattle@@QAEPAVmHRChara@@H@Z]
	typedef class mHRChara*(__thiscall* _GetNpc_mHRBattle__QAEPAVmHRChara__H_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	class mHRChara* GetNpc(int32_t arg2)
	{
		_GetNpc_mHRBattle__QAEPAVmHRChara__H_Z mFunc = (_GetNpc_mHRBattle__QAEPAVmHRChara__H_Z)(GameModule + 0x3f3d80);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckPcLoaded4WepaponChange(class mHRBattle* const this) [?mCheckPcLoaded4WepaponChange@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckPcLoaded4WepaponChange_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckPcLoaded4WepaponChange()
	{
		_mCheckPcLoaded4WepaponChange_mHRBattle__QAE_NXZ mFunc = (_mCheckPcLoaded4WepaponChange_mHRBattle__QAE_NXZ)(GameModule + 0x3f3dc0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckBattleInit(class mHRBattle* const this) [?mCheckBattleInit@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckBattleInit_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckBattleInit()
	{
		_mCheckBattleInit_mHRBattle__QAE_NXZ mFunc = (_mCheckBattleInit_mHRBattle__QAE_NXZ)(GameModule + 0x3f3e20);
		return mFunc(this);
	}
	// [Function] uint8_t mHRBattle::ChkToiletStage() [?ChkToiletStage@mHRBattle@@SA_NXZ]
	typedef uint8_t(__fastcall* _ChkToiletStage_mHRBattle__SA_NXZ)();
	static uint8_t ChkToiletStage()
	{
		_ChkToiletStage_mHRBattle__SA_NXZ mFunc = (_ChkToiletStage_mHRBattle__SA_NXZ)(GameModule + 0x3f3e30);
		return mFunc();
	}
	// [Function] uint8_t mHRBattle::ChkBikeStage() [?ChkBikeStage@mHRBattle@@SA_NXZ]
	typedef uint8_t(__fastcall* _ChkBikeStage_mHRBattle__SA_NXZ)();
	static uint8_t ChkBikeStage()
	{
		_ChkBikeStage_mHRBattle__SA_NXZ mFunc = (_ChkBikeStage_mHRBattle__SA_NXZ)(GameModule + 0x3f3e40);
		return mFunc();
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetPickUpGomiSubMissionResult(class mHRBattle* const this, int32_t arg2) [?GetPickUpGomiSubMissionResult@mHRBattle@@QAEHH@Z]
	typedef int32_t(__thiscall* _GetPickUpGomiSubMissionResult_mHRBattle__QAEHH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	int32_t GetPickUpGomiSubMissionResult(int32_t arg2)
	{
		_GetPickUpGomiSubMissionResult_mHRBattle__QAEHH_Z mFunc = (_GetPickUpGomiSubMissionResult_mHRBattle__QAEHH_Z)(GameModule + 0x3f3e60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mAddKillNum(class mHRBattle* const this) [?mAddKillNum@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mAddKillNum_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mAddKillNum()
	{
		_mAddKillNum_mHRBattle__QAEXXZ mFunc = (_mAddKillNum_mHRBattle__QAEXXZ)(GameModule + 0x3f3e90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mSetNpcAppear(class mHRBattle* const this, int32_t arg2) [?mSetNpcAppear@mHRBattle@@QAE_NH@Z]
	typedef uint8_t(__thiscall* _mSetNpcAppear_mHRBattle__QAE_NH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	uint8_t mSetNpcAppear(int32_t arg2)
	{
		_mSetNpcAppear_mHRBattle__QAE_NH_Z mFunc = (_mSetNpcAppear_mHRBattle__QAE_NH_Z)(GameModule + 0x3f3fc0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::FixRotationOfItem(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4) [?FixRotationOfItem@mHRBattle@@QAEXHAAUVec@@ABU2@@Z]
	typedef void(__thiscall* _FixRotationOfItem_mHRBattle__QAEXHAAUVec__ABU2__Z)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4);
	void FixRotationOfItem(int32_t arg2, struct Vec& arg3, struct Vec& arg4)
	{
		_FixRotationOfItem_mHRBattle__QAEXHAAUVec__ABU2__Z mFunc = (_FixRotationOfItem_mHRBattle__QAEXHAAUVec__ABU2__Z)(GameModule + 0x3f4010);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRBattle::FixPositionOfItem(class mHRBattle* const this, int32_t arg2, struct Vec& arg3) [?FixPositionOfItem@mHRBattle@@QAEXHAAUVec@@@Z]
	typedef void(__thiscall* _FixPositionOfItem_mHRBattle__QAEXHAAUVec___Z)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3);
	void FixPositionOfItem(int32_t arg2, struct Vec& arg3)
	{
		_FixPositionOfItem_mHRBattle__QAEXHAAUVec___Z mFunc = (_FixPositionOfItem_mHRBattle__QAEXHAAUVec___Z)(GameModule + 0x3f40e0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitCustomColliderObj(class mHRBattle* const this) [?mSetInitCustomColliderObj@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mSetInitCustomColliderObj_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mSetInitCustomColliderObj()
	{
		_mSetInitCustomColliderObj_mHRBattle__QAEHXZ mFunc = (_mSetInitCustomColliderObj_mHRBattle__QAEHXZ)(GameModule + 0x3f4390);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mSetInitCharaPos(class mHRBattle* const this, class mHRChara* arg2, struct Vec& arg3, struct Vec& arg4) [?mSetInitCharaPos@mHRBattle@@QAE_NPAVmHRChara@@ABUVec@@1@Z]
	typedef uint8_t(__thiscall* _mSetInitCharaPos_mHRBattle__QAE_NPAVmHRChara__ABUVec__1_Z)(class mHRBattle* const thisPtr, class mHRChara* arg2, struct Vec& arg3, struct Vec& arg4);
	uint8_t mSetInitCharaPos(class mHRChara* arg2, struct Vec& arg3, struct Vec& arg4)
	{
		_mSetInitCharaPos_mHRBattle__QAE_NPAVmHRChara__ABUVec__1_Z mFunc = (_mSetInitCharaPos_mHRBattle__QAE_NPAVmHRChara__ABUVec__1_Z)(GameModule + 0x3f4430);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckStatusDispOnlyBattery(class mHRBattle* const this) [?mCheckStatusDispOnlyBattery@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckStatusDispOnlyBattery_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckStatusDispOnlyBattery()
	{
		_mCheckStatusDispOnlyBattery_mHRBattle__QAE_NXZ mFunc = (_mCheckStatusDispOnlyBattery_mHRBattle__QAE_NXZ)(GameModule + 0x3f4520);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckStatusDispWithoutBattery(class mHRBattle* const this) [?mCheckStatusDispWithoutBattery@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckStatusDispWithoutBattery_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckStatusDispWithoutBattery()
	{
		_mCheckStatusDispWithoutBattery_mHRBattle__QAE_NXZ mFunc = (_mCheckStatusDispWithoutBattery_mHRBattle__QAE_NXZ)(GameModule + 0x3f4560);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckStatusDisp(class mHRBattle* const this) [?mCheckStatusDisp@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckStatusDisp_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckStatusDisp()
	{
		_mCheckStatusDisp_mHRBattle__QAE_NXZ mFunc = (_mCheckStatusDisp_mHRBattle__QAE_NXZ)(GameModule + 0x3f4590);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mUndispMoney(class mHRBattle* const this) [?mUndispMoney@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mUndispMoney_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mUndispMoney()
	{
		_mUndispMoney_mHRBattle__QAEXXZ mFunc = (_mUndispMoney_mHRBattle__QAEXXZ)(GameModule + 0x3f45e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mDispMoney(class mHRBattle* const this) [?mDispMoney@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mDispMoney_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mDispMoney()
	{
		_mDispMoney_mHRBattle__QAEXXZ mFunc = (_mDispMoney_mHRBattle__QAEXXZ)(GameModule + 0x3f45f0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetDispPcStatus(class mHRBattle* const this) [?mGetDispPcStatus@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetDispPcStatus_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetDispPcStatus()
	{
		_mGetDispPcStatus_mHRBattle__QAE_NXZ mFunc = (_mGetDispPcStatus_mHRBattle__QAE_NXZ)(GameModule + 0x3f4640);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mReleaseAllNpcWithoutCmnObj(class mHRBattle* const this) [?mReleaseAllNpcWithoutCmnObj@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mReleaseAllNpcWithoutCmnObj_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mReleaseAllNpcWithoutCmnObj()
	{
		_mReleaseAllNpcWithoutCmnObj_mHRBattle__QAE_NXZ mFunc = (_mReleaseAllNpcWithoutCmnObj_mHRBattle__QAE_NXZ)(GameModule + 0x3f4650);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetBulletSlowTick(class mHRBattle* const this, int32_t arg2) [?mSetBulletSlowTick@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mSetBulletSlowTick_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mSetBulletSlowTick(int32_t arg2)
	{
		_mSetBulletSlowTick_mHRBattle__QAEXH_Z mFunc = (_mSetBulletSlowTick_mHRBattle__QAEXH_Z)(GameModule + 0x3f4750);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetBulletSlow(class mHRBattle* const this) [?mResetBulletSlow@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mResetBulletSlow_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mResetBulletSlow()
	{
		_mResetBulletSlow_mHRBattle__QAEXXZ mFunc = (_mResetBulletSlow_mHRBattle__QAEXXZ)(GameModule + 0x3f4770);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetSlowMotion(class mHRBattle* const this) [?mResetSlowMotion@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mResetSlowMotion_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mResetSlowMotion()
	{
		_mResetSlowMotion_mHRBattle__QAEXXZ mFunc = (_mResetSlowMotion_mHRBattle__QAEXXZ)(GameModule + 0x3f47a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mLightReflectEfProc(class mHRBattle* const this) [?mLightReflectEfProc@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mLightReflectEfProc_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mLightReflectEfProc()
	{
		_mLightReflectEfProc_mHRBattle__QAEXXZ mFunc = (_mLightReflectEfProc_mHRBattle__QAEXXZ)(GameModule + 0x3f47d0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCheckSamePopNpcPosAsNpcDat(class mHRBattle* const this, struct Vec& arg2) [?mCheckSamePopNpcPosAsNpcDat@mHRBattle@@QAEXABUVec@@@Z]
	typedef void(__thiscall* _mCheckSamePopNpcPosAsNpcDat_mHRBattle__QAEXABUVec___Z)(class mHRBattle* const thisPtr, struct Vec& arg2);
	void mCheckSamePopNpcPosAsNpcDat(struct Vec& arg2)
	{
		_mCheckSamePopNpcPosAsNpcDat_mHRBattle__QAEXABUVec___Z mFunc = (_mCheckSamePopNpcPosAsNpcDat_mHRBattle__QAEXABUVec___Z)(GameModule + 0x3f4910);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetEmptyNpcDatIndex(class mHRBattle* const this) [?mGetEmptyNpcDatIndex@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetEmptyNpcDatIndex_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetEmptyNpcDatIndex()
	{
		_mGetEmptyNpcDatIndex_mHRBattle__QAEHXZ mFunc = (_mGetEmptyNpcDatIndex_mHRBattle__QAEHXZ)(GameModule + 0x3f4920);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mRestorePcData4Lap(class mHRBattle* const this) [?mRestorePcData4Lap@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mRestorePcData4Lap_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mRestorePcData4Lap()
	{
		_mRestorePcData4Lap_mHRBattle__QAEXXZ mFunc = (_mRestorePcData4Lap_mHRBattle__QAEXXZ)(GameModule + 0x3f4950);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mStorePcData4Lap(class mHRBattle* const this) [?mStorePcData4Lap@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mStorePcData4Lap_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mStorePcData4Lap()
	{
		_mStorePcData4Lap_mHRBattle__QAEXXZ mFunc = (_mStorePcData4Lap_mHRBattle__QAEXXZ)(GameModule + 0x3f4970);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCallPadProcess(class mHRBattle* const this) [?mCallPadProcess@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCallPadProcess_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCallPadProcess()
	{
		_mCallPadProcess_mHRBattle__QAEXXZ mFunc = (_mCallPadProcess_mHRBattle__QAEXXZ)(GameModule + 0x3f4d30);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mClearNpcDat(class mHRBattle* const this, int32_t arg2) [?mClearNpcDat@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mClearNpcDat_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mClearNpcDat(int32_t arg2)
	{
		_mClearNpcDat_mHRBattle__QAEXH_Z mFunc = (_mClearNpcDat_mHRBattle__QAEXH_Z)(GameModule + 0x3f4d60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mEffectProc(class mHRBattle* const this) [?mEffectProc@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mEffectProc_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mEffectProc()
	{
		_mEffectProc_mHRBattle__QAEXXZ mFunc = (_mEffectProc_mHRBattle__QAEXXZ)(GameModule + 0x3f4ea0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetPopNpc(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4) [?mSetPopNpc@mHRBattle@@QAEXHABUVec@@0@Z]
	typedef void(__thiscall* _mSetPopNpc_mHRBattle__QAEXHABUVec__0_Z)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4);
	void mSetPopNpc(int32_t arg2, struct Vec& arg3, struct Vec& arg4)
	{
		_mSetPopNpc_mHRBattle__QAEXHABUVec__0_Z mFunc = (_mSetPopNpc_mHRBattle__QAEXHABUVec__0_Z)(GameModule + 0x3f5140);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mTestNpcType(class mHRBattle* const this, class mHRChara* arg2) [?mTestNpcType@mHRBattle@@QAE_NPAVmHRChara@@@Z]
	typedef uint8_t(__thiscall* _mTestNpcType_mHRBattle__QAE_NPAVmHRChara___Z)(class mHRBattle* const thisPtr, class mHRChara* arg2);
	uint8_t mTestNpcType(class mHRChara* arg2)
	{
		_mTestNpcType_mHRBattle__QAE_NPAVmHRChara___Z mFunc = (_mTestNpcType_mHRBattle__QAE_NPAVmHRChara___Z)(GameModule + 0x3f51b0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetNpcEnterPattern(class mHRBattle* const this, int32_t arg2, int32_t arg3, struct Vec& arg4) [?mSetNpcEnterPattern@mHRBattle@@QAEXHHABUVec@@@Z]
	typedef void(__thiscall* _mSetNpcEnterPattern_mHRBattle__QAEXHHABUVec___Z)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3, struct Vec& arg4);
	void mSetNpcEnterPattern(int32_t arg2, int32_t arg3, struct Vec& arg4)
	{
		_mSetNpcEnterPattern_mHRBattle__QAEXHHABUVec___Z mFunc = (_mSetNpcEnterPattern_mHRBattle__QAEXHHABUVec___Z)(GameModule + 0x3f5210);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetShadowRate4CommonObject(class mHRBattle* const this, int32_t arg2, int32_t arg3) [?mSetShadowRate4CommonObject@mHRBattle@@QAEXHH@Z]
	typedef void(__thiscall* _mSetShadowRate4CommonObject_mHRBattle__QAEXHH_Z)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3);
	void mSetShadowRate4CommonObject(int32_t arg2, int32_t arg3)
	{
		_mSetShadowRate4CommonObject_mHRBattle__QAEXHH_Z mFunc = (_mSetShadowRate4CommonObject_mHRBattle__QAEXHH_Z)(GameModule + 0x3f53a0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCreateNewNpc(class mHRBattle* const this, int32_t arg2, int32_t arg3) [?mCreateNewNpc@mHRBattle@@QAEXHH@Z]
	typedef void(__thiscall* _mCreateNewNpc_mHRBattle__QAEXHH_Z)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3);
	void mCreateNewNpc(int32_t arg2, int32_t arg3)
	{
		_mCreateNewNpc_mHRBattle__QAEXHH_Z mFunc = (_mCreateNewNpc_mHRBattle__QAEXHH_Z)(GameModule + 0x3f5410);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckNpcInitHp(class mHRBattle* const this, float* arg2) [?mCheckNpcInitHp@mHRBattle@@QAE_NPAM@Z]
	typedef uint8_t(__thiscall* _mCheckNpcInitHp_mHRBattle__QAE_NPAM_Z)(class mHRBattle* const thisPtr, float* arg2);
	uint8_t mCheckNpcInitHp(float* arg2)
	{
		_mCheckNpcInitHp_mHRBattle__QAE_NPAM_Z mFunc = (_mCheckNpcInitHp_mHRBattle__QAE_NPAM_Z)(GameModule + 0x3f7a30);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCheckDeadNpc(class mHRBattle* const this) [?mCheckDeadNpc@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCheckDeadNpc_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCheckDeadNpc()
	{
		_mCheckDeadNpc_mHRBattle__QAEXXZ mFunc = (_mCheckDeadNpc_mHRBattle__QAEXXZ)(GameModule + 0x3f7a50);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetEmptyNpcIndex(class mHRBattle* const this) [?mGetEmptyNpcIndex@mHRBattle@@QAEHXZ]
	typedef int32_t(__thiscall* _mGetEmptyNpcIndex_mHRBattle__QAEHXZ)(class mHRBattle* const thisPtr);
	int32_t mGetEmptyNpcIndex()
	{
		_mGetEmptyNpcIndex_mHRBattle__QAEHXZ mFunc = (_mGetEmptyNpcIndex_mHRBattle__QAEHXZ)(GameModule + 0x3f7af0);
		return mFunc(this);
	}
	// [Function] uint32_t __convention("thiscall") mHRBattle::mGetResourceNpcNum(class mHRBattle* const this) [?mGetResourceNpcNum@mHRBattle@@QAEIXZ]
	typedef uint32_t(__thiscall* _mGetResourceNpcNum_mHRBattle__QAEIXZ)(class mHRBattle* const thisPtr);
	uint32_t mGetResourceNpcNum()
	{
		_mGetResourceNpcNum_mHRBattle__QAEIXZ mFunc = (_mGetResourceNpcNum_mHRBattle__QAEIXZ)(GameModule + 0x3f7b10);
		return mFunc(this);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceZakoNpcMotion(class mHRBattle* const this, char* arg2) [?mGetResourceZakoNpcMotion@mHRBattle@@QAEPAXPAD@Z]
	typedef void*(__thiscall* _mGetResourceZakoNpcMotion_mHRBattle__QAEPAXPAD_Z)(class mHRBattle* const thisPtr, char* arg2);
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceZakoNpcMotion(std::string arg2)
	{
		std::vector<char> arg2_c_str(arg2.c_str(), + arg2.c_str() + arg2.size() + 1);
		_mGetResourceZakoNpcMotion_mHRBattle__QAEPAXPAD_Z mFunc = (_mGetResourceZakoNpcMotion_mHRBattle__QAEPAXPAD_Z)(GameModule + 0x3f7bb0);
		mFunc(this, &arg2_c_str[0]);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceZakoCmnMotion(class mHRBattle* const this, int32_t arg2) [?mGetResourceZakoCmnMotion@mHRBattle@@QAEPAXH@Z]
	typedef void*(__thiscall* _mGetResourceZakoCmnMotion_mHRBattle__QAEPAXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceZakoCmnMotion(int32_t arg2)
	{
		_mGetResourceZakoCmnMotion_mHRBattle__QAEPAXH_Z mFunc = (_mGetResourceZakoCmnMotion_mHRBattle__QAEPAXH_Z)(GameModule + 0x3f7cc0);
		mFunc(this, arg2);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceZakoWepMotion(class mHRBattle* const this, int32_t arg2) [?mGetResourceZakoWepMotion@mHRBattle@@QAEPAXH@Z]
	typedef void*(__thiscall* _mGetResourceZakoWepMotion_mHRBattle__QAEPAXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceZakoWepMotion(int32_t arg2)
	{
		_mGetResourceZakoWepMotion_mHRBattle__QAEPAXH_Z mFunc = (_mGetResourceZakoWepMotion_mHRBattle__QAEPAXH_Z)(GameModule + 0x3f7cf0);
		mFunc(this, arg2);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceNpc(class mHRBattle* const this, int32_t arg2, char const** arg3) [?mGetResourceNpc@mHRBattle@@QAEPAXHPAPBD@Z]
	typedef void*(__thiscall* _mGetResourceNpc_mHRBattle__QAEPAXHPAPBD_Z)(class mHRBattle* const thisPtr, int32_t arg2, char const** arg3);
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceNpc(int32_t arg2, char const** arg3)
	{
		_mGetResourceNpc_mHRBattle__QAEPAXHPAPBD_Z mFunc = (_mGetResourceNpc_mHRBattle__QAEPAXHPAPBD_Z)(GameModule + 0x3f7d90);
		mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetNpcDatIndexByCharPtr(class mHRBattle* const this, class mHRChara* arg2) [?GetNpcDatIndexByCharPtr@mHRBattle@@QAEHPAVmHRChara@@@Z]
	typedef int32_t(__thiscall* _GetNpcDatIndexByCharPtr_mHRBattle__QAEHPAVmHRChara___Z)(class mHRBattle* const thisPtr, class mHRChara* arg2);
	int32_t GetNpcDatIndexByCharPtr(class mHRChara* arg2)
	{
		_GetNpcDatIndexByCharPtr_mHRBattle__QAEHPAVmHRChara___Z mFunc = (_GetNpcDatIndexByCharPtr_mHRBattle__QAEHPAVmHRChara___Z)(GameModule + 0x3f7e70);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotD(class mHRBattle* const this) [?mCameraRotD@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCameraRotD_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCameraRotD()
	{
		_mCameraRotD_mHRBattle__QAEXXZ mFunc = (_mCameraRotD_mHRBattle__QAEXXZ)(GameModule + 0x3f7ed0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotU(class mHRBattle* const this) [?mCameraRotU@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCameraRotU_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCameraRotU()
	{
		_mCameraRotU_mHRBattle__QAEXXZ mFunc = (_mCameraRotU_mHRBattle__QAEXXZ)(GameModule + 0x3f7f50);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotR(class mHRBattle* const this) [?mCameraRotR@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCameraRotR_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCameraRotR()
	{
		_mCameraRotR_mHRBattle__QAEXXZ mFunc = (_mCameraRotR_mHRBattle__QAEXXZ)(GameModule + 0x3f7fd0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotL(class mHRBattle* const this) [?mCameraRotL@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCameraRotL_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCameraRotL()
	{
		_mCameraRotL_mHRBattle__QAEXXZ mFunc = (_mCameraRotL_mHRBattle__QAEXXZ)(GameModule + 0x3f8080);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraFrameProc(class mHRBattle* const this) [?mCameraFrameProc@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mCameraFrameProc_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mCameraFrameProc()
	{
		_mCameraFrameProc_mHRBattle__QAEXXZ mFunc = (_mCameraFrameProc_mHRBattle__QAEXXZ)(GameModule + 0x3f8130);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraOffset4Fps(class mHRBattle* const this, float arg2, float arg3, float arg4, int32_t arg5) [?mSetCameraOffset4Fps@mHRBattle@@QAEXMMMH@Z]
	typedef void(__thiscall* _mSetCameraOffset4Fps_mHRBattle__QAEXMMMH_Z)(class mHRBattle* const thisPtr, float arg2, float arg3, float arg4, int32_t arg5);
	void mSetCameraOffset4Fps(float arg2, float arg3, float arg4, int32_t arg5)
	{
		_mSetCameraOffset4Fps_mHRBattle__QAEXMMMH_Z mFunc = (_mSetCameraOffset4Fps_mHRBattle__QAEXMMMH_Z)(GameModule + 0x3f8e40);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetCameraOffset4Fps(class mHRBattle* const this, int32_t arg2) [?mResetCameraOffset4Fps@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mResetCameraOffset4Fps_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mResetCameraOffset4Fps(int32_t arg2)
	{
		_mResetCameraOffset4Fps_mHRBattle__QAEXH_Z mFunc = (_mResetCameraOffset4Fps_mHRBattle__QAEXH_Z)(GameModule + 0x3f8f00);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraOffset4En(class mHRBattle* const this, float arg2, float arg3, float arg4, int32_t arg5) [?mSetCameraOffset4En@mHRBattle@@QAEXMMMH@Z]
	typedef void(__thiscall* _mSetCameraOffset4En_mHRBattle__QAEXMMMH_Z)(class mHRBattle* const thisPtr, float arg2, float arg3, float arg4, int32_t arg5);
	void mSetCameraOffset4En(float arg2, float arg3, float arg4, int32_t arg5)
	{
		_mSetCameraOffset4En_mHRBattle__QAEXMMMH_Z mFunc = (_mSetCameraOffset4En_mHRBattle__QAEXMMMH_Z)(GameModule + 0x3f8fd0);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraOffset4Pc(class mHRBattle* const this, float arg2, float arg3, float arg4, int32_t arg5) [?mSetCameraOffset4Pc@mHRBattle@@QAEXMMMH@Z]
	typedef void(__thiscall* _mSetCameraOffset4Pc_mHRBattle__QAEXMMMH_Z)(class mHRBattle* const thisPtr, float arg2, float arg3, float arg4, int32_t arg5);
	void mSetCameraOffset4Pc(float arg2, float arg3, float arg4, int32_t arg5)
	{
		_mSetCameraOffset4Pc_mHRBattle__QAEXMMMH_Z mFunc = (_mSetCameraOffset4Pc_mHRBattle__QAEXMMMH_Z)(GameModule + 0x3f9090);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockOnCameraZoomIn(class mHRBattle* const this, int32_t arg2) [?mSetLockOnCameraZoomIn@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mSetLockOnCameraZoomIn_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mSetLockOnCameraZoomIn(int32_t arg2)
	{
		_mSetLockOnCameraZoomIn_mHRBattle__QAEXH_Z mFunc = (_mSetLockOnCameraZoomIn_mHRBattle__QAEXH_Z)(GameModule + 0x3f9130);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockOnCameraZoomOut(class mHRBattle* const this, int32_t arg2) [?mSetLockOnCameraZoomOut@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mSetLockOnCameraZoomOut_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mSetLockOnCameraZoomOut(int32_t arg2)
	{
		_mSetLockOnCameraZoomOut_mHRBattle__QAEXH_Z mFunc = (_mSetLockOnCameraZoomOut_mHRBattle__QAEXH_Z)(GameModule + 0x3f91f0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetLockOnCameraZoom(class mHRBattle* const this, int32_t arg2) [?mResetLockOnCameraZoom@mHRBattle@@QAEXH@Z]
	typedef void(__thiscall* _mResetLockOnCameraZoom_mHRBattle__QAEXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	void mResetLockOnCameraZoom(int32_t arg2)
	{
		_mResetLockOnCameraZoom_mHRBattle__QAEXH_Z mFunc = (_mResetLockOnCameraZoom_mHRBattle__QAEXH_Z)(GameModule + 0x3f92c0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckUndispStatusStage(class mHRBattle* const this) [?mCheckUndispStatusStage@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckUndispStatusStage_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckUndispStatusStage()
	{
		_mCheckUndispStatusStage_mHRBattle__QAE_NXZ mFunc = (_mCheckUndispStatusStage_mHRBattle__QAE_NXZ)(GameModule + 0x3f9390);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMoveInitCamera4MiniDemo(class mHRBattle* const this) [?mSetMoveInitCamera4MiniDemo@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mSetMoveInitCamera4MiniDemo_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mSetMoveInitCamera4MiniDemo()
	{
		_mSetMoveInitCamera4MiniDemo_mHRBattle__QAEXXZ mFunc = (_mSetMoveInitCamera4MiniDemo_mHRBattle__QAEXXZ)(GameModule + 0x3f93a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockOnCamera(class mHRBattle* const this) [?mSetLockOnCamera@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mSetLockOnCamera_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mSetLockOnCamera()
	{
		_mSetLockOnCamera_mHRBattle__QAEXXZ mFunc = (_mSetLockOnCamera_mHRBattle__QAEXXZ)(GameModule + 0x3f9470);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mPcTerm(class mHRBattle* const this) [?mPcTerm@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mPcTerm_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mPcTerm()
	{
		_mPcTerm_mHRBattle__QAE_NXZ mFunc = (_mPcTerm_mHRBattle__QAE_NXZ)(GameModule + 0x3f9480);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mPcInit(class mHRBattle* const this) [?mPcInit@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mPcInit_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mPcInit()
	{
		_mPcInit_mHRBattle__QAE_NXZ mFunc = (_mPcInit_mHRBattle__QAE_NXZ)(GameModule + 0x3f94e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mPopPcSaveData(class mHRBattle* const this) [?mPopPcSaveData@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mPopPcSaveData_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mPopPcSaveData()
	{
		_mPopPcSaveData_mHRBattle__QAEXXZ mFunc = (_mPopPcSaveData_mHRBattle__QAEXXZ)(GameModule + 0x3f9980);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mPushPcSaveData(class mHRBattle* const this) [?mPushPcSaveData@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mPushPcSaveData_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mPushPcSaveData()
	{
		_mPushPcSaveData_mHRBattle__QAEXXZ mFunc = (_mPushPcSaveData_mHRBattle__QAEXXZ)(GameModule + 0x3f99c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mInitStart(class mHRBattle* const this) [?mInitStart@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mInitStart_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mInitStart()
	{
		_mInitStart_mHRBattle__QAEXXZ mFunc = (_mInitStart_mHRBattle__QAEXXZ)(GameModule + 0x3f99f0);
		return mFunc(this);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceCmnObj(class mHRBattle* const this, int32_t arg2) [?mGetResourceCmnObj@mHRBattle@@QAEPAXH@Z]
	typedef void*(__thiscall* _mGetResourceCmnObj_mHRBattle__QAEPAXH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceCmnObj(int32_t arg2)
	{
		_mGetResourceCmnObj_mHRBattle__QAEPAXH_Z mFunc = (_mGetResourceCmnObj_mHRBattle__QAEPAXH_Z)(GameModule + 0x3f9cb0);
		mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLightReflecte(class mHRBattle* const this, struct Vec& arg2, float const arg3, uint32_t const arg4, int32_t const arg5, float const arg6, enum eLightRefPriority arg7) [?mSetLightReflecte@mHRBattle@@QAEXABUVec@@MIHMW4eLightRefPriority@@@Z]
	typedef void(__thiscall* _mSetLightReflecte_mHRBattle__QAEXABUVec__MIHMW4eLightRefPriority___Z)(class mHRBattle* const thisPtr, struct Vec& arg2, float const arg3, uint32_t const arg4, int32_t const arg5, float const arg6, enum eLightRefPriority arg7);
	void mSetLightReflecte(struct Vec& arg2, float const arg3, uint32_t const arg4, int32_t const arg5, float const arg6, /* enum eLightRefPriority */ uint32_t arg7)
	{
		_mSetLightReflecte_mHRBattle__QAEXABUVec__MIHMW4eLightRefPriority___Z mFunc = (_mSetLightReflecte_mHRBattle__QAEXABUVec__MIHMW4eLightRefPriority___Z)(GameModule + 0x3f9d50);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, (enum eLightRefPriority)arg7);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mInit(class mHRBattle* const this) [?mInit@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mInit_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mInit()
	{
		_mInit_mHRBattle__QAE_NXZ mFunc = (_mInit_mHRBattle__QAE_NXZ)(GameModule + 0x3fa000);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mFrameProc(class mHRBattle* const this) [?mFrameProc@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mFrameProc_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mFrameProc()
	{
		_mFrameProc_mHRBattle__QAE_NXZ mFunc = (_mFrameProc_mHRBattle__QAE_NXZ)(GameModule + 0x3fa0a0);
		return mFunc(this);
	}
private:
	// Hook: Pre
	inline static _mFrameProc_mHRBattle__QAE_NXZ _original_mFrameProc = nullptr;
	inline static std::unordered_set<std::string> _callbacks_mFrameProc_pre;
	inline static std::unordered_set<std::string> _callbacks_mFrameProc_post;
	static uint8_t __fastcall mFrameProc_OnHook(class mHRBattle* const thisPtr, void* EDX)
	{
#if WITH_LUA
		std::unordered_set<std::string>::iterator it = _callbacks_mFrameProc_pre.begin();
		while (it != _callbacks_mFrameProc_pre.end())
		{
			std::lock_guard<std::mutex> guard(LuaStateMutex);
			lua_getglobal(LuaState, it->c_str());
			if (!lua_isfunction(LuaState, -1))
			{
				lua_pop(LuaState, 1);
				it = _callbacks_mFrameProc_pre.erase(it);
			}
			else
			{
				if (!CheckLua(LuaState, lua_pcall(LuaState, 0, 0, 0)))
					lua_pop(LuaState, 1);
				it++;
			}
		}
#endif
		uint8_t Result = _original_mFrameProc(thisPtr);
#if WITH_LUA
		it = _callbacks_mFrameProc_post.begin();
		while (it != _callbacks_mFrameProc_post.end())
		{
			std::lock_guard<std::mutex> guard(LuaStateMutex);
			lua_getglobal(LuaState, it->c_str());
			if (!lua_isfunction(LuaState, -1))
			{
				lua_pop(LuaState, 1);
				it = _callbacks_mFrameProc_post.erase(it);
			}
			else
			{
				if (!CheckLua(LuaState, lua_pcall(LuaState, 0, 0, 0)))
					lua_pop(LuaState, 1);
				it++;
			}
		}
#endif
		return Result;
	}
public:
	// Hook: Register
#if WITH_LUA
	static void mFrameProc_RegisterHook(std::string HookName, bool bPostHook)
	{
		if (!HookName.empty() && !bPostHook) _callbacks_mFrameProc_pre.insert(HookName);
		if (!HookName.empty() && bPostHook) _callbacks_mFrameProc_post.insert(HookName);
		if (_original_mFrameProc == nullptr)
		{
			_original_mFrameProc = (_mFrameProc_mHRBattle__QAE_NXZ)mem::TrampHook((BYTE*)GameModule + 0x3fa0a0, (BYTE*)mFrameProc_OnHook, 0x6);
			assert(_original_mFrameProc);
		}
	}
#endif
	// [Function] void __convention("thiscall") mHRBattle::mSetVisibleAll(class mHRBattle* const this, uint8_t arg2) [?mSetVisibleAll@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetVisibleAll_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetVisibleAll(uint8_t arg2)
	{
		_mSetVisibleAll_mHRBattle__QAEX_N_Z mFunc = (_mSetVisibleAll_mHRBattle__QAEX_N_Z)(GameModule + 0x3fa310);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetOperateAll(class mHRBattle* const this, uint8_t arg2) [?mSetOperateAll@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetOperateAll_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetOperateAll(uint8_t arg2)
	{
		_mSetOperateAll_mHRBattle__QAEX_N_Z mFunc = (_mSetOperateAll_mHRBattle__QAEX_N_Z)(GameModule + 0x3fa370);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetNewGameDataRequest(class mHRBattle* const this, uint8_t arg2) [?mSetNewGameDataRequest@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetNewGameDataRequest_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetNewGameDataRequest(uint8_t arg2)
	{
		_mSetNewGameDataRequest_mHRBattle__QAEX_N_Z mFunc = (_mSetNewGameDataRequest_mHRBattle__QAEX_N_Z)(GameModule + 0x3fa3b0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mTerm(class mHRBattle* const this) [?mTerm@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mTerm_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mTerm()
	{
		_mTerm_mHRBattle__QAE_NXZ mFunc = (_mTerm_mHRBattle__QAE_NXZ)(GameModule + 0x3fa3d0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mPostRenderProc(class mHRBattle* const this) [?mPostRenderProc@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mPostRenderProc_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mPostRenderProc()
	{
		_mPostRenderProc_mHRBattle__QAE_NXZ mFunc = (_mPostRenderProc_mHRBattle__QAE_NXZ)(GameModule + 0x3fa480);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetBowlingSubMissionResult(class mHRBattle* const this, int32_t arg2) [?GetBowlingSubMissionResult@mHRBattle@@QAEHH@Z]
	typedef int32_t(__thiscall* _GetBowlingSubMissionResult_mHRBattle__QAEHH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	int32_t GetBowlingSubMissionResult(int32_t arg2)
	{
		_GetBowlingSubMissionResult_mHRBattle__QAEHH_Z mFunc = (_GetBowlingSubMissionResult_mHRBattle__QAEHH_Z)(GameModule + 0x3fa4f0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckPcLoaded(class mHRBattle* const this) [?mCheckPcLoaded@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mCheckPcLoaded_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckPcLoaded()
	{
		_mCheckPcLoaded_mHRBattle__QAE_NXZ mFunc = (_mCheckPcLoaded_mHRBattle__QAE_NXZ)(GameModule + 0x3fa500);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetPcOperate(class mHRBattle* const this) [?mGetPcOperate@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mGetPcOperate_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mGetPcOperate()
	{
		_mGetPcOperate_mHRBattle__QAE_NXZ mFunc = (_mGetPcOperate_mHRBattle__QAE_NXZ)(GameModule + 0x3fa520);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMoveInitCamera(class mHRBattle* const this, uint8_t arg2, uint8_t arg3, uint8_t arg4, uint8_t arg5) [?mSetMoveInitCamera@mHRBattle@@QAEX_N000@Z]
	typedef void(__thiscall* _mSetMoveInitCamera_mHRBattle__QAEX_N000_Z)(class mHRBattle* const thisPtr, uint8_t arg2, uint8_t arg3, uint8_t arg4, uint8_t arg5);
	void mSetMoveInitCamera(uint8_t arg2, uint8_t arg3, uint8_t arg4, uint8_t arg5)
	{
		_mSetMoveInitCamera_mHRBattle__QAEX_N000_Z mFunc = (_mSetMoveInitCamera_mHRBattle__QAEX_N000_Z)(GameModule + 0x3fa540);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mInitStartMainMission(class mHRBattle* const this) [?mInitStartMainMission@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mInitStartMainMission_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mInitStartMainMission()
	{
		_mInitStartMainMission_mHRBattle__QAEXXZ mFunc = (_mInitStartMainMission_mHRBattle__QAEXXZ)(GameModule + 0x3fa6a0);
		return mFunc(this);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::mGetNpcPtr(class mHRBattle* const this, int32_t arg2) [?mGetNpcPtr@mHRBattle@@QAEPAVmHRChara@@H@Z]
	typedef class mHRChara*(__thiscall* _mGetNpcPtr_mHRBattle__QAEPAVmHRChara__H_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	class mHRChara* mGetNpcPtr(int32_t arg2)
	{
		_mGetNpcPtr_mHRBattle__QAEPAVmHRChara__H_Z mFunc = (_mGetNpcPtr_mHRBattle__QAEPAVmHRChara__H_Z)(GameModule + 0x3fa6d0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, uint8_t arg8) [?mSetInitNpcDat@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@_N@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType___N_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, uint8_t arg8);
	int32_t mSetInitNpcDat(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, uint8_t arg8)
	{
		_mSetInitNpcDat_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType___N_Z mFunc = (_mSetInitNpcDat_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType___N_Z)(GameModule + 0x3fa710);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitObjDat(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4, uint8_t arg5, char const* arg6, class TGmfNode* arg7, int32_t arg8, int32_t arg9) [?mSetInitObjDat@mHRBattle@@QAEHHABUVec@@0_NPBDPBVTGmfNode@@HH@Z]
	typedef int32_t(__thiscall* _mSetInitObjDat_mHRBattle__QAEHHABUVec__0_NPBDPBVTGmfNode__HH_Z)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4, uint8_t arg5, char const* arg6, class TGmfNode* arg7, int32_t arg8, int32_t arg9);
	int32_t mSetInitObjDat(int32_t arg2, struct Vec& arg3, struct Vec& arg4, uint8_t arg5, std::string arg6, class TGmfNode* arg7, int32_t arg8, int32_t arg9)
	{
		char const* arg6_c_str = arg6.c_str();
		_mSetInitObjDat_mHRBattle__QAEHHABUVec__0_NPBDPBVTGmfNode__HH_Z mFunc = (_mSetInitObjDat_mHRBattle__QAEHHABUVec__0_NPBDPBVTGmfNode__HH_Z)(GameModule + 0x3fa830);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6_c_str, arg7, arg8, arg9);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetPopType(class mHRBattle* const this, int32_t arg2, enum enPopReqType arg3) [?mSetPopType@mHRBattle@@QAEXHW4enPopReqType@@@Z]
	typedef void(__thiscall* _mSetPopType_mHRBattle__QAEXHW4enPopReqType___Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enPopReqType arg3);
	void mSetPopType(int32_t arg2, /* enum enPopReqType */ uint32_t arg3)
	{
		_mSetPopType_mHRBattle__QAEXHW4enPopReqType___Z mFunc = (_mSetPopType_mHRBattle__QAEXHW4enPopReqType___Z)(GameModule + 0x3fac90);
		return mFunc(this, arg2, (enum enPopReqType)arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mSetPcKind(class mHRBattle* const this, enum enPcKind PcKind, bool ForceUpdate) [?mSetPcKind@mHRBattle@@QAE_NW4enPcKind@@_N@Z]
	typedef uint8_t(__thiscall* _mSetPcKind_mHRBattle__QAE_NW4enPcKind___N_Z)(class mHRBattle* const thisPtr, enum enPcKind PcKind, bool ForceUpdate);
	uint8_t mSetPcKind(/* enum enPcKind */ uint32_t PcKind, bool ForceUpdate)
	{
		_mSetPcKind_mHRBattle__QAE_NW4enPcKind___N_Z mFunc = (_mSetPcKind_mHRBattle__QAE_NW4enPcKind___N_Z)(GameModule + 0x3facc0);
		return mFunc(this, (enum enPcKind)PcKind, ForceUpdate);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat2(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, uint8_t arg11) [?mSetInitNpcDat2@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMM_N@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat2_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMM_N_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, uint8_t arg11);
	int32_t mSetInitNpcDat2(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, int32_t arg8, float arg9, float arg10, uint8_t arg11)
	{
		_mSetInitNpcDat2_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMM_N_Z mFunc = (_mSetInitNpcDat2_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMM_N_Z)(GameModule + 0x3fadc0);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8, arg9, arg10, arg11);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat3(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, uint8_t arg12) [?mSetInitNpcDat3@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMH_N@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat3_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMH_N_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, uint8_t arg12);
	int32_t mSetInitNpcDat3(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, uint8_t arg12)
	{
		_mSetInitNpcDat3_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMH_N_Z mFunc = (_mSetInitNpcDat3_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMH_N_Z)(GameModule + 0x3faef0);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8, arg9, arg10, arg11, arg12);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat4(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13) [?mSetInitNpcDat4@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_N@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat4_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_N_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13);
	int32_t mSetInitNpcDat4(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, std::string arg12, uint8_t arg13)
	{
		std::vector<char> arg12_c_str(arg12.c_str(), + arg12.c_str() + arg12.size() + 1);
		_mSetInitNpcDat4_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_N_Z mFunc = (_mSetInitNpcDat4_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_N_Z)(GameModule + 0x3fb020);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8, arg9, arg10, arg11, &arg12_c_str[0], arg13);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat5(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15) [?mSetInitNpcDat5@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_NMH@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat5_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMH_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15);
	int32_t mSetInitNpcDat5(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, std::string arg12, uint8_t arg13, float arg14, int32_t arg15)
	{
		std::vector<char> arg12_c_str(arg12.c_str(), + arg12.c_str() + arg12.size() + 1);
		_mSetInitNpcDat5_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMH_Z mFunc = (_mSetInitNpcDat5_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMH_Z)(GameModule + 0x3fb190);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8, arg9, arg10, arg11, &arg12_c_str[0], arg13, arg14, arg15);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat6(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16) [?mSetInitNpcDat6@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_NMHH@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat6_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMHH_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16);
	int32_t mSetInitNpcDat6(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, std::string arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16)
	{
		std::vector<char> arg12_c_str(arg12.c_str(), + arg12.c_str() + arg12.size() + 1);
		_mSetInitNpcDat6_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMHH_Z mFunc = (_mSetInitNpcDat6_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMHH_Z)(GameModule + 0x3fb310);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8, arg9, arg10, arg11, &arg12_c_str[0], arg13, arg14, arg15, arg16);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat7(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16) [?mSetInitNpcDat7@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_NMHH@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDat7_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMHH_Z)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16);
	int32_t mSetInitNpcDat7(int32_t arg2, /* enum enCharaType */ uint32_t arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, /* enum enPopReqType */ uint32_t arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, std::string arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16)
	{
		std::vector<char> arg12_c_str(arg12.c_str(), + arg12.c_str() + arg12.size() + 1);
		_mSetInitNpcDat7_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMHH_Z mFunc = (_mSetInitNpcDat7_mHRBattle__QAEHHW4enCharaType__HABUVec__1W4enPopReqType__HMMHPAD_NMHH_Z)(GameModule + 0x3fb4a0);
		return mFunc(this, arg2, (enum enCharaType)arg3, arg4, arg5, arg6, (enum enPopReqType)arg7, arg8, arg9, arg10, arg11, &arg12_c_str[0], arg13, arg14, arg15, arg16);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDatObj095(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6) [?mSetInitNpcDatObj095@mHRBattle@@QAEHHABUVec@@0HH@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDatObj095_mHRBattle__QAEHHABUVec__0HH_Z)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6);
	int32_t mSetInitNpcDatObj095(int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6)
	{
		_mSetInitNpcDatObj095_mHRBattle__QAEHHABUVec__0HH_Z mFunc = (_mSetInitNpcDatObj095_mHRBattle__QAEHHABUVec__0HH_Z)(GameModule + 0x3fb630);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6);
	}
	// [Function] void __convention("thiscall") mHRBattle::mDispPcStatus(class mHRBattle* const this) [?mDispPcStatus@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mDispPcStatus_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mDispPcStatus()
	{
		_mDispPcStatus_mHRBattle__QAEXXZ mFunc = (_mDispPcStatus_mHRBattle__QAEXXZ)(GameModule + 0x3fb740);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mDispMiniMap(class mHRBattle* const this) [?mDispMiniMap@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mDispMiniMap_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mDispMiniMap()
	{
		_mDispMiniMap_mHRBattle__QAEXXZ mFunc = (_mDispMiniMap_mHRBattle__QAEXXZ)(GameModule + 0x3fb750);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mUndispMiniMap(class mHRBattle* const this) [?mUndispMiniMap@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mUndispMiniMap_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mUndispMiniMap()
	{
		_mUndispMiniMap_mHRBattle__QAEXXZ mFunc = (_mUndispMiniMap_mHRBattle__QAEXXZ)(GameModule + 0x3fb7f0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mDeleteNpc(class mHRBattle* const this, int32_t arg2) [?mDeleteNpc@mHRBattle@@QAE_NH@Z]
	typedef uint8_t(__thiscall* _mDeleteNpc_mHRBattle__QAE_NH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	uint8_t mDeleteNpc(int32_t arg2)
	{
		_mDeleteNpc_mHRBattle__QAE_NH_Z mFunc = (_mDeleteNpc_mHRBattle__QAE_NH_Z)(GameModule + 0x3fb810);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::RequestMotionNoNpc(class mHRBattle* const this, enum enCharaType arg2, int32_t arg3, uint8_t arg4) [?RequestMotionNoNpc@mHRBattle@@QAE_NW4enCharaType@@H_N@Z]
	typedef uint8_t(__thiscall* _RequestMotionNoNpc_mHRBattle__QAE_NW4enCharaType__H_N_Z)(class mHRBattle* const thisPtr, enum enCharaType arg2, int32_t arg3, uint8_t arg4);
	uint8_t RequestMotionNoNpc(/* enum enCharaType */ uint32_t arg2, int32_t arg3, uint8_t arg4)
	{
		_RequestMotionNoNpc_mHRBattle__QAE_NW4enCharaType__H_N_Z mFunc = (_RequestMotionNoNpc_mHRBattle__QAE_NW4enCharaType__H_N_Z)(GameModule + 0x3fb8b0);
		return mFunc(this, (enum enCharaType)arg2, arg3, arg4);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::mGetNpcPtrFromCharaType(class mHRBattle* const this, enum enCharaType arg2) [?mGetNpcPtrFromCharaType@mHRBattle@@QAEPAVmHRChara@@W4enCharaType@@@Z]
	typedef class mHRChara*(__thiscall* _mGetNpcPtrFromCharaType_mHRBattle__QAEPAVmHRChara__W4enCharaType___Z)(class mHRBattle* const thisPtr, enum enCharaType arg2);
	class mHRChara* mGetNpcPtrFromCharaType(/* enum enCharaType */ uint32_t arg2)
	{
		_mGetNpcPtrFromCharaType_mHRBattle__QAEPAVmHRChara__W4enCharaType___Z mFunc = (_mGetNpcPtrFromCharaType_mHRBattle__QAEPAVmHRChara__W4enCharaType___Z)(GameModule + 0x3fb970);
		return mFunc(this, (enum enCharaType)arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetZakoNpcMotionProcessDisEnable(class mHRBattle* const this, uint8_t arg2) [?mSetZakoNpcMotionProcessDisEnable@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetZakoNpcMotionProcessDisEnable_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetZakoNpcMotionProcessDisEnable(uint8_t arg2)
	{
		_mSetZakoNpcMotionProcessDisEnable_mHRBattle__QAEX_N_Z mFunc = (_mSetZakoNpcMotionProcessDisEnable_mHRBattle__QAEX_N_Z)(GameModule + 0x3fb9d0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetAspectRate(class mHRBattle* const this, float arg2, int32_t arg3) [?mSetAspectRate@mHRBattle@@QAEXMH@Z]
	typedef void(__thiscall* _mSetAspectRate_mHRBattle__QAEXMH_Z)(class mHRBattle* const thisPtr, float arg2, int32_t arg3);
	void mSetAspectRate(float arg2, int32_t arg3)
	{
		_mSetAspectRate_mHRBattle__QAEXMH_Z mFunc = (_mSetAspectRate_mHRBattle__QAEXMH_Z)(GameModule + 0x3fba20);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckExistEnemy(class mHRBattle* const this) [?mCheckExistEnemy@mHRBattle@@QAE_NXZ]
	/// <summary>
	/// Returns true if any enemy is still alive.
	/// </summary>
	typedef uint8_t(__thiscall* _mCheckExistEnemy_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mCheckExistEnemy()
	{
		_mCheckExistEnemy_mHRBattle__QAE_NXZ mFunc = (_mCheckExistEnemy_mHRBattle__QAE_NXZ)(GameModule + 0x3fba60);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mAllTestZakoDamage(class mHRBattle* const this, int32_t arg2) [?mAllTestZakoDamage@mHRBattle@@QAE_NH@Z]
	typedef uint8_t(__thiscall* _mAllTestZakoDamage_mHRBattle__QAE_NH_Z)(class mHRBattle* const thisPtr, int32_t arg2);
	uint8_t mAllTestZakoDamage(int32_t arg2)
	{
		_mAllTestZakoDamage_mHRBattle__QAE_NH_Z mFunc = (_mAllTestZakoDamage_mHRBattle__QAE_NH_Z)(GameModule + 0x3fbab0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mAllTestZakoTameDamage(class mHRBattle* const this) [?mAllTestZakoTameDamage@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mAllTestZakoTameDamage_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mAllTestZakoTameDamage()
	{
		_mAllTestZakoTameDamage_mHRBattle__QAE_NXZ mFunc = (_mAllTestZakoTameDamage_mHRBattle__QAE_NXZ)(GameModule + 0x3fbb00);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mAllEnemyDie(class mHRBattle* const this) [?mAllEnemyDie@mHRBattle@@QAE_NXZ]
	/// <summary>
	/// Unloads all enemies in the level immediately, without any effect. Note that this does not kill them, and moving away then back will have them re-appear.
	/// </summary>
	typedef uint8_t(__thiscall* _mAllEnemyDie_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mAllEnemyDie()
	{
		_mAllEnemyDie_mHRBattle__QAE_NXZ mFunc = (_mAllEnemyDie_mHRBattle__QAE_NXZ)(GameModule + 0x3fbb20);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mAllClearNpcData(class mHRBattle* const this) [?mAllClearNpcData@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mAllClearNpcData_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mAllClearNpcData()
	{
		_mAllClearNpcData_mHRBattle__QAEXXZ mFunc = (_mAllClearNpcData_mHRBattle__QAEXXZ)(GameModule + 0x3fbbb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraProjection(class mHRBattle* const this, float arg2) [?mSetCameraProjection@mHRBattle@@QAEXM@Z]
	typedef void(__thiscall* _mSetCameraProjection_mHRBattle__QAEXM_Z)(class mHRBattle* const thisPtr, float arg2);
	void mSetCameraProjection(float arg2)
	{
		_mSetCameraProjection_mHRBattle__QAEXM_Z mFunc = (_mSetCameraProjection_mHRBattle__QAEXM_Z)(GameModule + 0x3fbcb0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetObjNpcID(class mHRBattle* const this, int32_t arg2, char* arg3) [?mGetObjNpcID@mHRBattle@@QAEHHPAD@Z]
	typedef int32_t(__thiscall* _mGetObjNpcID_mHRBattle__QAEHHPAD_Z)(class mHRBattle* const thisPtr, int32_t arg2, char* arg3);
	int32_t mGetObjNpcID(int32_t arg2, std::string arg3)
	{
		std::vector<char> arg3_c_str(arg3.c_str(), + arg3.c_str() + arg3.size() + 1);
		_mGetObjNpcID_mHRBattle__QAEHHPAD_Z mFunc = (_mGetObjNpcID_mHRBattle__QAEHHPAD_Z)(GameModule + 0x3fbcf0);
		return mFunc(this, arg2, &arg3_c_str[0]);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::mGetObjPtr(class mHRBattle* const this, int32_t arg2, char* arg3) [?mGetObjPtr@mHRBattle@@QAEPAVmHRChara@@HPAD@Z]
	typedef class mHRChara*(__thiscall* _mGetObjPtr_mHRBattle__QAEPAVmHRChara__HPAD_Z)(class mHRBattle* const thisPtr, int32_t arg2, char* arg3);
	class mHRChara* mGetObjPtr(int32_t arg2, std::string arg3)
	{
		std::vector<char> arg3_c_str(arg3.c_str(), + arg3.c_str() + arg3.size() + 1);
		_mGetObjPtr_mHRBattle__QAEPAVmHRChara__HPAD_Z mFunc = (_mGetObjPtr_mHRBattle__QAEPAVmHRChara__HPAD_Z)(GameModule + 0x3fbd70);
		return mFunc(this, arg2, &arg3_c_str[0]);
	}
	// [Function] void __convention("thiscall") mHRBattle::mPopNpc(class mHRBattle* const this) [?mPopNpc@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mPopNpc_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mPopNpc()
	{
		_mPopNpc_mHRBattle__QAEXXZ mFunc = (_mPopNpc_mHRBattle__QAEXXZ)(GameModule + 0x3fbe00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetSlowMotionTick(class mHRBattle* const this, int32_t arg2, enum stBtEffect::SlowType arg3) [?mSetSlowMotionTick@mHRBattle@@QAEXHW4SlowType@stBtEffect@@@Z]
	typedef void(__thiscall* _mSetSlowMotionTick_mHRBattle__QAEXHW4SlowType_stBtEffect___Z)(class mHRBattle* const thisPtr, int32_t arg2, enum stBtEffect::SlowType arg3);
	void mSetSlowMotionTick(int32_t arg2, /* enum stBtEffect::SlowType */ uint32_t arg3)
	{
		_mSetSlowMotionTick_mHRBattle__QAEXHW4SlowType_stBtEffect___Z mFunc = (_mSetSlowMotionTick_mHRBattle__QAEXHW4SlowType_stBtEffect___Z)(GameModule + 0x3fca40);
		return mFunc(this, arg2, (enum stBtEffect::SlowType)arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mReleaseAllEnemy(class mHRBattle* const this) [?mReleaseAllEnemy@mHRBattle@@QAE_NXZ]
	/// <summary>
	/// Calls ::mClearNpcDat on all enemies, destroying them immediately, without triggering any effects or events (like gated doors).
	/// </summary>
	typedef uint8_t(__thiscall* _mReleaseAllEnemy_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mReleaseAllEnemy()
	{
		_mReleaseAllEnemy_mHRBattle__QAE_NXZ mFunc = (_mReleaseAllEnemy_mHRBattle__QAE_NXZ)(GameModule + 0x3fca70);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDatObj183(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6, uint8_t arg7, int32_t arg8) [?mSetInitNpcDatObj183@mHRBattle@@QAEHHABUVec@@0HH_NH@Z]
	typedef int32_t(__thiscall* _mSetInitNpcDatObj183_mHRBattle__QAEHHABUVec__0HH_NH_Z)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6, uint8_t arg7, int32_t arg8);
	int32_t mSetInitNpcDatObj183(int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6, uint8_t arg7, int32_t arg8)
	{
		_mSetInitNpcDatObj183_mHRBattle__QAEHHABUVec__0HH_NH_Z mFunc = (_mSetInitNpcDatObj183_mHRBattle__QAEHHABUVec__0HH_NH_Z)(GameModule + 0x3fcb80);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mReleaseAllNpc(class mHRBattle* const this) [?mReleaseAllNpc@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mReleaseAllNpc_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mReleaseAllNpc()
	{
		_mReleaseAllNpc_mHRBattle__QAE_NXZ mFunc = (_mReleaseAllNpc_mHRBattle__QAE_NXZ)(GameModule + 0x3fcca0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetDontAppearStatus(class mHRBattle* const this) [?mSetDontAppearStatus@mHRBattle@@QAEXXZ]
	typedef void(__thiscall* _mSetDontAppearStatus_mHRBattle__QAEXXZ)(class mHRBattle* const thisPtr);
	void mSetDontAppearStatus()
	{
		_mSetDontAppearStatus_mHRBattle__QAEXXZ mFunc = (_mSetDontAppearStatus_mHRBattle__QAEXXZ)(GameModule + 0x3fcd70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::CameraMotionModeReset(class mHRBattle* const this, uint8_t arg2) [?CameraMotionModeReset@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _CameraMotionModeReset_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void CameraMotionModeReset(uint8_t arg2)
	{
		_CameraMotionModeReset_mHRBattle__QAEX_N_Z mFunc = (_CameraMotionModeReset_mHRBattle__QAEX_N_Z)(GameModule + 0x3fcd80);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetPcOperate(class mHRBattle* const this, uint8_t arg2) [?mSetPcOperate@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mSetPcOperate_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mSetPcOperate(uint8_t arg2)
	{
		_mSetPcOperate_mHRBattle__QAEX_N_Z mFunc = (_mSetPcOperate_mHRBattle__QAEX_N_Z)(GameModule + 0x3fce10);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mUndispPcStatus(class mHRBattle* const this, uint8_t arg2) [?mUndispPcStatus@mHRBattle@@QAEX_N@Z]
	typedef void(__thiscall* _mUndispPcStatus_mHRBattle__QAEX_N_Z)(class mHRBattle* const thisPtr, uint8_t arg2);
	void mUndispPcStatus(uint8_t arg2)
	{
		_mUndispPcStatus_mHRBattle__QAEX_N_Z mFunc = (_mUndispPcStatus_mHRBattle__QAEX_N_Z)(GameModule + 0x3fce30);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mRenderProc(class mHRBattle* const this) [?mRenderProc@mHRBattle@@QAE_NXZ]
	typedef uint8_t(__thiscall* _mRenderProc_mHRBattle__QAE_NXZ)(class mHRBattle* const thisPtr);
	uint8_t mRenderProc()
	{
		_mRenderProc_mHRBattle__QAE_NXZ mFunc = (_mRenderProc_mHRBattle__QAE_NXZ)(GameModule + 0x3fce50);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetNpcMotionSpd(class mHRBattle* const this, class mHRChara* arg2) [?mGetNpcMotionSpd@mHRBattle@@QAEMPAVmHRChara@@@Z]
	typedef float(__thiscall* _mGetNpcMotionSpd_mHRBattle__QAEMPAVmHRChara___Z)(class mHRBattle* const thisPtr, class mHRChara* arg2);
	float mGetNpcMotionSpd(class mHRChara* arg2)
	{
		_mGetNpcMotionSpd_mHRBattle__QAEMPAVmHRChara___Z mFunc = (_mGetNpcMotionSpd_mHRBattle__QAEMPAVmHRChara___Z)(GameModule + 0x3fce60);
		return mFunc(this, arg2);
	}
	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class mHRBattle [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(mHRBattle& InObject)
	{
		PlayerInitializedState = InObject.PlayerInitializedState;
		CameraProjection = InObject.CameraProjection;
		LockNavelPos = InObject.LockNavelPos;
		CameraMotionEndStop = InObject.CameraMotionEndStop;
		btEffect = InObject.btEffect;
		PcKind = InObject.PcKind;
		PcPtr = InObject.PcPtr;
		WeaponType = InObject.WeaponType;
		UnknownWeaponPtr = InObject.UnknownWeaponPtr;
		TotalKillNum = InObject.TotalKillNum;
		KillNum = InObject.KillNum;
		RevengeMissionZakoKillNum = InObject.RevengeMissionZakoKillNum;
		NpcAttackRate = InObject.NpcAttackRate;
		UnknownInt = InObject.UnknownInt;
		NewGameDataRequest = InObject.NewGameDataRequest;
		SaveData = InObject.SaveData;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<mHRBattle>("mHRBattle")
			.addFunction("__tostring", &mHRBattle::ToString)
			.addFunction("GetPtrAddr", &mHRBattle::GetPtrAddr)
			.addProperty("PlayerInitializedState", &mHRBattle::PlayerInitializedState)
			.addProperty("CameraProjection", &mHRBattle::CameraProjection)
			.addProperty("LockNavelPos", &mHRBattle::LockNavelPos)
			.addProperty("CameraMotionEndStop", &mHRBattle::CameraMotionEndStop)
			.addProperty("btEffect", &mHRBattle::btEffect)
			.addProperty("PcKind", &mHRBattle::PcKind)
			.addProperty("PcPtr", &mHRBattle::PcPtr)
			.addProperty("WeaponType", &mHRBattle::WeaponType)
			// void type not supported in LuaBridge
			//.addProperty("UnknownWeaponPtr", &mHRBattle::UnknownWeaponPtr)
			.addProperty("TotalKillNum", &mHRBattle::TotalKillNum)
			.addProperty("KillNum", &mHRBattle::KillNum)
			.addProperty("RevengeMissionZakoKillNum", &mHRBattle::RevengeMissionZakoKillNum)
			.addProperty("NpcAttackRate", &mHRBattle::NpcAttackRate)
			.addProperty("UnknownInt", &mHRBattle::UnknownInt)
			.addProperty("NewGameDataRequest", &mHRBattle::NewGameDataRequest)
			.addProperty("SaveData", &mHRBattle::SaveData)
			.addFunction("mGetPcPtr", &mHRBattle::mGetPcPtr)
			.addFunction("mGetSlowMotionTick", &mHRBattle::mGetSlowMotionTick)
			.addFunction("mGetBulletSlow", &mHRBattle::mGetBulletSlow)
			.addFunction("mGetBtEffect", &mHRBattle::mGetBtEffect)
			.addFunction("mSetNpcAttackFlag", &mHRBattle::mSetNpcAttackFlag)
			.addFunction("mSetNpcAttackRate", &mHRBattle::mSetNpcAttackRate)
			.addFunction("SetNpcDatMax", &mHRBattle::SetNpcDatMax)
			.addFunction("GetSmokeEf", &mHRBattle::GetSmokeEf)
			.addFunction("mGetPcKind", &mHRBattle::mGetPcKind)
			.addFunction("mGetFrameProc", &mHRBattle::mGetFrameProc)
			.addFunction("mSetCameraAngle", &mHRBattle::mSetCameraAngle)
			.addFunction("mSetCamMotFlag", &mHRBattle::mSetCamMotFlag)
			.addFunction("mSetCamMotFlagNoUse", &mHRBattle::mSetCamMotFlagNoUse)
			.addFunction("mSetCameraAutoReturnDisEnable", &mHRBattle::mSetCameraAutoReturnDisEnable)
			.addFunction("mClearKillNum", &mHRBattle::mClearKillNum)
			.addFunction("mGetKillNum", &mHRBattle::mGetKillNum)
			.addFunction("mSetKillNum", &mHRBattle::mSetKillNum)
			.addFunction("GetRevengeMissionZakoKillNum", &mHRBattle::GetRevengeMissionZakoKillNum)
			.addFunction("ClearRevengeMissionZakoKillNum", &mHRBattle::ClearRevengeMissionZakoKillNum)
			.addFunction("mSetBattlePause", &mHRBattle::mSetBattlePause)
			.addFunction("mSetDispStatusDisEnable", &mHRBattle::mSetDispStatusDisEnable)
			.addFunction("mGetDispStatusDisEnable", &mHRBattle::mGetDispStatusDisEnable)
			.addFunction("mSetChargeDamage", &mHRBattle::mSetChargeDamage)
			.addFunction("mClearTotalKillNum", &mHRBattle::mClearTotalKillNum)
			.addFunction("mGetTutoRun", &mHRBattle::mGetTutoRun)
			.addFunction("mSubRepopNum", &mHRBattle::mSubRepopNum)
			.addFunction("mSetRepopTimer", &mHRBattle::mSetRepopTimer)
			.addFunction("mGetNewGameDataRequest", &mHRBattle::mGetNewGameDataRequest)
			.addFunction("mGetDontChangeTeppeiCamera", &mHRBattle::mGetDontChangeTeppeiCamera)
			.addFunction("mGetCameraProjection", &mHRBattle::mGetCameraProjection)
			.addFunction("mSetCameraMoveFlag", &mHRBattle::mSetCameraMoveFlag)
			.addFunction("mSetMotionCameraPos", &mHRBattle::mSetMotionCameraPos)
			.addFunction("mGetMotionCameraPos", &mHRBattle::mGetMotionCameraPos)
			// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetMotionCameraY", &mHRBattle::mSetMotionCameraY)
			.addFunction("mGetMotionCameraY", &mHRBattle::mGetMotionCameraY)
			.addFunction("mGetBattlePause", &mHRBattle::mGetBattlePause)
			.addFunction("mGetChargeDamage", &mHRBattle::mGetChargeDamage)
			.addFunction("mGetChangeCameraRailFlag", &mHRBattle::mGetChangeCameraRailFlag)
			.addFunction("mGetCameraAngleX", &mHRBattle::mGetCameraAngleX)
			.addFunction("mSetLockNavelPos", &mHRBattle::mSetLockNavelPos)
			.addFunction("mGetTotalKillNum", &mHRBattle::mGetTotalKillNum)
			.addFunction("mSetTotalKillNum", &mHRBattle::mSetTotalKillNum)
			.addFunction("mGetBossBreakSlow", &mHRBattle::mGetBossBreakSlow)
			.addFunction("mGetNpcAttackFlag", &mHRBattle::mGetNpcAttackFlag)
			.addFunction("mGetNpcAttackRate", &mHRBattle::mGetNpcAttackRate)
			.addFunction("AddRevengeMissionZakoKillNum", &mHRBattle::AddRevengeMissionZakoKillNum)
			.addFunction("SetCameraMotionEndStop", &mHRBattle::SetCameraMotionEndStop)
			.addFunction("IsBgmEffect", &mHRBattle::IsBgmEffect)
			.addFunction("mSetDontChangeTeppeiCamera", &mHRBattle::mSetDontChangeTeppeiCamera)
			.addFunction("UpdateMassKillAchievement", &mHRBattle::UpdateMassKillAchievement)
			.addFunction("UpdateMainScreenUI", &mHRBattle::UpdateMainScreenUI)
			.addFunction("BgmEffectProc", &mHRBattle::BgmEffectProc)
			.addFunction("SetBgmEffect", &mHRBattle::SetBgmEffect)
			.addFunction("GetNpc", &mHRBattle::GetNpc)
			.addFunction("mCheckPcLoaded4WepaponChange", &mHRBattle::mCheckPcLoaded4WepaponChange)
			.addFunction("mCheckBattleInit", &mHRBattle::mCheckBattleInit)
			.addStaticFunction("ChkToiletStage", &mHRBattle::ChkToiletStage)
			.addStaticFunction("ChkBikeStage", &mHRBattle::ChkBikeStage)
			.addFunction("GetPickUpGomiSubMissionResult", &mHRBattle::GetPickUpGomiSubMissionResult)
			.addFunction("mAddKillNum", &mHRBattle::mAddKillNum)
			.addFunction("mSetNpcAppear", &mHRBattle::mSetNpcAppear)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("FixRotationOfItem", &mHRBattle::FixRotationOfItem)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("FixPositionOfItem", &mHRBattle::FixPositionOfItem)
			.addFunction("mSetInitCustomColliderObj", &mHRBattle::mSetInitCustomColliderObj)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitCharaPos", &mHRBattle::mSetInitCharaPos)
			.addFunction("mCheckStatusDispOnlyBattery", &mHRBattle::mCheckStatusDispOnlyBattery)
			.addFunction("mCheckStatusDispWithoutBattery", &mHRBattle::mCheckStatusDispWithoutBattery)
			.addFunction("mCheckStatusDisp", &mHRBattle::mCheckStatusDisp)
			.addFunction("mUndispMoney", &mHRBattle::mUndispMoney)
			.addFunction("mDispMoney", &mHRBattle::mDispMoney)
			.addFunction("mGetDispPcStatus", &mHRBattle::mGetDispPcStatus)
			.addFunction("mReleaseAllNpcWithoutCmnObj", &mHRBattle::mReleaseAllNpcWithoutCmnObj)
			.addFunction("mSetBulletSlowTick", &mHRBattle::mSetBulletSlowTick)
			.addFunction("mResetBulletSlow", &mHRBattle::mResetBulletSlow)
			.addFunction("mResetSlowMotion", &mHRBattle::mResetSlowMotion)
			.addFunction("mLightReflectEfProc", &mHRBattle::mLightReflectEfProc)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mCheckSamePopNpcPosAsNpcDat", &mHRBattle::mCheckSamePopNpcPosAsNpcDat)
			.addFunction("mGetEmptyNpcDatIndex", &mHRBattle::mGetEmptyNpcDatIndex)
			.addFunction("mRestorePcData4Lap", &mHRBattle::mRestorePcData4Lap)
			.addFunction("mStorePcData4Lap", &mHRBattle::mStorePcData4Lap)
			.addFunction("mCallPadProcess", &mHRBattle::mCallPadProcess)
			.addFunction("mClearNpcDat", &mHRBattle::mClearNpcDat)
			.addFunction("mEffectProc", &mHRBattle::mEffectProc)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetPopNpc", &mHRBattle::mSetPopNpc)
			.addFunction("mTestNpcType", &mHRBattle::mTestNpcType)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetNpcEnterPattern", &mHRBattle::mSetNpcEnterPattern)
			.addFunction("mSetShadowRate4CommonObject", &mHRBattle::mSetShadowRate4CommonObject)
			.addFunction("mCreateNewNpc", &mHRBattle::mCreateNewNpc)
			// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mCheckNpcInitHp", &mHRBattle::mCheckNpcInitHp)
			.addFunction("mCheckDeadNpc", &mHRBattle::mCheckDeadNpc)
			.addFunction("mGetEmptyNpcIndex", &mHRBattle::mGetEmptyNpcIndex)
			.addFunction("mGetResourceNpcNum", &mHRBattle::mGetResourceNpcNum)
			.addFunction("mGetResourceZakoNpcMotion", &mHRBattle::mGetResourceZakoNpcMotion)
			.addFunction("mGetResourceZakoCmnMotion", &mHRBattle::mGetResourceZakoCmnMotion)
			.addFunction("mGetResourceZakoWepMotion", &mHRBattle::mGetResourceZakoWepMotion)
			// Can't export pointer to native type 'char const**' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mGetResourceNpc", &mHRBattle::mGetResourceNpc)
			.addFunction("GetNpcDatIndexByCharPtr", &mHRBattle::GetNpcDatIndexByCharPtr)
			.addFunction("mCameraRotD", &mHRBattle::mCameraRotD)
			.addFunction("mCameraRotU", &mHRBattle::mCameraRotU)
			.addFunction("mCameraRotR", &mHRBattle::mCameraRotR)
			.addFunction("mCameraRotL", &mHRBattle::mCameraRotL)
			.addFunction("mCameraFrameProc", &mHRBattle::mCameraFrameProc)
			.addFunction("mSetCameraOffset4Fps", &mHRBattle::mSetCameraOffset4Fps)
			.addFunction("mResetCameraOffset4Fps", &mHRBattle::mResetCameraOffset4Fps)
			.addFunction("mSetCameraOffset4En", &mHRBattle::mSetCameraOffset4En)
			.addFunction("mSetCameraOffset4Pc", &mHRBattle::mSetCameraOffset4Pc)
			.addFunction("mSetLockOnCameraZoomIn", &mHRBattle::mSetLockOnCameraZoomIn)
			.addFunction("mSetLockOnCameraZoomOut", &mHRBattle::mSetLockOnCameraZoomOut)
			.addFunction("mResetLockOnCameraZoom", &mHRBattle::mResetLockOnCameraZoom)
			.addFunction("mCheckUndispStatusStage", &mHRBattle::mCheckUndispStatusStage)
			.addFunction("mSetMoveInitCamera4MiniDemo", &mHRBattle::mSetMoveInitCamera4MiniDemo)
			.addFunction("mSetLockOnCamera", &mHRBattle::mSetLockOnCamera)
			.addFunction("mPcTerm", &mHRBattle::mPcTerm)
			.addFunction("mPcInit", &mHRBattle::mPcInit)
			.addFunction("mPopPcSaveData", &mHRBattle::mPopPcSaveData)
			.addFunction("mPushPcSaveData", &mHRBattle::mPushPcSaveData)
			.addFunction("mInitStart", &mHRBattle::mInitStart)
			.addFunction("mGetResourceCmnObj", &mHRBattle::mGetResourceCmnObj)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetLightReflecte", &mHRBattle::mSetLightReflecte)
			.addFunction("mInit", &mHRBattle::mInit)
			.addFunction("mFrameProc", &mHRBattle::mFrameProc)
			.addFunction("mSetVisibleAll", &mHRBattle::mSetVisibleAll)
			.addFunction("mSetOperateAll", &mHRBattle::mSetOperateAll)
			.addFunction("mSetNewGameDataRequest", &mHRBattle::mSetNewGameDataRequest)
			.addFunction("mTerm", &mHRBattle::mTerm)
			.addFunction("mPostRenderProc", &mHRBattle::mPostRenderProc)
			.addFunction("GetBowlingSubMissionResult", &mHRBattle::GetBowlingSubMissionResult)
			.addFunction("mCheckPcLoaded", &mHRBattle::mCheckPcLoaded)
			.addFunction("mGetPcOperate", &mHRBattle::mGetPcOperate)
			.addFunction("mSetMoveInitCamera", &mHRBattle::mSetMoveInitCamera)
			.addFunction("mInitStartMainMission", &mHRBattle::mInitStartMainMission)
			.addFunction("mGetNpcPtr", &mHRBattle::mGetNpcPtr)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDat", &mHRBattle::mSetInitNpcDat)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitObjDat", &mHRBattle::mSetInitObjDat)
			.addFunction("mSetPopType", &mHRBattle::mSetPopType)
			.addFunction("mSetPcKind", &mHRBattle::mSetPcKind)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDat2", &mHRBattle::mSetInitNpcDat2)
			// Can't export functions with more than 11 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat3", &mHRBattle::mSetInitNpcDat3)
			// Can't export functions with more than 11 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat4", &mHRBattle::mSetInitNpcDat4)
			// Can't export functions with more than 11 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat5", &mHRBattle::mSetInitNpcDat5)
			// Can't export functions with more than 11 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat6", &mHRBattle::mSetInitNpcDat6)
			// Can't export functions with more than 11 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat7", &mHRBattle::mSetInitNpcDat7)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDatObj095", &mHRBattle::mSetInitNpcDatObj095)
			.addFunction("mDispPcStatus", &mHRBattle::mDispPcStatus)
			.addFunction("mDispMiniMap", &mHRBattle::mDispMiniMap)
			.addFunction("mUndispMiniMap", &mHRBattle::mUndispMiniMap)
			.addFunction("mDeleteNpc", &mHRBattle::mDeleteNpc)
			.addFunction("RequestMotionNoNpc", &mHRBattle::RequestMotionNoNpc)
			.addFunction("mGetNpcPtrFromCharaType", &mHRBattle::mGetNpcPtrFromCharaType)
			.addFunction("mSetZakoNpcMotionProcessDisEnable", &mHRBattle::mSetZakoNpcMotionProcessDisEnable)
			.addFunction("mSetAspectRate", &mHRBattle::mSetAspectRate)
			.addFunction("mCheckExistEnemy", &mHRBattle::mCheckExistEnemy)
			.addFunction("mAllTestZakoDamage", &mHRBattle::mAllTestZakoDamage)
			.addFunction("mAllTestZakoTameDamage", &mHRBattle::mAllTestZakoTameDamage)
			.addFunction("mAllEnemyDie", &mHRBattle::mAllEnemyDie)
			.addFunction("mAllClearNpcData", &mHRBattle::mAllClearNpcData)
			.addFunction("mSetCameraProjection", &mHRBattle::mSetCameraProjection)
			.addFunction("mGetObjNpcID", &mHRBattle::mGetObjNpcID)
			.addFunction("mGetObjPtr", &mHRBattle::mGetObjPtr)
			.addFunction("mPopNpc", &mHRBattle::mPopNpc)
			.addFunction("mSetSlowMotionTick", &mHRBattle::mSetSlowMotionTick)
			.addFunction("mReleaseAllEnemy", &mHRBattle::mReleaseAllEnemy)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDatObj183", &mHRBattle::mSetInitNpcDatObj183)
			.addFunction("mReleaseAllNpc", &mHRBattle::mReleaseAllNpc)
			.addFunction("mSetDontAppearStatus", &mHRBattle::mSetDontAppearStatus)
			.addFunction("CameraMotionModeReset", &mHRBattle::CameraMotionModeReset)
			.addFunction("mSetPcOperate", &mHRBattle::mSetPcOperate)
			.addFunction("mUndispPcStatus", &mHRBattle::mUndispPcStatus)
			.addFunction("mRenderProc", &mHRBattle::mRenderProc)
			.addFunction("mGetNpcMotionSpd", &mHRBattle::mGetNpcMotionSpd)
			.addStaticFunction("mFrameProc_RegisterHook", &mHRBattle::mFrameProc_RegisterHook)
		.endClass();
	}
#endif
};
static_assert(sizeof(mHRBattle::PlayerInitializedState) == 4, "expected mHRBattle::PlayerInitializedState to be size 4");
static_assert(sizeof(mHRBattle::CameraProjection) == 4, "expected mHRBattle::CameraProjection to be size 4");
static_assert(sizeof(mHRBattle::LockNavelPos) == 1, "expected mHRBattle::LockNavelPos to be size 1");
static_assert(sizeof(mHRBattle::CameraMotionEndStop) == 1, "expected mHRBattle::CameraMotionEndStop to be size 1");
static_assert(sizeof(mHRBattle::btEffect) == 32, "expected mHRBattle::btEffect to be size 32");
static_assert(sizeof(mHRBattle::PcKind) == 4, "expected mHRBattle::PcKind to be size 4");
static_assert(sizeof(mHRBattle::PcPtr) == 4, "expected mHRBattle::PcPtr to be size 4");
static_assert(sizeof(mHRBattle::WeaponType) == 4, "expected mHRBattle::WeaponType to be size 4");
static_assert(sizeof(mHRBattle::UnknownWeaponPtr) == 4, "expected mHRBattle::UnknownWeaponPtr to be size 4");
static_assert(sizeof(mHRBattle::TotalKillNum) == 4, "expected mHRBattle::TotalKillNum to be size 4");
static_assert(sizeof(mHRBattle::KillNum) == 4, "expected mHRBattle::KillNum to be size 4");
static_assert(sizeof(mHRBattle::RevengeMissionZakoKillNum) == 4, "expected mHRBattle::RevengeMissionZakoKillNum to be size 4");
static_assert(sizeof(mHRBattle::NpcAttackRate) == 4, "expected mHRBattle::NpcAttackRate to be size 4");
static_assert(sizeof(mHRBattle::UnknownInt) == 4, "expected mHRBattle::UnknownInt to be size 4");
static_assert(sizeof(mHRBattle::NewGameDataRequest) == 1, "expected mHRBattle::NewGameDataRequest to be size 1");
static_assert(sizeof(mHRBattle::SaveData) == 1636, "expected mHRBattle::SaveData to be size 1636");
static_assert(sizeof(mHRBattle) == 0x23c3c, "expected mHRBattle to be size 0x23c3c");

// [Structure] class HrMissionResult
class HrMissionResult
{
public:
	// enum HrMissionResult::D_RESULT_TYPE
	enum D_RESULT_TYPE : uint32_t
	{
		// <D_RESULT_TYPE_FAILD = 0x0>
		D_RESULT_TYPE_FAILD = 0,

		// <XXX_D_RESULT_TYPE_SUCCESS = 0x1>
		XXX_D_RESULT_TYPE_SUCCESS = 1,

		// <D_RESULT_TYPE_REVENGE_SUCCESS = 0x2>
		D_RESULT_TYPE_REVENGE_SUCCESS = 2,

		// <D_RESULT_TYPE_RANKING_UP = 0x3>
		D_RESULT_TYPE_RANKING_UP = 3,

		// <D_RESULT_TYPE_MISSION_START = 0x4>
		D_RESULT_TYPE_MISSION_START = 4,

		// <D_RESULT_TYPE_MISSION_TIMEUP = 0x5>
		D_RESULT_TYPE_MISSION_TIMEUP = 5,

		// <D_RESULT_TYPE_SCORPION_TIMEUP = 0x6>
		D_RESULT_TYPE_SCORPION_TIMEUP = 6,

		// <D_RESULT_TYPE_REVENGE_FAILD = 0x7>
		D_RESULT_TYPE_REVENGE_FAILD = 7,

		// <D_RESULT_TYPE_REVENGE_TIMEUP = 0x8>
		D_RESULT_TYPE_REVENGE_TIMEUP = 8

	};

	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[100];

public:
	// <int32_t ResultType, offset 0x64>
	int32_t ResultType = 0;

	// <Unidentified data segment, offset 0x68>
private:
	char _UnidentifiedData_104[4504];

public:
	/// 22 Functions

	// [Function] void __convention("thiscall") HrMissionResult::dSetCameraPos(class HrMissionResult* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4) [?dSetCameraPos@HrMissionResult@@QAEXHAAUVec@@0@Z]
	typedef void(__thiscall* _dSetCameraPos_HrMissionResult__QAEXHAAUVec__0_Z)(class HrMissionResult* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4);
	void dSetCameraPos(int32_t arg2, struct Vec& arg3, struct Vec& arg4)
	{
		_dSetCameraPos_HrMissionResult__QAEXHAAUVec__0_Z mFunc = (_dSetCameraPos_HrMissionResult__QAEXHAAUVec__0_Z)(GameModule + 0xafb10);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") HrMissionResult::dSetSceneTime(class HrMissionResult* const this, int32_t arg2, uint8_t arg3) [?dSetSceneTime@HrMissionResult@@QAEXHE@Z]
	typedef void(__thiscall* _dSetSceneTime_HrMissionResult__QAEXHE_Z)(class HrMissionResult* const thisPtr, int32_t arg2, uint8_t arg3);
	void dSetSceneTime(int32_t arg2, uint8_t arg3)
	{
		_dSetSceneTime_HrMissionResult__QAEXHE_Z mFunc = (_dSetSceneTime_HrMissionResult__QAEXHE_Z)(GameModule + 0xafb60);
		return mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") HrMissionResult::dGetStat(class HrMissionResult* const this) [?dGetStat@HrMissionResult@@QAEHXZ]
	typedef int32_t(__thiscall* _dGetStat_HrMissionResult__QAEHXZ)(class HrMissionResult* const thisPtr);
	int32_t dGetStat()
	{
		_dGetStat_HrMissionResult__QAEHXZ mFunc = (_dGetStat_HrMissionResult__QAEHXZ)(GameModule + 0xafb80);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") HrMissionResult::dGetMode(class HrMissionResult* const this) [?dGetMode@HrMissionResult@@QAEHXZ]
	typedef int32_t(__thiscall* _dGetMode_HrMissionResult__QAEHXZ)(class HrMissionResult* const thisPtr);
	int32_t dGetMode()
	{
		_dGetMode_HrMissionResult__QAEHXZ mFunc = (_dGetMode_HrMissionResult__QAEHXZ)(GameModule + 0xafb90);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") HrMissionResult::dGetResultType(class HrMissionResult* const this) [?dGetResultType@HrMissionResult@@QAEHXZ]
	typedef int32_t(__thiscall* _dGetResultType_HrMissionResult__QAEHXZ)(class HrMissionResult* const thisPtr);
	int32_t dGetResultType()
	{
		_dGetResultType_HrMissionResult__QAEHXZ mFunc = (_dGetResultType_HrMissionResult__QAEHXZ)(GameModule + 0xafba0);
		return mFunc(this);
	}
	// [Function] class HrTask* HrMissionResult::TestCreate() [?TestCreate@HrMissionResult@@SAPAVHrTask@@XZ]
	typedef class HrTask*(__fastcall* _TestCreate_HrMissionResult__SAPAVHrTask__XZ)();
	static class HrTask* TestCreate()
	{
		_TestCreate_HrMissionResult__SAPAVHrTask__XZ mFunc = (_TestCreate_HrMissionResult__SAPAVHrTask__XZ)(GameModule + 0x5ad300);
		return mFunc();
	}
	// [Function] void __convention("thiscall") HrMissionResult::MissionStartRender(class HrMissionResult* const this) [?MissionStartRender@HrMissionResult@@AAEXXZ]
	typedef void(__thiscall* _MissionStartRender_HrMissionResult__AAEXXZ)(class HrMissionResult* const thisPtr);
	void MissionStartRender()
	{
		_MissionStartRender_HrMissionResult__AAEXXZ mFunc = (_MissionStartRender_HrMissionResult__AAEXXZ)(GameModule + 0x5ad310);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMissionResult::FaildRender(class HrMissionResult* const this) [?FaildRender@HrMissionResult@@AAEXXZ]
	typedef void(__thiscall* _FaildRender_HrMissionResult__AAEXXZ)(class HrMissionResult* const thisPtr);
	void FaildRender()
	{
		_FaildRender_HrMissionResult__AAEXXZ mFunc = (_FaildRender_HrMissionResult__AAEXXZ)(GameModule + 0x5ad540);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMissionResult::RevengeFaildRender(class HrMissionResult* const this) [?RevengeFaildRender@HrMissionResult@@AAEXXZ]
	typedef void(__thiscall* _RevengeFaildRender_HrMissionResult__AAEXXZ)(class HrMissionResult* const thisPtr);
	void RevengeFaildRender()
	{
		_RevengeFaildRender_HrMissionResult__AAEXXZ mFunc = (_RevengeFaildRender_HrMissionResult__AAEXXZ)(GameModule + 0x5ade30);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::RevengeFaildFrame(class HrMissionResult* const this) [?RevengeFaildFrame@HrMissionResult@@AAE_NXZ]
	typedef uint8_t(__thiscall* _RevengeFaildFrame_HrMissionResult__AAE_NXZ)(class HrMissionResult* const thisPtr);
	uint8_t RevengeFaildFrame()
	{
		_RevengeFaildFrame_HrMissionResult__AAE_NXZ mFunc = (_RevengeFaildFrame_HrMissionResult__AAE_NXZ)(GameModule + 0x5adeb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMissionResult::RevengeClearRender(class HrMissionResult* const this) [?RevengeClearRender@HrMissionResult@@AAEXXZ]
	typedef void(__thiscall* _RevengeClearRender_HrMissionResult__AAEXXZ)(class HrMissionResult* const thisPtr);
	void RevengeClearRender()
	{
		_RevengeClearRender_HrMissionResult__AAEXXZ mFunc = (_RevengeClearRender_HrMissionResult__AAEXXZ)(GameModule + 0x5adf90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::RevengeClearFrame(class HrMissionResult* const this) [?RevengeClearFrame@HrMissionResult@@AAE_NXZ]
	typedef uint8_t(__thiscall* _RevengeClearFrame_HrMissionResult__AAE_NXZ)(class HrMissionResult* const thisPtr);
	uint8_t RevengeClearFrame()
	{
		_RevengeClearFrame_HrMissionResult__AAE_NXZ mFunc = (_RevengeClearFrame_HrMissionResult__AAE_NXZ)(GameModule + 0x5ae100);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMissionResult::RenderProcess(class HrMissionResult* const this) [?RenderProcess@HrMissionResult@@MAEXXZ]
	typedef void(__thiscall* _RenderProcess_HrMissionResult__MAEXXZ)(class HrMissionResult* const thisPtr);
	void RenderProcess()
	{
		_RenderProcess_HrMissionResult__MAEXXZ mFunc = (_RenderProcess_HrMissionResult__MAEXXZ)(GameModule + 0x5ae170);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::MissionStartFrame(class HrMissionResult* const this) [?MissionStartFrame@HrMissionResult@@AAE_NXZ]
	typedef uint8_t(__thiscall* _MissionStartFrame_HrMissionResult__AAE_NXZ)(class HrMissionResult* const thisPtr);
	uint8_t MissionStartFrame()
	{
		_MissionStartFrame_HrMissionResult__AAE_NXZ mFunc = (_MissionStartFrame_HrMissionResult__AAE_NXZ)(GameModule + 0x5ae3a0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::FaildFrame(class HrMissionResult* const this) [?FaildFrame@HrMissionResult@@AAE_NXZ]
	typedef uint8_t(__thiscall* _FaildFrame_HrMissionResult__AAE_NXZ)(class HrMissionResult* const thisPtr);
	uint8_t FaildFrame()
	{
		_FaildFrame_HrMissionResult__AAE_NXZ mFunc = (_FaildFrame_HrMissionResult__AAE_NXZ)(GameModule + 0x5ae8b0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMissionResult::FrameProcess(class HrMissionResult* const this) [?FrameProcess@HrMissionResult@@MAEXXZ]
	typedef void(__thiscall* _FrameProcess_HrMissionResult__MAEXXZ)(class HrMissionResult* const thisPtr);
	void FrameProcess()
	{
		_FrameProcess_HrMissionResult__MAEXXZ mFunc = (_FrameProcess_HrMissionResult__MAEXXZ)(GameModule + 0x5aed60);
		return mFunc(this);
	}
	// [Function] int16_t __convention("thiscall") HrMissionResult::GetRandPos(class HrMissionResult* const this, int32_t arg2, int16_t* arg3, int16_t* arg4) [?GetRandPos@HrMissionResult@@AAEFHPAF0@Z]
	typedef int16_t(__thiscall* _GetRandPos_HrMissionResult__AAEFHPAF0_Z)(class HrMissionResult* const thisPtr, int32_t arg2, int16_t* arg3, int16_t* arg4);
	int16_t GetRandPos(int32_t arg2, int16_t* arg3, int16_t* arg4)
	{
		_GetRandPos_HrMissionResult__AAEFHPAF0_Z mFunc = (_GetRandPos_HrMissionResult__AAEFHPAF0_Z)(GameModule + 0x5af610);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") HrMissionResult::Terminate(class HrMissionResult* const this) [?Terminate@HrMissionResult@@MAEXXZ]
	typedef void(__thiscall* _Terminate_HrMissionResult__MAEXXZ)(class HrMissionResult* const thisPtr);
	void Terminate()
	{
		_Terminate_HrMissionResult__MAEXXZ mFunc = (_Terminate_HrMissionResult__MAEXXZ)(GameModule + 0x5af830);
		return mFunc(this);
	}
	// [Function] class HrMissionResult* HrMissionResult::Create() [?Create@HrMissionResult@@SAPAV1@XZ]
	typedef class HrMissionResult*(__fastcall* _Create_HrMissionResult__SAPAV1_XZ)();
	static class HrMissionResult* Create()
	{
		_Create_HrMissionResult__SAPAV1_XZ mFunc = (_Create_HrMissionResult__SAPAV1_XZ)(GameModule + 0x5afa80);
		return mFunc();
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::Initialize(class HrMissionResult* const this) [?Initialize@HrMissionResult@@QAE_NXZ]
	typedef uint8_t(__thiscall* _Initialize_HrMissionResult__QAE_NXZ)(class HrMissionResult* const thisPtr);
	uint8_t Initialize()
	{
		_Initialize_HrMissionResult__QAE_NXZ mFunc = (_Initialize_HrMissionResult__QAE_NXZ)(GameModule + 0x5afb90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::dAppear(class HrMissionResult* const this, uint32_t arg2, int16_t arg3, int16_t arg4, int32_t arg5, char arg6, enum HrMissionResult::D_RESULT_TYPE arg7, int16_t arg8, int16_t arg9) [?dAppear@HrMissionResult@@QAE_NIFFHCW4D_RESULT_TYPE@1@FF@Z]
	typedef uint8_t(__thiscall* _dAppear_HrMissionResult__QAE_NIFFHCW4D_RESULT_TYPE_1_FF_Z)(class HrMissionResult* const thisPtr, uint32_t arg2, int16_t arg3, int16_t arg4, int32_t arg5, char arg6, enum HrMissionResult::D_RESULT_TYPE arg7, int16_t arg8, int16_t arg9);
	uint8_t dAppear(uint32_t arg2, int16_t arg3, int16_t arg4, int32_t arg5, char arg6, /* enum HrMissionResult::D_RESULT_TYPE */ uint32_t arg7, int16_t arg8, int16_t arg9)
	{
		_dAppear_HrMissionResult__QAE_NIFFHCW4D_RESULT_TYPE_1_FF_Z mFunc = (_dAppear_HrMissionResult__QAE_NIFFHCW4D_RESULT_TYPE_1_FF_Z)(GameModule + 0x5afca0);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, (enum HrMissionResult::D_RESULT_TYPE)arg7, arg8, arg9);
	}
	// [Function] uint8_t __convention("thiscall") HrMissionResult::dLeaving(class HrMissionResult* const this) [?dLeaving@HrMissionResult@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dLeaving_HrMissionResult__QAE_NXZ)(class HrMissionResult* const thisPtr);
	uint8_t dLeaving()
	{
		_dLeaving_HrMissionResult__QAE_NXZ mFunc = (_dLeaving_HrMissionResult__QAE_NXZ)(GameModule + 0x5b0110);
		return mFunc(this);
	}
	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrMissionResult [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrMissionResult& InObject)
	{
		ResultType = InObject.ResultType;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrMissionResult>("HrMissionResult")
			.addFunction("__tostring", &HrMissionResult::ToString)
			.addFunction("GetPtrAddr", &HrMissionResult::GetPtrAddr)
			.addProperty("ResultType", &HrMissionResult::ResultType)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("dSetCameraPos", &HrMissionResult::dSetCameraPos)
			.addFunction("dSetSceneTime", &HrMissionResult::dSetSceneTime)
			.addFunction("dGetStat", &HrMissionResult::dGetStat)
			.addFunction("dGetMode", &HrMissionResult::dGetMode)
			.addFunction("dGetResultType", &HrMissionResult::dGetResultType)
			.addStaticFunction("TestCreate", &HrMissionResult::TestCreate)
			.addFunction("MissionStartRender", &HrMissionResult::MissionStartRender)
			.addFunction("FaildRender", &HrMissionResult::FaildRender)
			.addFunction("RevengeFaildRender", &HrMissionResult::RevengeFaildRender)
			.addFunction("RevengeFaildFrame", &HrMissionResult::RevengeFaildFrame)
			.addFunction("RevengeClearRender", &HrMissionResult::RevengeClearRender)
			.addFunction("RevengeClearFrame", &HrMissionResult::RevengeClearFrame)
			.addFunction("RenderProcess", &HrMissionResult::RenderProcess)
			.addFunction("MissionStartFrame", &HrMissionResult::MissionStartFrame)
			.addFunction("FaildFrame", &HrMissionResult::FaildFrame)
			.addFunction("FrameProcess", &HrMissionResult::FrameProcess)
			// Can't export pointer to native type 'int16_t*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("GetRandPos", &HrMissionResult::GetRandPos)
			.addFunction("Terminate", &HrMissionResult::Terminate)
			.addStaticFunction("Create", &HrMissionResult::Create)
			.addFunction("Initialize", &HrMissionResult::Initialize)
			.addFunction("dAppear", &HrMissionResult::dAppear)
			.addFunction("dLeaving", &HrMissionResult::dLeaving)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrMissionResult::ResultType) == 4, "expected HrMissionResult::ResultType to be size 4");
static_assert(sizeof(HrMissionResult) == 0x1200, "expected HrMissionResult to be size 0x1200");

// enum BATTLE_SIMPLMESSEAGE_NUM
enum BATTLE_SIMPLMESSEAGE_NUM : uint32_t
{
	// <BSM_HP_RECOVER = 0x0>
	BSM_HP_RECOVER = 0,

	// <BSM_VT_RECOVER = 0x1>
	BSM_VT_RECOVER = 1,

	// <BSM_HP_FULL = 0x2>
	BSM_HP_FULL = 2,

	// <BSM_VT_FULL = 0x3>
	BSM_VT_FULL = 3,

	// <BSM_TENSION_UP = 0x4>
	BSM_TENSION_UP = 4,

	// <BSM_DEAD_POISON = 0x5>
	BSM_DEAD_POISON = 5,

	// <BSM_POISON_CLEAR = 0x6>
	BSM_POISON_CLEAR = 6,

	// <BSM_GET_MOMEY = 0x7>
	BSM_GET_MOMEY = 7,

	// <BSM_ALL_ENEMY = 0x8>
	BSM_ALL_ENEMY = 8,

	// <BSM_EVENT_ROCK = 0x9>
	BSM_EVENT_ROCK = 9,

	// <BSM_RELEASE_ROCK = 0xa>
	BSM_RELEASE_ROCK = 10,

	// <BSM_BREAK_DOOR = 0xb>
	BSM_BREAK_DOOR = 11,

	// <BSM_CHANGE_WEAPON = 0xc>
	BSM_CHANGE_WEAPON = 12,

	// <BSM_MAP_POINT = 0xd>
	BSM_MAP_POINT = 13,

	// <BSM_ENEMY_KATANA = 0xe>
	BSM_ENEMY_KATANA = 14,

	// <BSM_MOTEL_01 = 0xf>
	BSM_MOTEL_01 = 15,

	// <BSM_MOTEL_02 = 0x10>
	BSM_MOTEL_02 = 16,

	// <BSM_MOTEL_03 = 0x11>
	BSM_MOTEL_03 = 17,

	// <BSM_MOTEL_04 = 0x12>
	BSM_MOTEL_04 = 18,

	// <BSM_MOTEL_05 = 0x13>
	BSM_MOTEL_05 = 19,

	// <BSM_MOTEL_06 = 0x14>
	BSM_MOTEL_06 = 20,

	// <BSM_MOTEL_07 = 0x15>
	BSM_MOTEL_07 = 21,

	// <BSM_MOTEL_08 = 0x16>
	BSM_MOTEL_08 = 22,

	// <BSM_MOTEL_09 = 0x17>
	BSM_MOTEL_09 = 23,

	// <BSM_MOTEL_10 = 0x18>
	BSM_MOTEL_10 = 24,

	// <BSM_MOTEL_11 = 0x19>
	BSM_MOTEL_11 = 25,

	// <BSM_MOTEL_12 = 0x1a>
	BSM_MOTEL_12 = 26,

	// <BSM_MOTEL_13 = 0x1b>
	BSM_MOTEL_13 = 27,

	// <BSM_MOTEL_14 = 0x1c>
	BSM_MOTEL_14 = 28,

	// <BSM_MOTEL_15 = 0x1d>
	BSM_MOTEL_15 = 29,

	// <BSM_UAA_NO51 = 0x1e>
	BSM_UAA_NO51 = 30,

	// <BSM_UAA_NO50 = 0x1f>
	BSM_UAA_NO50 = 31,

	// <BSM_UAA_NO25 = 0x20>
	BSM_UAA_NO25 = 32,

	// <BSM_UAA_NOCH = 0x21>
	BSM_UAA_NOCH = 33,

	// <BSM_UAA_NO24 = 0x22>
	BSM_UAA_NO24 = 34,

	// <BSM_UAA_NO23 = 0x23>
	BSM_UAA_NO23 = 35,

	// <BSM_UAA_NO11 = 0x24>
	BSM_UAA_NO11 = 36,

	// <BSM_UAA_NO10 = 0x25>
	BSM_UAA_NO10 = 37,

	// <BSM_UAA_NO9 = 0x26>
	BSM_UAA_NO9 = 38,

	// <BSM_UAA_NO8 = 0x27>
	BSM_UAA_NO8 = 39,

	// <BSM_UAA_NODA = 0x28>
	BSM_UAA_NODA = 40,

	// <BSM_UAA_NO4 = 0x29>
	BSM_UAA_NO4 = 41,

	// <BSM_UAA_NO3 = 0x2a>
	BSM_UAA_NO3 = 42,

	// <BSM_UAA_NO2 = 0x2b>
	BSM_UAA_NO2 = 43,

	// <BSM_UAA_NO1 = 0x2c>
	BSM_UAA_NO1 = 44,

	// <BATTLESM_MAX = 0x2d>
	BATTLESM_MAX = 45

};

// [Structure] class CHrHUDDemoButton
class CHrHUDDemoButton
{
public:
	// enum CHrHUDDemoButton::PICT_ID_DEMO_BUTTON
	enum PICT_ID_DEMO_BUTTON : uint32_t
	{
		// <PICT_ID_BUTTON_A = 0x0>
		PICT_ID_BUTTON_A = 0,

		// <PICT_ID_BUTTON_B = 0x1>
		PICT_ID_BUTTON_B = 1,

		// <PICT_ID_BUTTON_C = 0x2>
		PICT_ID_BUTTON_C = 2,

		// <PICT_ID_BUTTON_Z = 0x3>
		PICT_ID_BUTTON_Z = 3,

		// <PICT_ID_BUTTON_CLASSIC_A = 0x4>
		PICT_ID_BUTTON_CLASSIC_A = 4,

		// <PICT_ID_BUTTON_CLASSIC_B = 0x5>
		PICT_ID_BUTTON_CLASSIC_B = 5,

		// <PICT_ID_BUTTON_CLASSIC_X = 0x6>
		PICT_ID_BUTTON_CLASSIC_X = 6,

		// <PICT_ID_BUTTON_CLASSIC_Y = 0x7>
		PICT_ID_BUTTON_CLASSIC_Y = 7,

		// <PICT_ID_BUTTON_ABCZ = 0x8>
		PICT_ID_BUTTON_ABCZ = 8,

		// <PICT_ID_BUTTON_CLASSIC_ABXY = 0x9>
		PICT_ID_BUTTON_CLASSIC_ABXY = 9,

		// <PICT_ID_MAX = 0xa>
		PICT_ID_MAX = 10

	};

	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[432];

public:
	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class CHrHUDDemoButton [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(CHrHUDDemoButton& InObject)
	{
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CHrHUDDemoButton>("CHrHUDDemoButton")
			.addFunction("__tostring", &CHrHUDDemoButton::ToString)
			.addFunction("GetPtrAddr", &CHrHUDDemoButton::GetPtrAddr)
		.endClass();
	}
#endif
};
static_assert(sizeof(CHrHUDDemoButton) == 0x1b0, "expected CHrHUDDemoButton to be size 0x1b0");

// [Structure] class HrScreenStatusBalloon
class HrScreenStatusBalloon
{
public:
	// enum HrScreenStatusBalloon::OBJ_ID
	enum OBJ_ID : uint32_t
	{
		// <OBJ_ID_WEAPON_A = 0x0>
		OBJ_ID_WEAPON_A = 0,

		// <OBJ_ID_WEAPON_B = 0x1>
		OBJ_ID_WEAPON_B = 1,

		// <OBJ_ID_WEAPON_C = 0x2>
		OBJ_ID_WEAPON_C = 2,

		// <OBJ_ID_WEAPON_D = 0x3>
		OBJ_ID_WEAPON_D = 3,

		// <OBJ_ID_A = 0x4>
		OBJ_ID_A = 4,

		// <OBJ_ID_CAN_NOT_DROP_OFF = 0x5>
		OBJ_ID_CAN_NOT_DROP_OFF = 5,

		// <OBJ_ID_RIMOCON_SHAKE = 0x6>
		OBJ_ID_RIMOCON_SHAKE = 6,

		// <OBJ_ID_CAN_DOWN_ATTACK = 0x7>
		OBJ_ID_CAN_DOWN_ATTACK = 7,

		// <OBJ_ID_EXIT = 0x8>
		OBJ_ID_EXIT = 8,

		// <OBJ_ID_CLOSET = 0x9>
		OBJ_ID_CLOSET = 9,

		// <OBJ_ID_JEANE = 0xa>
		OBJ_ID_JEANE = 10,

		// <OBJ_ID_SHELF = 0xb>
		OBJ_ID_SHELF = 11,

		// <OBJ_ID_TELEVISION = 0xc>
		OBJ_ID_TELEVISION = 12,

		// <OBJ_ID_TOILET = 0xd>
		OBJ_ID_TOILET = 13,

		// <OBJ_ID_BUTTON_A_SCREEN = 0xe>
		OBJ_ID_BUTTON_A_SCREEN = 14,

		// <OBJ_ID_MAX = 0xf>
		OBJ_ID_MAX = 15

	};

	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[1696];

public:
	/// 8 Functions

	// [Function] uint8_t __convention("thiscall") HrScreenStatusBalloon::IsActive(class HrScreenStatusBalloon* const this) [?IsActive@HrScreenStatusBalloon@@QAE_NXZ]
	typedef uint8_t(__thiscall* _IsActive_HrScreenStatusBalloon__QAE_NXZ)(class HrScreenStatusBalloon* const thisPtr);
	uint8_t IsActive()
	{
		_IsActive_HrScreenStatusBalloon__QAE_NXZ mFunc = (_IsActive_HrScreenStatusBalloon__QAE_NXZ)(GameModule + 0xafbf0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusBalloon::IsAppear(class HrScreenStatusBalloon* const this, enum HrScreenStatusBalloon::OBJ_ID arg2) [?IsAppear@HrScreenStatusBalloon@@QAE_NW4OBJ_ID@1@@Z]
	typedef uint8_t(__thiscall* _IsAppear_HrScreenStatusBalloon__QAE_NW4OBJ_ID_1__Z)(class HrScreenStatusBalloon* const thisPtr, enum HrScreenStatusBalloon::OBJ_ID arg2);
	uint8_t IsAppear(/* enum HrScreenStatusBalloon::OBJ_ID */ uint32_t arg2)
	{
		_IsAppear_HrScreenStatusBalloon__QAE_NW4OBJ_ID_1__Z mFunc = (_IsAppear_HrScreenStatusBalloon__QAE_NW4OBJ_ID_1__Z)(GameModule + 0xafc00);
		return mFunc(this, (enum HrScreenStatusBalloon::OBJ_ID)arg2);
	}
	// [Function] struct NYPictData* __convention("thiscall") HrScreenStatusBalloon::GetPictData(class HrScreenStatusBalloon* const this, int32_t arg2) [?GetPictData@HrScreenStatusBalloon@@AAEPAUNYPictData@@H@Z]
	typedef struct NYPictData*(__thiscall* _GetPictData_HrScreenStatusBalloon__AAEPAUNYPictData__H_Z)(class HrScreenStatusBalloon* const thisPtr, int32_t arg2);
	struct NYPictData* GetPictData(int32_t arg2)
	{
		_GetPictData_HrScreenStatusBalloon__AAEPAUNYPictData__H_Z mFunc = (_GetPictData_HrScreenStatusBalloon__AAEPAUNYPictData__H_Z)(GameModule + 0x5a0b20);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatusBalloon::LeaveAll(class HrScreenStatusBalloon* const this, uint8_t arg2) [?LeaveAll@HrScreenStatusBalloon@@QAEX_N@Z]
	typedef void(__thiscall* _LeaveAll_HrScreenStatusBalloon__QAEX_N_Z)(class HrScreenStatusBalloon* const thisPtr, uint8_t arg2);
	void LeaveAll(uint8_t arg2)
	{
		_LeaveAll_HrScreenStatusBalloon__QAEX_N_Z mFunc = (_LeaveAll_HrScreenStatusBalloon__QAEX_N_Z)(GameModule + 0x5a0c60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatusBalloon::FrameProcess(class HrScreenStatusBalloon* const this) [?FrameProcess@HrScreenStatusBalloon@@QAEXXZ]
	typedef void(__thiscall* _FrameProcess_HrScreenStatusBalloon__QAEXXZ)(class HrScreenStatusBalloon* const thisPtr);
	void FrameProcess()
	{
		_FrameProcess_HrScreenStatusBalloon__QAEXXZ mFunc = (_FrameProcess_HrScreenStatusBalloon__QAEXXZ)(GameModule + 0x5a0d50);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatusBalloon::RenderProcess(class HrScreenStatusBalloon* const this) [?RenderProcess@HrScreenStatusBalloon@@QAEXXZ]
	typedef void(__thiscall* _RenderProcess_HrScreenStatusBalloon__QAEXXZ)(class HrScreenStatusBalloon* const thisPtr);
	void RenderProcess()
	{
		_RenderProcess_HrScreenStatusBalloon__QAEXXZ mFunc = (_RenderProcess_HrScreenStatusBalloon__QAEXXZ)(GameModule + 0x5a0f70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatusBalloon::Appear(class HrScreenStatusBalloon* const this, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3) [?Appear@HrScreenStatusBalloon@@QAEXW4OBJ_ID@1@_N@Z]
	typedef void(__thiscall* _Appear_HrScreenStatusBalloon__QAEXW4OBJ_ID_1__N_Z)(class HrScreenStatusBalloon* const thisPtr, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3);
	void Appear(/* enum HrScreenStatusBalloon::OBJ_ID */ uint32_t arg2, uint8_t arg3)
	{
		_Appear_HrScreenStatusBalloon__QAEXW4OBJ_ID_1__N_Z mFunc = (_Appear_HrScreenStatusBalloon__QAEXW4OBJ_ID_1__N_Z)(GameModule + 0x5a1260);
		return mFunc(this, (enum HrScreenStatusBalloon::OBJ_ID)arg2, arg3);
	}
	// [Function] void __convention("thiscall") HrScreenStatusBalloon::Leave(class HrScreenStatusBalloon* const this, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3) [?Leave@HrScreenStatusBalloon@@QAEXW4OBJ_ID@1@_N@Z]
	typedef void(__thiscall* _Leave_HrScreenStatusBalloon__QAEXW4OBJ_ID_1__N_Z)(class HrScreenStatusBalloon* const thisPtr, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3);
	void Leave(/* enum HrScreenStatusBalloon::OBJ_ID */ uint32_t arg2, uint8_t arg3)
	{
		_Leave_HrScreenStatusBalloon__QAEXW4OBJ_ID_1__N_Z mFunc = (_Leave_HrScreenStatusBalloon__QAEXW4OBJ_ID_1__N_Z)(GameModule + 0x5a17b0);
		return mFunc(this, (enum HrScreenStatusBalloon::OBJ_ID)arg2, arg3);
	}
	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrScreenStatusBalloon [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrScreenStatusBalloon& InObject)
	{
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrScreenStatusBalloon>("HrScreenStatusBalloon")
			.addFunction("__tostring", &HrScreenStatusBalloon::ToString)
			.addFunction("GetPtrAddr", &HrScreenStatusBalloon::GetPtrAddr)
			.addFunction("IsActive", &HrScreenStatusBalloon::IsActive)
			.addFunction("IsAppear", &HrScreenStatusBalloon::IsAppear)
			.addFunction("GetPictData", &HrScreenStatusBalloon::GetPictData)
			.addFunction("LeaveAll", &HrScreenStatusBalloon::LeaveAll)
			.addFunction("FrameProcess", &HrScreenStatusBalloon::FrameProcess)
			.addFunction("RenderProcess", &HrScreenStatusBalloon::RenderProcess)
			.addFunction("Appear", &HrScreenStatusBalloon::Appear)
			.addFunction("Leave", &HrScreenStatusBalloon::Leave)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrScreenStatusBalloon) == 0x6a0, "expected HrScreenStatusBalloon to be size 0x6a0");

// enum GHMR_TEXDOT_ASPECT
enum GHMR_TEXDOT_ASPECT : uint32_t
{
	// <GHMR_TEXDOT_ASPECT_1x1 = 0x0>
	GHMR_TEXDOT_ASPECT_1x1 = 0,

	// <GHMR_TEXDOT_ASPECT_CANCEL = 0x1>
	GHMR_TEXDOT_ASPECT_CANCEL = 1

};

// enum _GXTexFmt
enum _GXTexFmt : uint32_t
{
	// <GX_TF_I4 = 0x0>
	GX_TF_I4 = 0,

	// <GX_TF_I8 = 0x1>
	GX_TF_I8 = 1,

	// <GX_TF_IA4 = 0x2>
	GX_TF_IA4 = 2,

	// <GX_TF_IA8 = 0x3>
	GX_TF_IA8 = 3,

	// <GX_TF_RGB565 = 0x4>
	GX_TF_RGB565 = 4,

	// <GX_TF_RGB5A3 = 0x5>
	GX_TF_RGB5A3 = 5,

	// <GX_TF_RGBA8 = 0x6>
	GX_TF_RGBA8 = 6,

	// <GX_TF_CMPR = 0xe>
	GX_TF_CMPR = 14,

	// <GX_CTF_R4 = 0x20>
	GX_CTF_R4 = 32,

	// <GX_CTF_RA4 = 0x22>
	GX_CTF_RA4 = 34,

	// <GX_CTF_RA8 = 0x23>
	GX_CTF_RA8 = 35,

	// <GX_CTF_YUVA8 = 0x26>
	GX_CTF_YUVA8 = 38,

	// <GX_CTF_A8 = 0x27>
	GX_CTF_A8 = 39,

	// <GX_CTF_R8 = 0x28>
	GX_CTF_R8 = 40,

	// <GX_CTF_G8 = 0x29>
	GX_CTF_G8 = 41,

	// <GX_CTF_B8 = 0x2a>
	GX_CTF_B8 = 42,

	// <GX_CTF_RG8 = 0x2b>
	GX_CTF_RG8 = 43,

	// <GX_CTF_GB8 = 0x2c>
	GX_CTF_GB8 = 44,

	// <GX_TF_Z8 = 0x11>
	GX_TF_Z8 = 17,

	// <GX_TF_Z16 = 0x13>
	GX_TF_Z16 = 19,

	// <GX_TF_Z24X8 = 0x16>
	GX_TF_Z24X8 = 22,

	// <GX_CTF_Z4 = 0x30>
	GX_CTF_Z4 = 48,

	// <GX_CTF_Z8M = 0x39>
	GX_CTF_Z8M = 57,

	// <GX_CTF_Z8L = 0x3a>
	GX_CTF_Z8L = 58,

	// <GX_CTF_Z16L = 0x3c>
	GX_CTF_Z16L = 60,

	// <GX_TF_A8 = 0x27>
	GX_TF_A8 = 39

};

// enum GHMR_TEXFILTER
enum GHMR_TEXFILTER : uint32_t
{
	// <GHMR_TEXFILTER_NEAR = 0x0>
	GHMR_TEXFILTER_NEAR = 0,

	// <GHMR_TEXFILTER_LINEAR = 0x1>
	GHMR_TEXFILTER_LINEAR = 1

};

// enum GHMR_TEXADDRESS
enum GHMR_TEXADDRESS : uint32_t
{
	// <GHMR_TEXADDRESS_CLAMP = 0x0>
	GHMR_TEXADDRESS_CLAMP = 0,

	// <GHMR_TEXADDRESS_REPEAT = 0x1>
	GHMR_TEXADDRESS_REPEAT = 1,

	// <GHMR_TEXADDRESS_MIRROR = 0x2>
	GHMR_TEXADDRESS_MIRROR = 2,

	// <GHMR_TEXADDRESS_REPEAT_FORCED = 0x3>
	GHMR_TEXADDRESS_REPEAT_FORCED = 3,

	// <GHMR_TEXADDRESS_MIRROR_FORCED = 0x4>
	GHMR_TEXADDRESS_MIRROR_FORCED = 4

};

// [Structure] struct GXTexObj
struct GXTexObj
{
public:
	/// Struct member variables

	// <class GXTexture* pTex, offset 0x0>
	class GXTexture* pTex = nullptr;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct GXTexObj [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(GXTexObj& InObject)
	{
		pTex = InObject.pTex;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GXTexObj>("GXTexObj")
			.addFunction("__tostring", &GXTexObj::ToString)
			.addFunction("GetPtrAddr", &GXTexObj::GetPtrAddr)
			.addProperty("pTex", &GXTexObj::pTex)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXTexObj::pTex) == 4, "expected GXTexObj::pTex to be size 4");
static_assert(sizeof(GXTexObj) == 0x4, "expected GXTexObj to be size 0x4");

// [Structure] struct tagGHMR_TEX
struct tagGHMR_TEX
{
public:
	/// Struct member variables

	// <uint8_t TMEFlag, offset 0x0>
	uint8_t TMEFlag = 0;

	// <uint8_t AlphaFlag, offset 0x1>
	uint8_t AlphaFlag = 0;

	// <uint8_t ImageBufferFreeFlag, offset 0x2>
	uint8_t ImageBufferFreeFlag = 0;

	// <Unidentified data segment, offset 0x3>
private:
	char _UnidentifiedData_3[1];

public:
	// <void* FileImage, offset 0x4>
	void* FileImage = nullptr;

	// <void* ImageBuffer, offset 0x8>
	void* ImageBuffer = nullptr;

	// <uint16_t Width, offset 0xc>
	uint16_t Width = 0;

	// <uint16_t Height, offset 0xe>
	uint16_t Height = 0;

	// <struct GXTexObj TexObj, offset 0x10>
	struct GXTexObj TexObj;

	// <enum GHMR_TEXADDRESS AddressMode, offset 0x14>
	enum GHMR_TEXADDRESS AddressMode;

	// <enum GHMR_TEXFILTER FilterMode, offset 0x18>
	enum GHMR_TEXFILTER FilterMode;

	// <enum _GXTexFmt GetScreenImageFormat, offset 0x1c>
	enum _GXTexFmt GetScreenImageFormat;

	// <int32_t ImageSize, offset 0x20>
	int32_t ImageSize = 0;

	// <enum GHMR_TEXDOT_ASPECT Aspect, offset 0x24>
	enum GHMR_TEXDOT_ASPECT Aspect;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct tagGHMR_TEX [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(tagGHMR_TEX& InObject)
	{
		TMEFlag = InObject.TMEFlag;
		AlphaFlag = InObject.AlphaFlag;
		ImageBufferFreeFlag = InObject.ImageBufferFreeFlag;
		FileImage = InObject.FileImage;
		ImageBuffer = InObject.ImageBuffer;
		Width = InObject.Width;
		Height = InObject.Height;
		TexObj = InObject.TexObj;
		AddressMode = InObject.AddressMode;
		FilterMode = InObject.FilterMode;
		GetScreenImageFormat = InObject.GetScreenImageFormat;
		ImageSize = InObject.ImageSize;
		Aspect = InObject.Aspect;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<tagGHMR_TEX>("tagGHMR_TEX")
			.addFunction("__tostring", &tagGHMR_TEX::ToString)
			.addFunction("GetPtrAddr", &tagGHMR_TEX::GetPtrAddr)
			.addProperty("TMEFlag", &tagGHMR_TEX::TMEFlag)
			.addProperty("AlphaFlag", &tagGHMR_TEX::AlphaFlag)
			.addProperty("ImageBufferFreeFlag", &tagGHMR_TEX::ImageBufferFreeFlag)
			// void type not supported in LuaBridge
			//.addProperty("FileImage", &tagGHMR_TEX::FileImage)
			// void type not supported in LuaBridge
			//.addProperty("ImageBuffer", &tagGHMR_TEX::ImageBuffer)
			.addProperty("Width", &tagGHMR_TEX::Width)
			.addProperty("Height", &tagGHMR_TEX::Height)
			.addProperty("TexObj", &tagGHMR_TEX::TexObj)
			.addProperty("AddressMode", &tagGHMR_TEX::AddressMode)
			.addProperty("FilterMode", &tagGHMR_TEX::FilterMode)
			.addProperty("GetScreenImageFormat", &tagGHMR_TEX::GetScreenImageFormat)
			.addProperty("ImageSize", &tagGHMR_TEX::ImageSize)
			.addProperty("Aspect", &tagGHMR_TEX::Aspect)
		.endClass();
	}
#endif
};
static_assert(sizeof(tagGHMR_TEX::TMEFlag) == 1, "expected tagGHMR_TEX::TMEFlag to be size 1");
static_assert(sizeof(tagGHMR_TEX::AlphaFlag) == 1, "expected tagGHMR_TEX::AlphaFlag to be size 1");
static_assert(sizeof(tagGHMR_TEX::ImageBufferFreeFlag) == 1, "expected tagGHMR_TEX::ImageBufferFreeFlag to be size 1");
static_assert(sizeof(tagGHMR_TEX::FileImage) == 4, "expected tagGHMR_TEX::FileImage to be size 4");
static_assert(sizeof(tagGHMR_TEX::ImageBuffer) == 4, "expected tagGHMR_TEX::ImageBuffer to be size 4");
static_assert(sizeof(tagGHMR_TEX::Width) == 2, "expected tagGHMR_TEX::Width to be size 2");
static_assert(sizeof(tagGHMR_TEX::Height) == 2, "expected tagGHMR_TEX::Height to be size 2");
static_assert(sizeof(tagGHMR_TEX::TexObj) == 4, "expected tagGHMR_TEX::TexObj to be size 4");
static_assert(sizeof(tagGHMR_TEX::AddressMode) == 4, "expected tagGHMR_TEX::AddressMode to be size 4");
static_assert(sizeof(tagGHMR_TEX::FilterMode) == 4, "expected tagGHMR_TEX::FilterMode to be size 4");
static_assert(sizeof(tagGHMR_TEX::GetScreenImageFormat) == 4, "expected tagGHMR_TEX::GetScreenImageFormat to be size 4");
static_assert(sizeof(tagGHMR_TEX::ImageSize) == 4, "expected tagGHMR_TEX::ImageSize to be size 4");
static_assert(sizeof(tagGHMR_TEX::Aspect) == 4, "expected tagGHMR_TEX::Aspect to be size 4");
static_assert(sizeof(tagGHMR_TEX) == 0x28, "expected tagGHMR_TEX to be size 0x28");

// [Structure] class HrScreenStatusSlot
class HrScreenStatusSlot
{
public:
	/// Struct member variables

	// <struct tagGHMR_TEX* m_pTex, offset 0x0>
	struct tagGHMR_TEX* m_pTex = nullptr;

	// <char m_SlotDeme[0x3], offset 0x4>
	char m_SlotDeme[3];

	// <Unidentified data segment, offset 0x7>
private:
	char _UnidentifiedData_7[1];

public:
	// <int16_t m_SlotDemeCounter[0x3], offset 0x8>
	int16_t m_SlotDemeCounter[3];

	// <int16_t m_SlotCounter, offset 0xe>
	int16_t m_SlotCounter = 0;

	// <int32_t m_zoromeCounter, offset 0x10>
	int32_t m_zoromeCounter = 0;

	// <uint8_t m_PlayZoroSound, offset 0x14>
	uint8_t m_PlayZoroSound = 0;

	// <uint8_t m_LeachHazure, offset 0x15>
	uint8_t m_LeachHazure = 0;

	// <uint8_t m_PlayLeachSound, offset 0x16>
	uint8_t m_PlayLeachSound = 0;

	// <uint8_t m_bZoromeSorotta, offset 0x17>
	uint8_t m_bZoromeSorotta = 0;

	// <uint8_t m_SlotZoromeStartToEndFlag, offset 0x18>
	uint8_t m_SlotZoromeStartToEndFlag = 0;

	// <uint8_t m_SlotSPAttackStartFlag, offset 0x19>
	uint8_t m_SlotSPAttackStartFlag = 0;

	// <int16_t m_SlotZoromeZOROME, offset 0x1a>
	int16_t m_SlotZoromeZOROME = 0;

	// <int32_t m_SlotZoroLeaveWaitCnt, offset 0x1c>
	int32_t m_SlotZoroLeaveWaitCnt = 0;

	// <int32_t m_SprLchSoundID, offset 0x20>
	int32_t m_SprLchSoundID = 0;

	// <uint32_t flaglmode, offset 0x24>
	uint32_t flaglmode = 0;

	/// 17 Functions

	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::dGetSlotZoromeBeginToEnd(class HrScreenStatusSlot* const this) [?dGetSlotZoromeBeginToEnd@HrScreenStatusSlot@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dGetSlotZoromeBeginToEnd_HrScreenStatusSlot__QAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t dGetSlotZoromeBeginToEnd()
	{
		_dGetSlotZoromeBeginToEnd_HrScreenStatusSlot__QAE_NXZ mFunc = (_dGetSlotZoromeBeginToEnd_HrScreenStatusSlot__QAE_NXZ)(GameModule + 0xa2210);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::dGetSlotSPAttackOK(class HrScreenStatusSlot* const this) [?dGetSlotSPAttackOK@HrScreenStatusSlot@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dGetSlotSPAttackOK_HrScreenStatusSlot__QAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t dGetSlotSPAttackOK()
	{
		_dGetSlotSPAttackOK_HrScreenStatusSlot__QAE_NXZ mFunc = (_dGetSlotSPAttackOK_HrScreenStatusSlot__QAE_NXZ)(GameModule + 0xaab30);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::dCheckSlotActive(class HrScreenStatusSlot* const this) [?dCheckSlotActive@HrScreenStatusSlot@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dCheckSlotActive_HrScreenStatusSlot__QAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t dCheckSlotActive()
	{
		_dCheckSlotActive_HrScreenStatusSlot__QAE_NXZ mFunc = (_dCheckSlotActive_HrScreenStatusSlot__QAE_NXZ)(GameModule + 0xaab40);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::IsActive(class HrScreenStatusSlot* const this) [?IsActive@HrScreenStatusSlot@@QAE_NXZ]
	typedef uint8_t(__thiscall* _IsActive_HrScreenStatusSlot__QAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t IsActive()
	{
		_IsActive_HrScreenStatusSlot__QAE_NXZ mFunc = (_IsActive_HrScreenStatusSlot__QAE_NXZ)(GameModule + 0xafc20);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::IsLeavePhase(class HrScreenStatusSlot* const this) [?IsLeavePhase@HrScreenStatusSlot@@QAE_NXZ]
	typedef uint8_t(__thiscall* _IsLeavePhase_HrScreenStatusSlot__QAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t IsLeavePhase()
	{
		_IsLeavePhase_HrScreenStatusSlot__QAE_NXZ mFunc = (_IsLeavePhase_HrScreenStatusSlot__QAE_NXZ)(GameModule + 0xba8b0);
		return mFunc(this);
	}
	// [Function] int16_t __convention("thiscall") HrScreenStatusSlot::GetZOROMEID(class HrScreenStatusSlot* const this) [?GetZOROMEID@HrScreenStatusSlot@@IAEFXZ]
	typedef int16_t(__thiscall* _GetZOROMEID_HrScreenStatusSlot__IAEFXZ)(class HrScreenStatusSlot* const thisPtr);
	int16_t GetZOROMEID()
	{
		_GetZOROMEID_HrScreenStatusSlot__IAEFXZ mFunc = (_GetZOROMEID_HrScreenStatusSlot__IAEFXZ)(GameModule + 0x5667f0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::ZoromeRenderProcess(class HrScreenStatusSlot* const this) [?ZoromeRenderProcess@HrScreenStatusSlot@@IAEXXZ]
	typedef void(__thiscall* _ZoromeRenderProcess_HrScreenStatusSlot__IAEXXZ)(class HrScreenStatusSlot* const thisPtr);
	void ZoromeRenderProcess()
	{
		_ZoromeRenderProcess_HrScreenStatusSlot__IAEXXZ mFunc = (_ZoromeRenderProcess_HrScreenStatusSlot__IAEXXZ)(GameModule + 0x566800);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::SlotRenderProcess(class HrScreenStatusSlot* const this) [?SlotRenderProcess@HrScreenStatusSlot@@IAE_NXZ]
	typedef uint8_t(__thiscall* _SlotRenderProcess_HrScreenStatusSlot__IAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t SlotRenderProcess()
	{
		_SlotRenderProcess_HrScreenStatusSlot__IAE_NXZ mFunc = (_SlotRenderProcess_HrScreenStatusSlot__IAE_NXZ)(GameModule + 0x566bb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::ZoromeFrameProcess(class HrScreenStatusSlot* const this) [?ZoromeFrameProcess@HrScreenStatusSlot@@IAEXXZ]
	typedef void(__thiscall* _ZoromeFrameProcess_HrScreenStatusSlot__IAEXXZ)(class HrScreenStatusSlot* const thisPtr);
	void ZoromeFrameProcess()
	{
		_ZoromeFrameProcess_HrScreenStatusSlot__IAEXXZ mFunc = (_ZoromeFrameProcess_HrScreenStatusSlot__IAEXXZ)(GameModule + 0x566ec0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::SlotFrameProcess(class HrScreenStatusSlot* const this) [?SlotFrameProcess@HrScreenStatusSlot@@IAEXXZ]
	typedef void(__thiscall* _SlotFrameProcess_HrScreenStatusSlot__IAEXXZ)(class HrScreenStatusSlot* const thisPtr);
	void SlotFrameProcess()
	{
		_SlotFrameProcess_HrScreenStatusSlot__IAEXXZ mFunc = (_SlotFrameProcess_HrScreenStatusSlot__IAEXXZ)(GameModule + 0x566f00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::Initialize(class HrScreenStatusSlot* const this, struct tagGHMR_TEX* arg2) [?Initialize@HrScreenStatusSlot@@QAEXPAUtagGHMR_TEX@@@Z]
	typedef void(__thiscall* _Initialize_HrScreenStatusSlot__QAEXPAUtagGHMR_TEX___Z)(class HrScreenStatusSlot* const thisPtr, struct tagGHMR_TEX* arg2);
	void Initialize(struct tagGHMR_TEX* arg2)
	{
		_Initialize_HrScreenStatusSlot__QAEXPAUtagGHMR_TEX___Z mFunc = (_Initialize_HrScreenStatusSlot__QAEXPAUtagGHMR_TEX___Z)(GameModule + 0x567040);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::FrameProcess(class HrScreenStatusSlot* const this) [?FrameProcess@HrScreenStatusSlot@@QAEXXZ]
	typedef void(__thiscall* _FrameProcess_HrScreenStatusSlot__QAEXXZ)(class HrScreenStatusSlot* const thisPtr);
	void FrameProcess()
	{
		_FrameProcess_HrScreenStatusSlot__QAEXXZ mFunc = (_FrameProcess_HrScreenStatusSlot__QAEXXZ)(GameModule + 0x5670b0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::RenderProcess(class HrScreenStatusSlot* const this) [?RenderProcess@HrScreenStatusSlot@@QAE_NXZ]
	typedef uint8_t(__thiscall* _RenderProcess_HrScreenStatusSlot__QAE_NXZ)(class HrScreenStatusSlot* const thisPtr);
	uint8_t RenderProcess()
	{
		_RenderProcess_HrScreenStatusSlot__QAE_NXZ mFunc = (_RenderProcess_HrScreenStatusSlot__QAE_NXZ)(GameModule + 0x567240);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatusSlot::dAppearSlot(class HrScreenStatusSlot* const this, int16_t arg2, int16_t arg3) [?dAppearSlot@HrScreenStatusSlot@@QAE_NFF@Z]
	typedef uint8_t(__thiscall* _dAppearSlot_HrScreenStatusSlot__QAE_NFF_Z)(class HrScreenStatusSlot* const thisPtr, int16_t arg2, int16_t arg3);
	uint8_t dAppearSlot(int16_t arg2, int16_t arg3)
	{
		_dAppearSlot_HrScreenStatusSlot__QAE_NFF_Z mFunc = (_dAppearSlot_HrScreenStatusSlot__QAE_NFF_Z)(GameModule + 0x567270);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint16_t __convention("thiscall") HrScreenStatusSlot::dGetLMode(class HrScreenStatusSlot* const this, int32_t arg2) [?dGetLMode@HrScreenStatusSlot@@QAEGH@Z]
	typedef uint16_t(__thiscall* _dGetLMode_HrScreenStatusSlot__QAEGH_Z)(class HrScreenStatusSlot* const thisPtr, int32_t arg2);
	uint16_t dGetLMode(int32_t arg2)
	{
		_dGetLMode_HrScreenStatusSlot__QAEGH_Z mFunc = (_dGetLMode_HrScreenStatusSlot__QAEGH_Z)(GameModule + 0x567580);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::dClearLMode(class HrScreenStatusSlot* const this, int32_t arg2, uint8_t arg3) [?dClearLMode@HrScreenStatusSlot@@QAEXH_N@Z]
	typedef void(__thiscall* _dClearLMode_HrScreenStatusSlot__QAEXH_N_Z)(class HrScreenStatusSlot* const thisPtr, int32_t arg2, uint8_t arg3);
	void dClearLMode(int32_t arg2, uint8_t arg3)
	{
		_dClearLMode_HrScreenStatusSlot__QAEXH_N_Z mFunc = (_dClearLMode_HrScreenStatusSlot__QAEXH_N_Z)(GameModule + 0x5675f0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") HrScreenStatusSlot::dSetSlotSPAttackOK(class HrScreenStatusSlot* const this, uint8_t arg2) [?dSetSlotSPAttackOK@HrScreenStatusSlot@@QAEX_N@Z]
	typedef void(__thiscall* _dSetSlotSPAttackOK_HrScreenStatusSlot__QAEX_N_Z)(class HrScreenStatusSlot* const thisPtr, uint8_t arg2);
	void dSetSlotSPAttackOK(uint8_t arg2)
	{
		_dSetSlotSPAttackOK_HrScreenStatusSlot__QAEX_N_Z mFunc = (_dSetSlotSPAttackOK_HrScreenStatusSlot__QAEX_N_Z)(GameModule + 0x567650);
		return mFunc(this, arg2);
	}
	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrScreenStatusSlot [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrScreenStatusSlot& InObject)
	{
		m_pTex = InObject.m_pTex;
		m_SlotCounter = InObject.m_SlotCounter;
		m_zoromeCounter = InObject.m_zoromeCounter;
		m_PlayZoroSound = InObject.m_PlayZoroSound;
		m_LeachHazure = InObject.m_LeachHazure;
		m_PlayLeachSound = InObject.m_PlayLeachSound;
		m_bZoromeSorotta = InObject.m_bZoromeSorotta;
		m_SlotZoromeStartToEndFlag = InObject.m_SlotZoromeStartToEndFlag;
		m_SlotSPAttackStartFlag = InObject.m_SlotSPAttackStartFlag;
		m_SlotZoromeZOROME = InObject.m_SlotZoromeZOROME;
		m_SlotZoroLeaveWaitCnt = InObject.m_SlotZoroLeaveWaitCnt;
		m_SprLchSoundID = InObject.m_SprLchSoundID;
		flaglmode = InObject.flaglmode;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrScreenStatusSlot>("HrScreenStatusSlot")
			.addFunction("__tostring", &HrScreenStatusSlot::ToString)
			.addFunction("GetPtrAddr", &HrScreenStatusSlot::GetPtrAddr)
			.addProperty("m_pTex", &HrScreenStatusSlot::m_pTex)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_SlotDeme", &HrScreenStatusSlot::m_SlotDeme)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_SlotDemeCounter", &HrScreenStatusSlot::m_SlotDemeCounter)
			.addProperty("m_SlotCounter", &HrScreenStatusSlot::m_SlotCounter)
			.addProperty("m_zoromeCounter", &HrScreenStatusSlot::m_zoromeCounter)
			.addProperty("m_PlayZoroSound", &HrScreenStatusSlot::m_PlayZoroSound)
			.addProperty("m_LeachHazure", &HrScreenStatusSlot::m_LeachHazure)
			.addProperty("m_PlayLeachSound", &HrScreenStatusSlot::m_PlayLeachSound)
			.addProperty("m_bZoromeSorotta", &HrScreenStatusSlot::m_bZoromeSorotta)
			.addProperty("m_SlotZoromeStartToEndFlag", &HrScreenStatusSlot::m_SlotZoromeStartToEndFlag)
			.addProperty("m_SlotSPAttackStartFlag", &HrScreenStatusSlot::m_SlotSPAttackStartFlag)
			.addProperty("m_SlotZoromeZOROME", &HrScreenStatusSlot::m_SlotZoromeZOROME)
			.addProperty("m_SlotZoroLeaveWaitCnt", &HrScreenStatusSlot::m_SlotZoroLeaveWaitCnt)
			.addProperty("m_SprLchSoundID", &HrScreenStatusSlot::m_SprLchSoundID)
			.addProperty("flaglmode", &HrScreenStatusSlot::flaglmode)
			.addFunction("dGetSlotZoromeBeginToEnd", &HrScreenStatusSlot::dGetSlotZoromeBeginToEnd)
			.addFunction("dGetSlotSPAttackOK", &HrScreenStatusSlot::dGetSlotSPAttackOK)
			.addFunction("dCheckSlotActive", &HrScreenStatusSlot::dCheckSlotActive)
			.addFunction("IsActive", &HrScreenStatusSlot::IsActive)
			.addFunction("IsLeavePhase", &HrScreenStatusSlot::IsLeavePhase)
			.addFunction("GetZOROMEID", &HrScreenStatusSlot::GetZOROMEID)
			.addFunction("ZoromeRenderProcess", &HrScreenStatusSlot::ZoromeRenderProcess)
			.addFunction("SlotRenderProcess", &HrScreenStatusSlot::SlotRenderProcess)
			.addFunction("ZoromeFrameProcess", &HrScreenStatusSlot::ZoromeFrameProcess)
			.addFunction("SlotFrameProcess", &HrScreenStatusSlot::SlotFrameProcess)
			.addFunction("Initialize", &HrScreenStatusSlot::Initialize)
			.addFunction("FrameProcess", &HrScreenStatusSlot::FrameProcess)
			.addFunction("RenderProcess", &HrScreenStatusSlot::RenderProcess)
			.addFunction("dAppearSlot", &HrScreenStatusSlot::dAppearSlot)
			.addFunction("dGetLMode", &HrScreenStatusSlot::dGetLMode)
			.addFunction("dClearLMode", &HrScreenStatusSlot::dClearLMode)
			.addFunction("dSetSlotSPAttackOK", &HrScreenStatusSlot::dSetSlotSPAttackOK)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrScreenStatusSlot::m_pTex) == 4, "expected HrScreenStatusSlot::m_pTex to be size 4");
static_assert(sizeof(HrScreenStatusSlot::m_SlotDeme) == 3, "expected HrScreenStatusSlot::m_SlotDeme to be size 3");
static_assert(sizeof(HrScreenStatusSlot::m_SlotDemeCounter) == 6, "expected HrScreenStatusSlot::m_SlotDemeCounter to be size 6");
static_assert(sizeof(HrScreenStatusSlot::m_SlotCounter) == 2, "expected HrScreenStatusSlot::m_SlotCounter to be size 2");
static_assert(sizeof(HrScreenStatusSlot::m_zoromeCounter) == 4, "expected HrScreenStatusSlot::m_zoromeCounter to be size 4");
static_assert(sizeof(HrScreenStatusSlot::m_PlayZoroSound) == 1, "expected HrScreenStatusSlot::m_PlayZoroSound to be size 1");
static_assert(sizeof(HrScreenStatusSlot::m_LeachHazure) == 1, "expected HrScreenStatusSlot::m_LeachHazure to be size 1");
static_assert(sizeof(HrScreenStatusSlot::m_PlayLeachSound) == 1, "expected HrScreenStatusSlot::m_PlayLeachSound to be size 1");
static_assert(sizeof(HrScreenStatusSlot::m_bZoromeSorotta) == 1, "expected HrScreenStatusSlot::m_bZoromeSorotta to be size 1");
static_assert(sizeof(HrScreenStatusSlot::m_SlotZoromeStartToEndFlag) == 1, "expected HrScreenStatusSlot::m_SlotZoromeStartToEndFlag to be size 1");
static_assert(sizeof(HrScreenStatusSlot::m_SlotSPAttackStartFlag) == 1, "expected HrScreenStatusSlot::m_SlotSPAttackStartFlag to be size 1");
static_assert(sizeof(HrScreenStatusSlot::m_SlotZoromeZOROME) == 2, "expected HrScreenStatusSlot::m_SlotZoromeZOROME to be size 2");
static_assert(sizeof(HrScreenStatusSlot::m_SlotZoroLeaveWaitCnt) == 4, "expected HrScreenStatusSlot::m_SlotZoroLeaveWaitCnt to be size 4");
static_assert(sizeof(HrScreenStatusSlot::m_SprLchSoundID) == 4, "expected HrScreenStatusSlot::m_SprLchSoundID to be size 4");
static_assert(sizeof(HrScreenStatusSlot::flaglmode) == 4, "expected HrScreenStatusSlot::flaglmode to be size 4");
static_assert(sizeof(HrScreenStatusSlot) == 0x28, "expected HrScreenStatusSlot to be size 0x28");

// [Structure] struct Rectf
struct Rectf
{
public:
	/// Struct member variables

	// <float left, offset 0x0>
	float left = 0;

	// <float top, offset 0x4>
	float top = 0;

	// <float right, offset 0x8>
	float right = 0;

	// <float bottom, offset 0xc>
	float bottom = 0;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct Rectf [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(Rectf& InObject)
	{
		left = InObject.left;
		top = InObject.top;
		right = InObject.right;
		bottom = InObject.bottom;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Rectf>("Rectf")
			.addFunction("__tostring", &Rectf::ToString)
			.addFunction("GetPtrAddr", &Rectf::GetPtrAddr)
			.addProperty("left", &Rectf::left)
			.addProperty("top", &Rectf::top)
			.addProperty("right", &Rectf::right)
			.addProperty("bottom", &Rectf::bottom)
		.endClass();
	}
#endif
};
static_assert(sizeof(Rectf::left) == 4, "expected Rectf::left to be size 4");
static_assert(sizeof(Rectf::top) == 4, "expected Rectf::top to be size 4");
static_assert(sizeof(Rectf::right) == 4, "expected Rectf::right to be size 4");
static_assert(sizeof(Rectf::bottom) == 4, "expected Rectf::bottom to be size 4");
static_assert(sizeof(Rectf) == 0x10, "expected Rectf to be size 0x10");

// enum GFONTTYPE_NUM
enum GFONTTYPE_NUM : uint32_t
{
	// <GFONT_R = 0x0>
	GFONT_R = 0,

	// <GFONT_S = 0x1>
	GFONT_S = 1,

	// <GFONT_S_EXPLANATION = 0x2>
	GFONT_S_EXPLANATION = 2,

	// <GFONT_NUM_MAX = 0x3>
	GFONT_NUM_MAX = 3

};

// [Structure] struct Vec2
struct Vec2
{
public:
	/// Struct member variables

	// <float x, offset 0x0>
	float x = 0;

	// <float y, offset 0x4>
	float y = 0;

	/// 0 Functions

	/// Meta

	Vec2() { x = 0; y = 0; }
	Vec2(float inX, float inY) { x = inX; y = inY; }
	float Size() const { return sqrtf(x*x + y*y); }
	float SizeSquared() const { return x*x + y*y; }
	std::string ToString() const { std::stringstream stream; stream << "struct Vec2 [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(Vec2& InObject)
	{
		x = InObject.x;
		y = InObject.y;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Vec2>("Vec2")
			.addFunction("__tostring", &Vec2::ToString)
			.addFunction("GetPtrAddr", &Vec2::GetPtrAddr)
			.addProperty("x", &Vec2::x)
			.addProperty("y", &Vec2::y)
			.addConstructor<void (*) (void)>()
			.addConstructor<void (*) (float, float)>()
			.addFunction("SizeSquared", &Vec2::SizeSquared)
			.addFunction("Size", &Vec2::Size)
		.endClass();
	}
#endif
};
static_assert(sizeof(Vec2::x) == 4, "expected Vec2::x to be size 4");
static_assert(sizeof(Vec2::y) == 4, "expected Vec2::y to be size 4");
static_assert(sizeof(Vec2) == 0x8, "expected Vec2 to be size 0x8");

// [Structure] struct hPOINT
struct hPOINT
{
public:
	/// Struct member variables

	// <float x, offset 0x0>
	float x = 0;

	// <float y, offset 0x4>
	float y = 0;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct hPOINT [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(hPOINT& InObject)
	{
		x = InObject.x;
		y = InObject.y;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<hPOINT>("hPOINT")
			.addFunction("__tostring", &hPOINT::ToString)
			.addFunction("GetPtrAddr", &hPOINT::GetPtrAddr)
			.addProperty("x", &hPOINT::x)
			.addProperty("y", &hPOINT::y)
		.endClass();
	}
#endif
};
static_assert(sizeof(hPOINT::x) == 4, "expected hPOINT::x to be size 4");
static_assert(sizeof(hPOINT::y) == 4, "expected hPOINT::y to be size 4");
static_assert(sizeof(hPOINT) == 0x8, "expected hPOINT to be size 0x8");

// [Structure] class CNYDrawStringBase
class CNYDrawStringBase
{
public:
	// enum CNYDrawStringBase::ALIGNMENT_TYPE_BASE
	enum ALIGNMENT_TYPE_BASE : uint32_t
	{
		// <ALIGNMENT_TYPE_LEFT = 0x0>
		ALIGNMENT_TYPE_LEFT = 0,

		// <ALIGNMENT_TYPE_MIDDLE = 0x1>
		ALIGNMENT_TYPE_MIDDLE = 1,

		// <ALIGNMENT_TYPE_RIGHT = 0x2>
		ALIGNMENT_TYPE_RIGHT = 2

	};

	/// Struct member variables

	// <void* (* field_0)[0x1], offset 0x0>
	void* (* field_0)[0x1];

	// <int32_t m_mesHandle, offset 0x4>
	int32_t m_mesHandle = 0;

	// <char* m_pstr, offset 0x8>
	char* m_pstr = nullptr;

	// <struct Vec2 m_pos, offset 0xc>
	struct Vec2 m_pos;

	// <struct Vec2 m_realPos, offset 0x14>
	struct Vec2 m_realPos;

	// <uint32_t m_color, offset 0x1c>
	uint32_t m_color = 0;

	// <enum GFONTTYPE_NUM m_fontType, offset 0x20>
	enum GFONTTYPE_NUM m_fontType;

	// <float m_fontSize, offset 0x24>
	float m_fontSize = 0;

	// <enum CNYDrawStringBase::ALIGNMENT_TYPE_BASE m_alignment, offset 0x28>
	enum CNYDrawStringBase::ALIGNMENT_TYPE_BASE m_alignment;

	// <uint8_t m_noGSYSMES, offset 0x2c>
	uint8_t m_noGSYSMES = 0;

	// <uint8_t m_beUpdate, offset 0x2d>
	uint8_t m_beUpdate = 0;

	// <Unidentified data segment, offset 0x2e>
private:
	char _UnidentifiedData_46[2];

public:
	// <struct Rectf m_WindowRect, offset 0x30>
	struct Rectf m_WindowRect;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class CNYDrawStringBase [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(CNYDrawStringBase& InObject)
	{
		m_mesHandle = InObject.m_mesHandle;
		m_pstr = InObject.m_pstr;
		m_pos = InObject.m_pos;
		m_realPos = InObject.m_realPos;
		m_color = InObject.m_color;
		m_fontType = InObject.m_fontType;
		m_fontSize = InObject.m_fontSize;
		m_alignment = InObject.m_alignment;
		m_noGSYSMES = InObject.m_noGSYSMES;
		m_beUpdate = InObject.m_beUpdate;
		m_WindowRect = InObject.m_WindowRect;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CNYDrawStringBase>("CNYDrawStringBase")
			.addFunction("__tostring", &CNYDrawStringBase::ToString)
			.addFunction("GetPtrAddr", &CNYDrawStringBase::GetPtrAddr)
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &CNYDrawStringBase::field_0)
			.addProperty("m_mesHandle", &CNYDrawStringBase::m_mesHandle)
			// char* type not supported in LuaBridge
			//.addProperty("m_pstr", &CNYDrawStringBase::m_pstr)
			.addProperty("m_pos", &CNYDrawStringBase::m_pos)
			.addProperty("m_realPos", &CNYDrawStringBase::m_realPos)
			.addProperty("m_color", &CNYDrawStringBase::m_color)
			.addProperty("m_fontType", &CNYDrawStringBase::m_fontType)
			.addProperty("m_fontSize", &CNYDrawStringBase::m_fontSize)
			.addProperty("m_alignment", &CNYDrawStringBase::m_alignment)
			.addProperty("m_noGSYSMES", &CNYDrawStringBase::m_noGSYSMES)
			.addProperty("m_beUpdate", &CNYDrawStringBase::m_beUpdate)
			.addProperty("m_WindowRect", &CNYDrawStringBase::m_WindowRect)
		.endClass();
	}
#endif
};
static_assert(sizeof(CNYDrawStringBase::field_0) == 4, "expected CNYDrawStringBase::field_0 to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_mesHandle) == 4, "expected CNYDrawStringBase::m_mesHandle to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_pstr) == 4, "expected CNYDrawStringBase::m_pstr to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_pos) == 8, "expected CNYDrawStringBase::m_pos to be size 8");
static_assert(sizeof(CNYDrawStringBase::m_realPos) == 8, "expected CNYDrawStringBase::m_realPos to be size 8");
static_assert(sizeof(CNYDrawStringBase::m_color) == 4, "expected CNYDrawStringBase::m_color to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_fontType) == 4, "expected CNYDrawStringBase::m_fontType to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_fontSize) == 4, "expected CNYDrawStringBase::m_fontSize to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_alignment) == 4, "expected CNYDrawStringBase::m_alignment to be size 4");
static_assert(sizeof(CNYDrawStringBase::m_noGSYSMES) == 1, "expected CNYDrawStringBase::m_noGSYSMES to be size 1");
static_assert(sizeof(CNYDrawStringBase::m_beUpdate) == 1, "expected CNYDrawStringBase::m_beUpdate to be size 1");
static_assert(sizeof(CNYDrawStringBase::m_WindowRect) == 16, "expected CNYDrawStringBase::m_WindowRect to be size 16");
static_assert(sizeof(CNYDrawStringBase) == 0x40, "expected CNYDrawStringBase to be size 0x40");

// [Structure] class NYDrawString
class NYDrawString : public CNYDrawStringBase
{
public:
	// enum NYDrawString::ALIGNMENT_TYPE
	enum ALIGNMENT_TYPE : uint32_t
	{
		// <ALIGNMENT_TYPE_LEFT = 0x0>
		ALIGNMENT_TYPE_LEFT = 0,

		// <ALIGNMENT_TYPE_MIDDLE = 0x1>
		ALIGNMENT_TYPE_MIDDLE = 1,

		// <ALIGNMENT_TYPE_RIGHT = 0x2>
		ALIGNMENT_TYPE_RIGHT = 2

	};

	/// Struct member variables

	// <class CNYDrawStringBase field_0, offset 0x0>
	// class CNYDrawStringBase Super;

	// <char m_str[0x40], offset 0x40>
	char m_str[64];

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class NYDrawString [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(NYDrawString& InObject)
	{
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<NYDrawString, CNYDrawStringBase>("NYDrawString")
			.addFunction("__tostring", &NYDrawString::ToString)
			.addFunction("GetPtrAddr", &NYDrawString::GetPtrAddr)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_str", &NYDrawString::m_str)
		.endClass();
	}
#endif
};
static_assert(sizeof(NYDrawString::m_str) == 64, "expected NYDrawString::m_str to be size 64");
static_assert(sizeof(NYDrawString) == 0x80, "expected NYDrawString to be size 0x80");

// enum PJ_QUICK_MOVE_TARGET
enum PJ_QUICK_MOVE_TARGET : uint32_t
{
	// <PJ_QUICK_MOVE_TARGET_NONE = 0xffffffffffffffff>
	PJ_QUICK_MOVE_TARGET_NONE = UINT32_MAX,

	// <PJ_QUICK_MOVE_TARGET_MOTEL = 0x0>
	PJ_QUICK_MOVE_TARGET_MOTEL = 0,

	// <PJ_QUICK_MOVE_TARGET_NAOMIS_LAB = 0x1>
	PJ_QUICK_MOVE_TARGET_NAOMIS_LAB = 1,

	// <PJ_QUICK_MOVE_TARGET_AIRPORT51 = 0x2>
	PJ_QUICK_MOVE_TARGET_AIRPORT51 = 2,

	// <PJ_QUICK_MOVE_TARGET_TRAINING_GYM = 0x3>
	PJ_QUICK_MOVE_TARGET_TRAINING_GYM = 3,

	// <PJ_QUICK_MOVE_TARGET_THUNDER_RYU = 0x4>
	PJ_QUICK_MOVE_TARGET_THUNDER_RYU = 4,

	// <PJ_QUICK_MOVE_TARGET_BUG_BUSTER = 0x5>
	PJ_QUICK_MOVE_TARGET_BUG_BUSTER = 5,

	// <PJ_QUICK_MOVE_TARGET_PIPE_FITTER = 0x6>
	PJ_QUICK_MOVE_TARGET_PIPE_FITTER = 6,

	// <PJ_QUICK_MOVE_TARGET_COCONUT_COLLECTOR = 0x7>
	PJ_QUICK_MOVE_TARGET_COCONUT_COLLECTOR = 7,

	// <PJ_QUICK_MOVE_TARGET_SPACE_GARBAGE = 0x8>
	PJ_QUICK_MOVE_TARGET_SPACE_GARBAGE = 8,

	// <PJ_QUICK_MOVE_TARGET_PIZZA_DELIVER = 0x9>
	PJ_QUICK_MOVE_TARGET_PIZZA_DELIVER = 9,

	// <PJ_QUICK_MOVE_TARGET_TILE_PUZZLE = 0xa>
	PJ_QUICK_MOVE_TARGET_TILE_PUZZLE = 10,

	// <PJ_QUICK_MOVE_TARGET_STEAK_HOUSE = 0xb>
	PJ_QUICK_MOVE_TARGET_STEAK_HOUSE = 11,

	// <PJ_QUICK_MOVE_TARGET_BACK_ALLEY_1 = 0xc>
	PJ_QUICK_MOVE_TARGET_BACK_ALLEY_1 = 12,

	// <PJ_QUICK_MOVE_TARGET_BACK_ALLEY_2 = 0xd>
	PJ_QUICK_MOVE_TARGET_BACK_ALLEY_2 = 13,

	// <PJ_QUICK_MOVE_TARGET_CONSTRUCTION_FIELD_1 = 0xe>
	PJ_QUICK_MOVE_TARGET_CONSTRUCTION_FIELD_1 = 14,

	// <PJ_QUICK_MOVE_TARGET_CONSTRUCTION_FIELD_2 = 0xf>
	PJ_QUICK_MOVE_TARGET_CONSTRUCTION_FIELD_2 = 15,

	// <PJ_QUICK_MOVE_TARGET_UNDER_ELEVATED_1 = 0x10>
	PJ_QUICK_MOVE_TARGET_UNDER_ELEVATED_1 = 16,

	// <PJ_QUICK_MOVE_TARGET_UNDER_ELEVATED_2 = 0x11>
	PJ_QUICK_MOVE_TARGET_UNDER_ELEVATED_2 = 17,

	// <PJ_QUICK_MOVE_TARGET_RESTAURANT_1 = 0x12>
	PJ_QUICK_MOVE_TARGET_RESTAURANT_1 = 18,

	// <PJ_QUICK_MOVE_TARGET_RESTAURANT_2 = 0x13>
	PJ_QUICK_MOVE_TARGET_RESTAURANT_2 = 19,

	// <PJ_QUICK_MOVE_TARGET_BAR_1 = 0x14>
	PJ_QUICK_MOVE_TARGET_BAR_1 = 20,

	// <PJ_QUICK_MOVE_TARGET_BAR_2 = 0x15>
	PJ_QUICK_MOVE_TARGET_BAR_2 = 21,

	// <PJ_QUICK_MOVE_TARGET_MAX = 0x16>
	PJ_QUICK_MOVE_TARGET_MAX = 22

};

// [Structure] class HrMap
class HrMap
{
public:
	// enum HrMap::ICON_TYPE
	enum ICON_TYPE : uint32_t
	{
		// <ICON_TYPE_PC = 0x0>
		ICON_TYPE_PC = 0,

		// <ICON_TYPE_ENEMY = 0x1>
		ICON_TYPE_ENEMY = 1,

		// <ICON_TYPE_BOSS = 0x2>
		ICON_TYPE_BOSS = 2,

		// <ICON_TYPE_SAVE_POINT = 0x3>
		ICON_TYPE_SAVE_POINT = 3,

		// <ICON_TYPE_ACCESS_POINT_ON = 0x4>
		ICON_TYPE_ACCESS_POINT_ON = 4,

		// <ICON_TYPE_ACCESS_POINT_OFF = 0x5>
		ICON_TYPE_ACCESS_POINT_OFF = 5,

		// <ICON_TYPE_BOSS_POINT = 0x6>
		ICON_TYPE_BOSS_POINT = 6,

		// <ICON_TYPE_TREASURE_BOX = 0x7>
		ICON_TYPE_TREASURE_BOX = 7,

		// <ICON_TYPE_SNEAK_ENEMY = 0x8>
		ICON_TYPE_SNEAK_ENEMY = 8,

		// <ICON_TYPE_SHOOTER_ENEMY = 0x9>
		ICON_TYPE_SHOOTER_ENEMY = 9,

		// <ICON_TYPE_BIKE = 0xa>
		ICON_TYPE_BIKE = 10,

		// <ICON_TYPE_MOTEL = 0xb>
		ICON_TYPE_MOTEL = 11,

		// <ICON_TYPE_AIRPORT51 = 0xc>
		ICON_TYPE_AIRPORT51 = 12,

		// <ICON_TYPE_NAOMIS_LAB = 0xd>
		ICON_TYPE_NAOMIS_LAB = 13,

		// <ICON_TYPE_TRAINING_GYM = 0xe>
		ICON_TYPE_TRAINING_GYM = 14,

		// <ICON_TYPE_THUNDER_RYU = 0xf>
		ICON_TYPE_THUNDER_RYU = 15,

		// <ICON_TYPE_JOB_MISSION = 0x10>
		ICON_TYPE_JOB_MISSION = 16,

		// <ICON_TYPE_KILL_MISSION = 0x11>
		ICON_TYPE_KILL_MISSION = 17,

		// <ICON_TYPE_MAX = 0x12>
		ICON_TYPE_MAX = 18

	};

	// [Structure] struct HrMap::DrawData
	struct DrawData
	{
	public:
		/// Struct member variables

		// <enum HrMap::ICON_TYPE m_iconType, offset 0x0>
		enum ICON_TYPE m_iconType;

		// <struct Vec m_pos3D, offset 0x4>
		struct Vec m_pos3D;

		// <struct Vec2 m_pos, offset 0x10>
		struct Vec2 m_pos;

		// <struct Vec2 m_wh, offset 0x18>
		struct Vec2 m_wh;

		// <float m_rotAngle, offset 0x20>
		float m_rotAngle = 0;

		// <float m_scale, offset 0x24>
		float m_scale = 0;

		// <struct tagGHMR_TEX* m_pTex, offset 0x28>
		struct tagGHMR_TEX* m_pTex = nullptr;

		// <uint32_t m_color, offset 0x2c>
		uint32_t m_color = 0;

		/// 0 Functions

		/// Meta

		std::string ToString() const { std::stringstream stream; stream << "struct HrMap::DrawData [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
		int GetPtrAddr() const { return (int)this; }
		void CopyFrom(HrMap::DrawData& InObject)
		{
			m_iconType = InObject.m_iconType;
			m_pos3D = InObject.m_pos3D;
			m_pos = InObject.m_pos;
			m_wh = InObject.m_wh;
			m_rotAngle = InObject.m_rotAngle;
			m_scale = InObject.m_scale;
			m_pTex = InObject.m_pTex;
			m_color = InObject.m_color;
		}
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<DrawData>("HrMap_DrawData")
				.addFunction("__tostring", &HrMap::DrawData::ToString)
				.addFunction("GetPtrAddr", &HrMap::DrawData::GetPtrAddr)
				.addProperty("m_iconType", &HrMap::DrawData::m_iconType)
				.addProperty("m_pos3D", &HrMap::DrawData::m_pos3D)
				.addProperty("m_pos", &HrMap::DrawData::m_pos)
				.addProperty("m_wh", &HrMap::DrawData::m_wh)
				.addProperty("m_rotAngle", &HrMap::DrawData::m_rotAngle)
				.addProperty("m_scale", &HrMap::DrawData::m_scale)
				.addProperty("m_pTex", &HrMap::DrawData::m_pTex)
				.addProperty("m_color", &HrMap::DrawData::m_color)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(HrMap::DrawData::m_iconType) == 4, "expected HrMap::DrawData::m_iconType to be size 4");
	static_assert(sizeof(HrMap::DrawData::m_pos3D) == 12, "expected HrMap::DrawData::m_pos3D to be size 12");
	static_assert(sizeof(HrMap::DrawData::m_pos) == 8, "expected HrMap::DrawData::m_pos to be size 8");
	static_assert(sizeof(HrMap::DrawData::m_wh) == 8, "expected HrMap::DrawData::m_wh to be size 8");
	static_assert(sizeof(HrMap::DrawData::m_rotAngle) == 4, "expected HrMap::DrawData::m_rotAngle to be size 4");
	static_assert(sizeof(HrMap::DrawData::m_scale) == 4, "expected HrMap::DrawData::m_scale to be size 4");
	static_assert(sizeof(HrMap::DrawData::m_pTex) == 4, "expected HrMap::DrawData::m_pTex to be size 4");
	static_assert(sizeof(HrMap::DrawData::m_color) == 4, "expected HrMap::DrawData::m_color to be size 4");
	static_assert(sizeof(HrMap::DrawData) == 0x30, "expected HrMap::DrawData to be size 0x30");

	// enum HrMap::SCALE_TYPE
	enum SCALE_TYPE : uint32_t
	{
		// <SCALE_TYPE_SMALL = 0x0>
		SCALE_TYPE_SMALL = 0,

		// <SCALE_TYPE_MEDIUM = 0x1>
		SCALE_TYPE_MEDIUM = 1,

		// <SCALE_TYPE_LARGE = 0x2>
		SCALE_TYPE_LARGE = 2,

		// <SCALE_TYPE_ALL = 0x3>
		SCALE_TYPE_ALL = 3

	};

	// enum HrMap::TYPE
	enum TYPE : uint32_t
	{
		// <TYPE_PREV = 0x0>
		TYPE_PREV = 0,

		// <TYPE_VIEW = 0x1>
		TYPE_VIEW = 1,

		// <TYPE_MINI = 0x2>
		TYPE_MINI = 2,

		// <TYPE_MINI_ROT = 0x3>
		TYPE_MINI_ROT = 3,

		// <TYPE_MINI_TILTED = 0x4>
		TYPE_MINI_TILTED = 4,

		// <TYPE_MINI_ROT_TILTED = 0x5>
		TYPE_MINI_ROT_TILTED = 5,

		// <TYPE_MAX = 0x6>
		TYPE_MAX = 6

	};

	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[7076];

public:
	// <uint8_t FlashIconSEFlag, offset 0x1ba4>
	uint8_t FlashIconSEFlag = 0;

	// <Unidentified data segment, offset 0x1ba5>
private:
	char _UnidentifiedData_7077[3];

public:
	// <uint8_t FlashATMicon, offset 0x1ba8>
	uint8_t FlashATMicon = 0;

	// <Unidentified data segment, offset 0x1ba9>
private:
	char _UnidentifiedData_7081[763];

public:
	/// 31 Functions

	// [Function] int32_t __convention("thiscall") HrMap::SetIconPos(class HrMap* const this, struct Vec& arg2) [?SetIconPos@HrMap@@QAEHABUVec@@@Z]
	typedef int32_t(__thiscall* _SetIconPos_HrMap__QAEHABUVec___Z)(class HrMap* const thisPtr, struct Vec& arg2);
	int32_t SetIconPos(struct Vec& arg2)
	{
		_SetIconPos_HrMap__QAEHABUVec___Z mFunc = (_SetIconPos_HrMap__QAEHABUVec___Z)(GameModule + 0xa21e0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrMap::ClearIcon(class HrMap* const this, int32_t arg2) [?ClearIcon@HrMap@@QAEXH@Z]
	typedef void(__thiscall* _ClearIcon_HrMap__QAEXH_Z)(class HrMap* const thisPtr, int32_t arg2);
	void ClearIcon(int32_t arg2)
	{
		_ClearIcon_HrMap__QAEXH_Z mFunc = (_ClearIcon_HrMap__QAEXH_Z)(GameModule + 0xa21f0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrMap::SetFlashATMicon(class HrMap* const this, uint8_t arg2) [?SetFlashATMicon@HrMap@@QAEX_N@Z]
	typedef void(__thiscall* _SetFlashATMicon_HrMap__QAEX_N_Z)(class HrMap* const thisPtr, uint8_t arg2);
	void SetFlashATMicon(uint8_t arg2)
	{
		_SetFlashATMicon_HrMap__QAEX_N_Z mFunc = (_SetFlashATMicon_HrMap__QAEX_N_Z)(GameModule + 0xa2200);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::IsMiniMap(class HrMap* const this) [?IsMiniMap@HrMap@@QBE_NXZ]
	typedef uint8_t(__thiscall* _IsMiniMap_HrMap__QBE_NXZ)(class HrMap* const thisPtr);
	uint8_t IsMiniMap()
	{
		_IsMiniMap_HrMap__QBE_NXZ mFunc = (_IsMiniMap_HrMap__QBE_NXZ)(GameModule + 0xacdf0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") HrMap::GetWidth3D(class HrMap* const this) [?GetWidth3D@HrMap@@QBEMXZ]
	typedef float(__thiscall* _GetWidth3D_HrMap__QBEMXZ)(class HrMap* const thisPtr);
	float GetWidth3D()
	{
		_GetWidth3D_HrMap__QBEMXZ mFunc = (_GetWidth3D_HrMap__QBEMXZ)(GameModule + 0xace00);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") HrMap::GetHeight3D(class HrMap* const this) [?GetHeight3D@HrMap@@QBEMXZ]
	typedef float(__thiscall* _GetHeight3D_HrMap__QBEMXZ)(class HrMap* const thisPtr);
	float GetHeight3D()
	{
		_GetHeight3D_HrMap__QBEMXZ mFunc = (_GetHeight3D_HrMap__QBEMXZ)(GameModule + 0xace30);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::SetScissorRect(class HrMap* const this, float arg2, float arg3, float arg4, float arg5) [?SetScissorRect@HrMap@@QAEXMMMM@Z]
	typedef void(__thiscall* _SetScissorRect_HrMap__QAEXMMMM_Z)(class HrMap* const thisPtr, float arg2, float arg3, float arg4, float arg5);
	void SetScissorRect(float arg2, float arg3, float arg4, float arg5)
	{
		_SetScissorRect_HrMap__QAEXMMMM_Z mFunc = (_SetScissorRect_HrMap__QAEXMMMM_Z)(GameModule + 0xace60);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] struct Vec __convention("thiscall") HrMap::GetMapOffset(class HrMap* const this) [?GetMapOffset@HrMap@@IAE?BUVec@@XZ]
	typedef struct Vec(__thiscall* _GetMapOffset_HrMap__IAEBUVec__XZ)(class HrMap* const thisPtr);
	struct Vec GetMapOffset()
	{
		_GetMapOffset_HrMap__IAEBUVec__XZ mFunc = (_GetMapOffset_HrMap__IAEBUVec__XZ)(GameModule + 0xace90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::IsDied(class HrMap* const this, class mHRChara* Character) [?IsDied@HrMap@@IAE_NPAVmHRChara@@@Z]
	typedef uint8_t(__thiscall* _IsDied_HrMap__IAE_NPAVmHRChara___Z)(class HrMap* const thisPtr, class mHRChara* Character);
	uint8_t IsDied(class mHRChara* Character)
	{
		_IsDied_HrMap__IAE_NPAVmHRChara___Z mFunc = (_IsDied_HrMap__IAE_NPAVmHRChara___Z)(GameModule + 0xaceb0);
		return mFunc(this, Character);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::GetIsDisp(class HrMap* const this) [?GetIsDisp@HrMap@@QAE_NXZ]
	typedef uint8_t(__thiscall* _GetIsDisp_HrMap__QAE_NXZ)(class HrMap* const thisPtr);
	uint8_t GetIsDisp()
	{
		_GetIsDisp_HrMap__QAE_NXZ mFunc = (_GetIsDisp_HrMap__QAE_NXZ)(GameModule + 0xafa70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::SetFlashIconSE(class HrMap* const this, uint8_t arg2) [?SetFlashIconSE@HrMap@@QAEX_N@Z]
	typedef void(__thiscall* _SetFlashIconSE_HrMap__QAEX_N_Z)(class HrMap* const thisPtr, uint8_t arg2);
	void SetFlashIconSE(uint8_t arg2)
	{
		_SetFlashIconSE_HrMap__QAEX_N_Z mFunc = (_SetFlashIconSE_HrMap__QAEX_N_Z)(GameModule + 0xba4a0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::IsInitialized(class HrMap* const this) [?IsInitialized@HrMap@@QAE_NXZ]
	typedef uint8_t(__thiscall* _IsInitialized_HrMap__QAE_NXZ)(class HrMap* const thisPtr);
	uint8_t IsInitialized()
	{
		_IsInitialized_HrMap__QAE_NXZ mFunc = (_IsInitialized_HrMap__QAE_NXZ)(GameModule + 0xd3e30);
		return mFunc(this);
	}
	// [Function] struct tagGHMR_TEX __convention("thiscall") HrMap::GetMapFrameTex(class HrMap* const this) [?GetMapFrameTex@HrMap@@QAE?AUtagGHMR_TEX@@XZ]
	typedef struct tagGHMR_TEX(__thiscall* _GetMapFrameTex_HrMap__QAEAUtagGHMR_TEX__XZ)(class HrMap* const thisPtr);
	struct tagGHMR_TEX GetMapFrameTex()
	{
		_GetMapFrameTex_HrMap__QAEAUtagGHMR_TEX__XZ mFunc = (_GetMapFrameTex_HrMap__QAEAUtagGHMR_TEX__XZ)(GameModule + 0xd3e40);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::InitTextMessage(class HrMap* const this) [?InitTextMessage@HrMap@@IAEXXZ]
	typedef void(__thiscall* _InitTextMessage_HrMap__IAEXXZ)(class HrMap* const thisPtr);
	void InitTextMessage()
	{
		_InitTextMessage_HrMap__IAEXXZ mFunc = (_InitTextMessage_HrMap__IAEXXZ)(GameModule + 0x450b80);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::IsOneFloor(class HrMap* const this) [?IsOneFloor@HrMap@@IAE_NXZ]
	typedef uint8_t(__thiscall* _IsOneFloor_HrMap__IAE_NXZ)(class HrMap* const thisPtr);
	uint8_t IsOneFloor()
	{
		_IsOneFloor_HrMap__IAE_NXZ mFunc = (_IsOneFloor_HrMap__IAE_NXZ)(GameModule + 0x450cc0);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") HrMap::GetIconFloor(class HrMap* const this, float arg2) [?GetIconFloor@HrMap@@IAEHM@Z]
	typedef int32_t(__thiscall* _GetIconFloor_HrMap__IAEHM_Z)(class HrMap* const thisPtr, float arg2);
	int32_t GetIconFloor(float arg2)
	{
		_GetIconFloor_HrMap__IAEHM_Z mFunc = (_GetIconFloor_HrMap__IAEHM_Z)(GameModule + 0x450cf0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::IsNowFloor(class HrMap* const this, float arg2) [?IsNowFloor@HrMap@@IAE_NM@Z]
	typedef uint8_t(__thiscall* _IsNowFloor_HrMap__IAE_NM_Z)(class HrMap* const thisPtr, float arg2);
	uint8_t IsNowFloor(float arg2)
	{
		_IsNowFloor_HrMap__IAE_NM_Z mFunc = (_IsNowFloor_HrMap__IAE_NM_Z)(GameModule + 0x450d80);
		return mFunc(this, arg2);
	}
	// [Function] enum PJ_QUICK_MOVE_TARGET __convention("thiscall") HrMap::IconDrawDataToQMT(class HrMap* const this, struct HrMap::DrawData& arg2) [?IconDrawDataToQMT@HrMap@@IAE?AW4PJ_QUICK_MOVE_TARGET@@ABUDrawData@1@@Z]
	typedef enum PJ_QUICK_MOVE_TARGET(__thiscall* _IconDrawDataToQMT_HrMap__IAEAW4PJ_QUICK_MOVE_TARGET__ABUDrawData_1__Z)(class HrMap* const thisPtr, struct HrMap::DrawData& arg2);
	/* enum PJ_QUICK_MOVE_TARGET */ uint32_t IconDrawDataToQMT(struct HrMap::DrawData& arg2)
	{
		_IconDrawDataToQMT_HrMap__IAEAW4PJ_QUICK_MOVE_TARGET__ABUDrawData_1__Z mFunc = (_IconDrawDataToQMT_HrMap__IAEAW4PJ_QUICK_MOVE_TARGET__ABUDrawData_1__Z)(GameModule + 0x450e20);
		return (uint32_t)mFunc(this, arg2);
	}
	// [Function] class NYDrawString* __convention("thiscall") HrMap::AddDrawString(class HrMap* const this, char const* arg2, struct Vec2& arg3, uint32_t arg4, enum GFONTTYPE_NUM arg5, enum NYDrawString::ALIGNMENT_TYPE arg6) [?AddDrawString@HrMap@@IAEPAVNYDrawString@@PBDABUVec2@@IW4GFONTTYPE_NUM@@W4ALIGNMENT_TYPE@2@@Z]
	typedef class NYDrawString*(__thiscall* _AddDrawString_HrMap__IAEPAVNYDrawString__PBDABUVec2__IW4GFONTTYPE_NUM__W4ALIGNMENT_TYPE_2__Z)(class HrMap* const thisPtr, char const* arg2, struct Vec2& arg3, uint32_t arg4, enum GFONTTYPE_NUM arg5, enum NYDrawString::ALIGNMENT_TYPE arg6);
	class NYDrawString* AddDrawString(std::string arg2, struct Vec2& arg3, uint32_t arg4, /* enum GFONTTYPE_NUM */ uint32_t arg5, /* enum NYDrawString::ALIGNMENT_TYPE */ uint32_t arg6)
	{
		char const* arg2_c_str = arg2.c_str();
		_AddDrawString_HrMap__IAEPAVNYDrawString__PBDABUVec2__IW4GFONTTYPE_NUM__W4ALIGNMENT_TYPE_2__Z mFunc = (_AddDrawString_HrMap__IAEPAVNYDrawString__PBDABUVec2__IW4GFONTTYPE_NUM__W4ALIGNMENT_TYPE_2__Z)(GameModule + 0x450ef0);
		return mFunc(this, arg2_c_str, arg3, arg4, (enum GFONTTYPE_NUM)arg5, (enum NYDrawString::ALIGNMENT_TYPE)arg6);
	}
	// [Function] struct tagGHMR_TEX& __convention("thiscall") HrMap::IconType2TexR(class HrMap* const this, enum HrMap::ICON_TYPE arg2) [?IconType2TexR@HrMap@@IAEAAUtagGHMR_TEX@@W4ICON_TYPE@1@@Z]
	typedef struct tagGHMR_TEX&(__thiscall* _IconType2TexR_HrMap__IAEAAUtagGHMR_TEX__W4ICON_TYPE_1__Z)(class HrMap* const thisPtr, enum HrMap::ICON_TYPE arg2);
	// Can't export & pointer 'struct tagGHMR_TEX&' [TypeClass.PointerTypeClass] in LuaBridge
	void IconType2TexR(/* enum HrMap::ICON_TYPE */ uint32_t arg2)
	{
		_IconType2TexR_HrMap__IAEAAUtagGHMR_TEX__W4ICON_TYPE_1__Z mFunc = (_IconType2TexR_HrMap__IAEAAUtagGHMR_TEX__W4ICON_TYPE_1__Z)(GameModule + 0x450fa0);
		mFunc(this, (enum HrMap::ICON_TYPE)arg2);
	}
	// [Function] void __convention("thiscall") HrMap::IconRegistClear(class HrMap* const this) [?IconRegistClear@HrMap@@IAEXXZ]
	typedef void(__thiscall* _IconRegistClear_HrMap__IAEXXZ)(class HrMap* const thisPtr);
	void IconRegistClear()
	{
		_IconRegistClear_HrMap__IAEXXZ mFunc = (_IconRegistClear_HrMap__IAEXXZ)(GameModule + 0x450fd0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::IconRegist(class HrMap* const this, enum HrMap::ICON_TYPE arg2, struct Vec& arg3, float arg4, uint8_t arg5) [?IconRegist@HrMap@@IAEXW4ICON_TYPE@1@ABUVec@@M_N@Z]
	typedef void(__thiscall* _IconRegist_HrMap__IAEXW4ICON_TYPE_1_ABUVec__M_N_Z)(class HrMap* const thisPtr, enum HrMap::ICON_TYPE arg2, struct Vec& arg3, float arg4, uint8_t arg5);
	void IconRegist(/* enum HrMap::ICON_TYPE */ uint32_t arg2, struct Vec& arg3, float arg4, uint8_t arg5)
	{
		_IconRegist_HrMap__IAEXW4ICON_TYPE_1_ABUVec__M_N_Z mFunc = (_IconRegist_HrMap__IAEXW4ICON_TYPE_1_ABUVec__M_N_Z)(GameModule + 0x450ff0);
		return mFunc(this, (enum HrMap::ICON_TYPE)arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") HrMap::IconRegistEventArea(class HrMap* const this) [?IconRegistEventArea@HrMap@@IAEXXZ]
	typedef void(__thiscall* _IconRegistEventArea_HrMap__IAEXXZ)(class HrMap* const thisPtr);
	void IconRegistEventArea()
	{
		_IconRegistEventArea_HrMap__IAEXXZ mFunc = (_IconRegistEventArea_HrMap__IAEXXZ)(GameModule + 0x451400);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::SetScaleType(class HrMap* const this, enum HrMap::SCALE_TYPE arg2) [?SetScaleType@HrMap@@QAEXW4SCALE_TYPE@1@@Z]
	typedef void(__thiscall* _SetScaleType_HrMap__QAEXW4SCALE_TYPE_1__Z)(class HrMap* const thisPtr, enum HrMap::SCALE_TYPE arg2);
	void SetScaleType(/* enum HrMap::SCALE_TYPE */ uint32_t arg2)
	{
		_SetScaleType_HrMap__QAEXW4SCALE_TYPE_1__Z mFunc = (_SetScaleType_HrMap__QAEXW4SCALE_TYPE_1__Z)(GameModule + 0x451570);
		return mFunc(this, (enum HrMap::SCALE_TYPE)arg2);
	}
	// [Function] void __convention("thiscall") HrMap::Leave(class HrMap* const this, uint8_t arg2) [?Leave@HrMap@@QAEX_N@Z]
	typedef void(__thiscall* _Leave_HrMap__QAEX_N_Z)(class HrMap* const thisPtr, uint8_t arg2);
	void Leave(uint8_t arg2)
	{
		_Leave_HrMap__QAEX_N_Z mFunc = (_Leave_HrMap__QAEX_N_Z)(GameModule + 0x451700);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::Appear(class HrMap* const this, enum HrMap::TYPE arg2, enum HrMap::SCALE_TYPE arg3, uint8_t arg4) [?Appear@HrMap@@QAE_NW4TYPE@1@W4SCALE_TYPE@1@_N@Z]
	typedef uint8_t(__thiscall* _Appear_HrMap__QAE_NW4TYPE_1_W4SCALE_TYPE_1__N_Z)(class HrMap* const thisPtr, enum HrMap::TYPE arg2, enum HrMap::SCALE_TYPE arg3, uint8_t arg4);
	uint8_t Appear(/* enum HrMap::TYPE */ uint32_t arg2, /* enum HrMap::SCALE_TYPE */ uint32_t arg3, uint8_t arg4)
	{
		_Appear_HrMap__QAE_NW4TYPE_1_W4SCALE_TYPE_1__N_Z mFunc = (_Appear_HrMap__QAE_NW4TYPE_1_W4SCALE_TYPE_1__N_Z)(GameModule + 0x4517e0);
		return mFunc(this, (enum HrMap::TYPE)arg2, (enum HrMap::SCALE_TYPE)arg3, arg4);
	}
	// [Function] void __convention("thiscall") HrMap::SetType(class HrMap* const this, enum HrMap::TYPE arg2) [?SetType@HrMap@@QAEXW4TYPE@1@@Z]
	typedef void(__thiscall* _SetType_HrMap__QAEXW4TYPE_1__Z)(class HrMap* const thisPtr, enum HrMap::TYPE arg2);
	void SetType(/* enum HrMap::TYPE */ uint32_t arg2)
	{
		_SetType_HrMap__QAEXW4TYPE_1__Z mFunc = (_SetType_HrMap__QAEXW4TYPE_1__Z)(GameModule + 0x4518d0);
		return mFunc(this, (enum HrMap::TYPE)arg2);
	}
	// [Function] void __convention("thiscall") HrMap::RenderProcess(class HrMap* const this) [?RenderProcess@HrMap@@QAEXXZ]
	typedef void(__thiscall* _RenderProcess_HrMap__QAEXXZ)(class HrMap* const thisPtr);
	void RenderProcess()
	{
		_RenderProcess_HrMap__QAEXXZ mFunc = (_RenderProcess_HrMap__QAEXXZ)(GameModule + 0x4519f0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::FrameProcess(class HrMap* const this) [?FrameProcess@HrMap@@QAEXXZ]
	typedef void(__thiscall* _FrameProcess_HrMap__QAEXXZ)(class HrMap* const thisPtr);
	void FrameProcess()
	{
		_FrameProcess_HrMap__QAEXXZ mFunc = (_FrameProcess_HrMap__QAEXXZ)(GameModule + 0x452350);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrMap::Terminate(class HrMap* const this) [?Terminate@HrMap@@QAEXXZ]
	typedef void(__thiscall* _Terminate_HrMap__QAEXXZ)(class HrMap* const thisPtr);
	void Terminate()
	{
		_Terminate_HrMap__QAEXXZ mFunc = (_Terminate_HrMap__QAEXXZ)(GameModule + 0x453ae0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrMap::InitializeStage(class HrMap* const this, class ghmResGroup* arg2, struct Vec& arg3) [?InitializeStage@HrMap@@QAE_NPAVghmResGroup@@ABUVec@@@Z]
	typedef uint8_t(__thiscall* _InitializeStage_HrMap__QAE_NPAVghmResGroup__ABUVec___Z)(class HrMap* const thisPtr, class ghmResGroup* arg2, struct Vec& arg3);
	uint8_t InitializeStage(class ghmResGroup* arg2, struct Vec& arg3)
	{
		_InitializeStage_HrMap__QAE_NPAVghmResGroup__ABUVec___Z mFunc = (_InitializeStage_HrMap__QAE_NPAVghmResGroup__ABUVec___Z)(GameModule + 0x453cd0);
		return mFunc(this, arg2, arg3);
	}
	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrMap [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrMap& InObject)
	{
		FlashIconSEFlag = InObject.FlashIconSEFlag;
		FlashATMicon = InObject.FlashATMicon;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrMap>("HrMap")
			.addFunction("__tostring", &HrMap::ToString)
			.addFunction("GetPtrAddr", &HrMap::GetPtrAddr)
			.addProperty("FlashIconSEFlag", &HrMap::FlashIconSEFlag)
			.addProperty("FlashATMicon", &HrMap::FlashATMicon)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("SetIconPos", &HrMap::SetIconPos)
			.addFunction("ClearIcon", &HrMap::ClearIcon)
			.addFunction("SetFlashATMicon", &HrMap::SetFlashATMicon)
			.addFunction("IsMiniMap", &HrMap::IsMiniMap)
			.addFunction("GetWidth3D", &HrMap::GetWidth3D)
			.addFunction("GetHeight3D", &HrMap::GetHeight3D)
			.addFunction("SetScissorRect", &HrMap::SetScissorRect)
			.addFunction("GetMapOffset", &HrMap::GetMapOffset)
			.addFunction("IsDied", &HrMap::IsDied)
			.addFunction("GetIsDisp", &HrMap::GetIsDisp)
			.addFunction("SetFlashIconSE", &HrMap::SetFlashIconSE)
			.addFunction("IsInitialized", &HrMap::IsInitialized)
			.addFunction("GetMapFrameTex", &HrMap::GetMapFrameTex)
			.addFunction("InitTextMessage", &HrMap::InitTextMessage)
			.addFunction("IsOneFloor", &HrMap::IsOneFloor)
			.addFunction("GetIconFloor", &HrMap::GetIconFloor)
			.addFunction("IsNowFloor", &HrMap::IsNowFloor)
			// Can't export & pointer 'struct HrMap::DrawData&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("IconDrawDataToQMT", &HrMap::IconDrawDataToQMT)
			// Can't export & pointer 'struct Vec2&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("AddDrawString", &HrMap::AddDrawString)
			.addFunction("IconType2TexR", &HrMap::IconType2TexR)
			.addFunction("IconRegistClear", &HrMap::IconRegistClear)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("IconRegist", &HrMap::IconRegist)
			.addFunction("IconRegistEventArea", &HrMap::IconRegistEventArea)
			.addFunction("SetScaleType", &HrMap::SetScaleType)
			.addFunction("Leave", &HrMap::Leave)
			.addFunction("Appear", &HrMap::Appear)
			.addFunction("SetType", &HrMap::SetType)
			.addFunction("RenderProcess", &HrMap::RenderProcess)
			.addFunction("FrameProcess", &HrMap::FrameProcess)
			.addFunction("Terminate", &HrMap::Terminate)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("InitializeStage", &HrMap::InitializeStage)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrMap::FlashIconSEFlag) == 1, "expected HrMap::FlashIconSEFlag to be size 1");
static_assert(sizeof(HrMap::FlashATMicon) == 1, "expected HrMap::FlashATMicon to be size 1");
static_assert(sizeof(HrMap) == 0x1ea4, "expected HrMap to be size 0x1ea4");

// [Structure] class NYPhase
class NYPhase
{
public:
	/// Struct member variables

	// <int32_t m_phase, offset 0x0>
	int32_t m_phase = 0;

	// <float m_frame, offset 0x4>
	float m_frame = 0;

	// <float m_frameMax, offset 0x8>
	float m_frameMax = 0;

	// <uint8_t m_useNext, offset 0xc>
	uint8_t m_useNext = 0;

	// <Unidentified data segment, offset 0xd>
private:
	char _UnidentifiedData_13[3];

public:
	// <int32_t m_nextPhase, offset 0x10>
	int32_t m_nextPhase = 0;

	// <float m_nextFrame, offset 0x14>
	float m_nextFrame = 0;

	// <float m_nextFrameMax, offset 0x18>
	float m_nextFrameMax = 0;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class NYPhase [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(NYPhase& InObject)
	{
		m_phase = InObject.m_phase;
		m_frame = InObject.m_frame;
		m_frameMax = InObject.m_frameMax;
		m_useNext = InObject.m_useNext;
		m_nextPhase = InObject.m_nextPhase;
		m_nextFrame = InObject.m_nextFrame;
		m_nextFrameMax = InObject.m_nextFrameMax;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<NYPhase>("NYPhase")
			.addFunction("__tostring", &NYPhase::ToString)
			.addFunction("GetPtrAddr", &NYPhase::GetPtrAddr)
			.addProperty("m_phase", &NYPhase::m_phase)
			.addProperty("m_frame", &NYPhase::m_frame)
			.addProperty("m_frameMax", &NYPhase::m_frameMax)
			.addProperty("m_useNext", &NYPhase::m_useNext)
			.addProperty("m_nextPhase", &NYPhase::m_nextPhase)
			.addProperty("m_nextFrame", &NYPhase::m_nextFrame)
			.addProperty("m_nextFrameMax", &NYPhase::m_nextFrameMax)
		.endClass();
	}
#endif
};
static_assert(sizeof(NYPhase::m_phase) == 4, "expected NYPhase::m_phase to be size 4");
static_assert(sizeof(NYPhase::m_frame) == 4, "expected NYPhase::m_frame to be size 4");
static_assert(sizeof(NYPhase::m_frameMax) == 4, "expected NYPhase::m_frameMax to be size 4");
static_assert(sizeof(NYPhase::m_useNext) == 1, "expected NYPhase::m_useNext to be size 1");
static_assert(sizeof(NYPhase::m_nextPhase) == 4, "expected NYPhase::m_nextPhase to be size 4");
static_assert(sizeof(NYPhase::m_nextFrame) == 4, "expected NYPhase::m_nextFrame to be size 4");
static_assert(sizeof(NYPhase::m_nextFrameMax) == 4, "expected NYPhase::m_nextFrameMax to be size 4");
static_assert(sizeof(NYPhase) == 0x1c, "expected NYPhase to be size 0x1c");

// [Structure] class CHrHUDBase
class CHrHUDBase
{
public:
	/// Struct member variables

	// <void* (* field_0)[0x8], offset 0x0>
	void* (* field_0)[0x8];

	// <void (* m_pPhaseProc[0x6][0x2])(CHrHUDBase* const this), offset 0x4>
	void (* m_pPhaseProc[0x6][0x2])(CHrHUDBase* const ThisPtr);

	// <uint8_t m_bHide, offset 0x34>
	uint8_t m_bHide = 0;

	// <Unidentified data segment, offset 0x35>
private:
	char _UnidentifiedData_53[3];

public:
	// <struct Vec2 m_OffsetPos, offset 0x38>
	struct Vec2 m_OffsetPos;

	// <class NYPhase m_Phase, offset 0x40>
	class NYPhase m_Phase;

	// <float m_PhaseTime[0x3], offset 0x5c>
	float m_PhaseTime[3];

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class CHrHUDBase [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(CHrHUDBase& InObject)
	{
		m_bHide = InObject.m_bHide;
		m_OffsetPos = InObject.m_OffsetPos;
		m_Phase = InObject.m_Phase;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CHrHUDBase>("CHrHUDBase")
			.addFunction("__tostring", &CHrHUDBase::ToString)
			.addFunction("GetPtrAddr", &CHrHUDBase::GetPtrAddr)
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &CHrHUDBase::field_0)
			// void type not supported in LuaBridge
			//.addProperty("m_pPhaseProc", &CHrHUDBase::m_pPhaseProc)
			.addProperty("m_bHide", &CHrHUDBase::m_bHide)
			.addProperty("m_OffsetPos", &CHrHUDBase::m_OffsetPos)
			.addProperty("m_Phase", &CHrHUDBase::m_Phase)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_PhaseTime", &CHrHUDBase::m_PhaseTime)
		.endClass();
	}
#endif
};
static_assert(sizeof(CHrHUDBase::field_0) == 4, "expected CHrHUDBase::field_0 to be size 4");
static_assert(sizeof(CHrHUDBase::m_pPhaseProc) == 48, "expected CHrHUDBase::m_pPhaseProc to be size 48");
static_assert(sizeof(CHrHUDBase::m_bHide) == 1, "expected CHrHUDBase::m_bHide to be size 1");
static_assert(sizeof(CHrHUDBase::m_OffsetPos) == 8, "expected CHrHUDBase::m_OffsetPos to be size 8");
static_assert(sizeof(CHrHUDBase::m_Phase) == 28, "expected CHrHUDBase::m_Phase to be size 28");
static_assert(sizeof(CHrHUDBase::m_PhaseTime) == 12, "expected CHrHUDBase::m_PhaseTime to be size 12");
static_assert(sizeof(CHrHUDBase) == 0x68, "expected CHrHUDBase to be size 0x68");

// [Structure] class CHrHUDMoney
class CHrHUDMoney : public CHrHUDBase
{
public:
	/// Struct member variables

	// <class CHrHUDBase Super, offset 0x0>
	// class CHrHUDBase Super;

	// <Unidentified data segment, offset 0x68>
private:
	char _UnidentifiedData_104[4];

public:
	// <float AppearOffsetY, offset 0x6c>
	float AppearOffsetY = 0;

	// <Unidentified data segment, offset 0x70>
private:
	char _UnidentifiedData_112[556];

public:
	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class CHrHUDMoney [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(CHrHUDMoney& InObject)
	{
		AppearOffsetY = InObject.AppearOffsetY;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<CHrHUDMoney, CHrHUDBase>("CHrHUDMoney")
			.addFunction("__tostring", &CHrHUDMoney::ToString)
			.addFunction("GetPtrAddr", &CHrHUDMoney::GetPtrAddr)
			.addProperty("AppearOffsetY", &CHrHUDMoney::AppearOffsetY)
		.endClass();
	}
#endif
};
static_assert(sizeof(CHrHUDMoney::AppearOffsetY) == 4, "expected CHrHUDMoney::AppearOffsetY to be size 4");
static_assert(sizeof(CHrHUDMoney) == 0x29c, "expected CHrHUDMoney to be size 0x29c");

// [Structure] class CHrHUDTension
class CHrHUDTension : public CHrHUDBase
{
public:
	/// Struct member variables

	// <class CHrHUDBase Super, offset 0x0>
	// class CHrHUDBase Super;

	// <Unidentified data segment, offset 0x68>
private:
	char _UnidentifiedData_104[328];

public:
	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class CHrHUDTension [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(CHrHUDTension& InObject)
	{
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<CHrHUDTension, CHrHUDBase>("CHrHUDTension")
			.addFunction("__tostring", &CHrHUDTension::ToString)
			.addFunction("GetPtrAddr", &CHrHUDTension::GetPtrAddr)
		.endClass();
	}
#endif
};
static_assert(sizeof(CHrHUDTension) == 0x1b0, "expected CHrHUDTension to be size 0x1b0");

// [Structure] class HrScreenStatus
class HrScreenStatus
{
public:
	// enum HrScreenStatus::STAT_DRAW_TYPE
	enum STAT_DRAW_TYPE : uint32_t
	{
		// <SCREEN_STAT_BATTLE = 0x0>
		SCREEN_STAT_BATTLE = 0,

		// <SCREEN_STAT_NATURAL = 0x1>
		SCREEN_STAT_NATURAL = 1,

		// <SCREEN_STAT_TOURING = 0x2>
		SCREEN_STAT_TOURING = 2

	};

	// enum HrScreenStatus::D_STATVAL_TYPE
	enum D_STATVAL_TYPE : uint32_t
	{
		// <D_STATVAL_HP = 0x0>
		D_STATVAL_HP = 0,

		// <D_STATVAL_TENSION = 0x1>
		D_STATVAL_TENSION = 1,

		// <D_STATVAL_BATTERY = 0x2>
		D_STATVAL_BATTERY = 2,

		// <D_STATVAL_MAP = 0x3>
		D_STATVAL_MAP = 3,

		// <D_STATVAL_MONEY = 0x4>
		D_STATVAL_MONEY = 4,

		// <D_STATVAL_SPEEDMETER = 0x5>
		D_STATVAL_SPEEDMETER = 5,

		// <D_STATVAL_KEYGUIDE = 0x6>
		D_STATVAL_KEYGUIDE = 6,

		// <D_STATVAL_CHECKPOINT = 0x7>
		D_STATVAL_CHECKPOINT = 7,

		// <D_STATVAL_BOSSHP = 0x8>
		D_STATVAL_BOSSHP = 8,

		// <D_STATVAL_LOG = 0x9>
		D_STATVAL_LOG = 9,

		// <D_STATVAL_COMBO = 0xa>
		D_STATVAL_COMBO = 10,

		// <D_STATVAL_SLOT = 0xb>
		D_STATVAL_SLOT = 11,

		// <D_STATVAL_TYPENUM = 0xc>
		D_STATVAL_TYPENUM = 12

	};

	// enum HrScreenStatus::E_LOG_DOID
	enum E_LOG_DOID : uint32_t
	{
		// <E_LOG_DOID_PICKUP = 0x0>
		E_LOG_DOID_PICKUP = 0,

		// <E_LOG_DOID_KABUTTA = 0x1>
		E_LOG_DOID_KABUTTA = 1,

		// <E_LOG_DOID_NAKATTA = 0x2>
		E_LOG_DOID_NAKATTA = 2,

		// <E_LOG_DOID_HORENAKATTA = 0x3>
		E_LOG_DOID_HORENAKATTA = 3,

		// <E_LOG_DOID_DIG_MONEY = 0x4>
		E_LOG_DOID_DIG_MONEY = 4,

		// <E_LOG_DOID_GET_MONEY = 0x5>
		E_LOG_DOID_GET_MONEY = 5,

		// <E_LOG_DOID_DIG_TSHIRT = 0x6>
		E_LOG_DOID_DIG_TSHIRT = 6,

		// <E_LOG_DOID_GET_TSHIRT = 0x7>
		E_LOG_DOID_GET_TSHIRT = 7,

		// <E_LOG_DOID_DIG = 0x8>
		E_LOG_DOID_DIG = 8,

		// <E_LOG_DOID_GET = 0x9>
		E_LOG_DOID_GET = 9,

		// <E_LOG_DOID_MAXHP_UP = 0xa>
		E_LOG_DOID_MAXHP_UP = 10,

		// <E_LOG_DOID_USAARE_GET = 0xb>
		E_LOG_DOID_USAARE_GET = 11,

		// <E_LOG_DOID_NIHONTO_GET = 0xc>
		E_LOG_DOID_NIHONTO_GET = 12,

		// <E_LOG_DOID_KAIFUKU = 0xd>
		E_LOG_DOID_KAIFUKU = 13,

		// <E_LOG_DOID_NUM = 0xe>
		E_LOG_DOID_NUM = 14

	};

	// enum HrScreenStatus::D_CHECKPOINT_TYPE
	enum D_CHECKPOINT_TYPE : uint32_t
	{
		// <D_CECKPO_CHECKPOINT = 0x0>
		D_CECKPO_CHECKPOINT = 0,

		// <D_CECKPO_STANDBY = 0x1>
		D_CECKPO_STANDBY = 1,

		// <D_CECKPO_ZENMETU = 0x2>
		D_CECKPO_ZENMETU = 2,

		// <D_CECKPO_CANTRIDE = 0x3>
		D_CECKPO_CANTRIDE = 3,

		// <D_CECKPO_PHONE = 0x4>
		D_CECKPO_PHONE = 4,

		// <D_CECKPO_NEWMASK = 0x5>
		D_CECKPO_NEWMASK = 5,

		// <D_CECKPO_SENRIHIN = 0x6>
		D_CECKPO_SENRIHIN = 6,

		// <D_CECKPO_TYPENUM = 0x7>
		D_CECKPO_TYPENUM = 7

	};

	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[184];

public:
	// <uint32_t State, offset 0xb8>
	uint32_t State = 0;

	// <Unidentified data segment, offset 0xbc>
private:
	char _UnidentifiedData_188[28];

public:
	// <class HrMap* Map, offset 0xd8>
	class HrMap* Map = nullptr;

	// <Unidentified data segment, offset 0xdc>
private:
	char _UnidentifiedData_220[7840];

public:
	// <int32_t MapScaleType, offset 0x1f7c>
	int32_t MapScaleType = 0;

	// <Unidentified data segment, offset 0x1f80>
private:
	char _UnidentifiedData_8064[12];

public:
	// <class HrScreenStatusBalloon* ScreenStatusBalloon, offset 0x1f8c>
	class HrScreenStatusBalloon* ScreenStatusBalloon = nullptr;

	// <Unidentified data segment, offset 0x1f90>
private:
	char _UnidentifiedData_8080[1692];

public:
	// <uint32_t UnknownLanguageGroupResources, offset 0x262c>
	uint32_t UnknownLanguageGroupResources = 0;

	// <char UnknownBalloonInitializeStageFlag, offset 0x2630>
	char UnknownBalloonInitializeStageFlag;

	// <Unidentified data segment, offset 0x2631>
private:
	char _UnidentifiedData_9777[935];

public:
	// <class HrTask* UnknownMissionTaskPointer, offset 0x29d8>
	class HrTask* UnknownMissionTaskPointer = nullptr;

	// <Unidentified data segment, offset 0x29dc>
private:
	char _UnidentifiedData_10716[908];

public:
	// <class HrScreenStatusSlot* ScreenStatusSlot, offset 0x2d68>
	class HrScreenStatusSlot* ScreenStatusSlot = nullptr;

	// <Unidentified data segment, offset 0x2d6c>
private:
	char _UnidentifiedData_11628[36];

public:
	// <class GtSimplMes* SimpleMessage, offset 0x2d90>
	class GtSimplMes* SimpleMessage = nullptr;

	// <Unidentified data segment, offset 0x2d94>
private:
	char _UnidentifiedData_11668[16];

public:
	// <struct BATTLESIMPLMESS_SET* BattleSimpleMessagePtr, offset 0x2da4>
	struct BATTLESIMPLMESS_SET* BattleSimpleMessagePtr = nullptr;

	// <Unidentified data segment, offset 0x2da8>
private:
	char _UnidentifiedData_11688[8];

public:
	// <int16_t DrawFlag, offset 0x2db0>
	int16_t DrawFlag = 0;

	// <Unidentified data segment, offset 0x2db2>
private:
	char _UnidentifiedData_11698[21];

public:
	// <uint8_t BusFight, offset 0x2dc7>
	uint8_t BusFight = 0;

	// <Unidentified data segment, offset 0x2dc8>
private:
	char _UnidentifiedData_11720[7];

public:
	// <uint8_t MiniMapVisible, offset 0x2dcf>
	uint8_t MiniMapVisible = 0;

	// <Unidentified data segment, offset 0x2dd0>
private:
	char _UnidentifiedData_11728[4];

public:
	// <int32_t RevengeMissionAllEnmNum, offset 0x2dd4>
	int32_t RevengeMissionAllEnmNum = 0;

	// <Unidentified data segment, offset 0x2dd8>
private:
	char _UnidentifiedData_11736[60];

public:
	// <char HealthFlag, offset 0x2e14>
	char HealthFlag;

	// <Unidentified data segment, offset 0x2e15>
private:
	char _UnidentifiedData_11797[131];

public:
	// <char BatteryFlag, offset 0x2e98>
	char BatteryFlag;

	// <Unidentified data segment, offset 0x2e99>
private:
	char _UnidentifiedData_11929[751];

public:
	// <class CHrHUDTension TensionHud, offset 0x3188>
	class CHrHUDTension TensionHud;

	// <class CHrHUDMoney MoneyHud, offset 0x3338>
	class CHrHUDMoney MoneyHud;

	// <Unidentified data segment, offset 0x35d4>
private:
	char _UnidentifiedData_13780[52];

public:
	// <char SpeedMeterFlag, offset 0x3608>
	char SpeedMeterFlag;

	// <Unidentified data segment, offset 0x3609>
private:
	char _UnidentifiedData_13833[599];

public:
	// <uint32_t SettingBGMVolume, offset 0x3860>
	uint32_t SettingBGMVolume = 0;

	// <uint32_t SettingSEVolume, offset 0x3864>
	uint32_t SettingSEVolume = 0;

	// <uint8_t SettingMiniMap, offset 0x3868>
	uint8_t SettingMiniMap = 0;

	// <Unidentified data segment, offset 0x3869>
private:
	char _UnidentifiedData_14441[3];

public:
	// <float SettingPower, offset 0x386c>
	float SettingPower = 0;

	/// 66 Functions

	// [Function] class HrMap& __convention("thiscall") HrScreenStatus::GetMap(class HrScreenStatus* const this) [?GetMap@HrScreenStatus@@QAEAAVHrMap@@XZ]
	typedef class HrMap&(__thiscall* _GetMap_HrScreenStatus__QAEAAVHrMap__XZ)(class HrScreenStatus* const thisPtr);
	// Can't export & pointer 'class HrMap&' [TypeClass.PointerTypeClass] in LuaBridge
	void GetMap()
	{
		_GetMap_HrScreenStatus__QAEAAVHrMap__XZ mFunc = (_GetMap_HrScreenStatus__QAEAAVHrMap__XZ)(GameModule + 0x9cec0);
		mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetStatusBatterySE_Flag(class HrScreenStatus* const this, uint8_t arg2) [?SetStatusBatterySE_Flag@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _SetStatusBatterySE_Flag_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void SetStatusBatterySE_Flag(uint8_t arg2)
	{
		_SetStatusBatterySE_Flag_HrScreenStatus__QAEX_N_Z mFunc = (_SetStatusBatterySE_Flag_HrScreenStatus__QAEX_N_Z)(GameModule + 0xa2220);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetStatusMAXBatterySEStopFlag(class HrScreenStatus* const this) [?SetStatusMAXBatterySEStopFlag@HrScreenStatus@@QAEXXZ]
	typedef void(__thiscall* _SetStatusMAXBatterySEStopFlag_HrScreenStatus__QAEXXZ)(class HrScreenStatus* const thisPtr);
	void SetStatusMAXBatterySEStopFlag()
	{
		_SetStatusMAXBatterySEStopFlag_HrScreenStatus__QAEXXZ mFunc = (_SetStatusMAXBatterySEStopFlag_HrScreenStatus__QAEXXZ)(GameModule + 0xa2230);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetRevengeMissionAllEnmNum(class HrScreenStatus* const this, int32_t arg2) [?SetRevengeMissionAllEnmNum@HrScreenStatus@@QAEXH@Z]
	typedef void(__thiscall* _SetRevengeMissionAllEnmNum_HrScreenStatus__QAEXH_Z)(class HrScreenStatus* const thisPtr, int32_t arg2);
	void SetRevengeMissionAllEnmNum(int32_t arg2)
	{
		_SetRevengeMissionAllEnmNum_HrScreenStatus__QAEXH_Z mFunc = (_SetRevengeMissionAllEnmNum_HrScreenStatus__QAEXH_Z)(GameModule + 0xa2240);
		return mFunc(this, arg2);
	}
	// [Function] class HrScreenStatusSlot& __convention("thiscall") HrScreenStatus::GetSlot(class HrScreenStatus* const this) [?GetSlot@HrScreenStatus@@QAEAAVHrScreenStatusSlot@@XZ]
	typedef class HrScreenStatusSlot&(__thiscall* _GetSlot_HrScreenStatus__QAEAAVHrScreenStatusSlot__XZ)(class HrScreenStatus* const thisPtr);
	// Can't export & pointer 'class HrScreenStatusSlot&' [TypeClass.PointerTypeClass] in LuaBridge
	void GetSlot()
	{
		_GetSlot_HrScreenStatus__QAEAAVHrScreenStatusSlot__XZ mFunc = (_GetSlot_HrScreenStatus__QAEAAVHrScreenStatusSlot__XZ)(GameModule + 0xa2250);
		mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetStatusProcess(class HrScreenStatus* const this, uint8_t arg2) [?SetStatusProcess@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _SetStatusProcess_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void SetStatusProcess(uint8_t arg2)
	{
		_SetStatusProcess_HrScreenStatus__QAEX_N_Z mFunc = (_SetStatusProcess_HrScreenStatus__QAEX_N_Z)(GameModule + 0xa3880);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") HrScreenStatus::GetRevengeMissionAllEnmNum(class HrScreenStatus* const this) [?GetRevengeMissionAllEnmNum@HrScreenStatus@@QAEHXZ]
	typedef int32_t(__thiscall* _GetRevengeMissionAllEnmNum_HrScreenStatus__QAEHXZ)(class HrScreenStatus* const thisPtr);
	int32_t GetRevengeMissionAllEnmNum()
	{
		_GetRevengeMissionAllEnmNum_HrScreenStatus__QAEHXZ mFunc = (_GetRevengeMissionAllEnmNum_HrScreenStatus__QAEHXZ)(GameModule + 0xa3890);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetSettingBGMVolume(class HrScreenStatus* const this, uint32_t arg2) [?SetSettingBGMVolume@HrScreenStatus@@QAEXI@Z]
	typedef void(__thiscall* _SetSettingBGMVolume_HrScreenStatus__QAEXI_Z)(class HrScreenStatus* const thisPtr, uint32_t arg2);
	void SetSettingBGMVolume(uint32_t arg2)
	{
		_SetSettingBGMVolume_HrScreenStatus__QAEXI_Z mFunc = (_SetSettingBGMVolume_HrScreenStatus__QAEXI_Z)(GameModule + 0xa38a0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetSettingSEVolume(class HrScreenStatus* const this, uint32_t arg2) [?SetSettingSEVolume@HrScreenStatus@@QAEXI@Z]
	typedef void(__thiscall* _SetSettingSEVolume_HrScreenStatus__QAEXI_Z)(class HrScreenStatus* const thisPtr, uint32_t arg2);
	void SetSettingSEVolume(uint32_t arg2)
	{
		_SetSettingSEVolume_HrScreenStatus__QAEXI_Z mFunc = (_SetSettingSEVolume_HrScreenStatus__QAEXI_Z)(GameModule + 0xa38b0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetSettingMiniMap(class HrScreenStatus* const this, uint8_t arg2) [?SetSettingMiniMap@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _SetSettingMiniMap_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void SetSettingMiniMap(uint8_t arg2)
	{
		_SetSettingMiniMap_HrScreenStatus__QAEX_N_Z mFunc = (_SetSettingMiniMap_HrScreenStatus__QAEX_N_Z)(GameModule + 0xa38c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetSettingPower(class HrScreenStatus* const this, float arg2) [?SetSettingPower@HrScreenStatus@@QAEXM@Z]
	typedef void(__thiscall* _SetSettingPower_HrScreenStatus__QAEXM_Z)(class HrScreenStatus* const thisPtr, float arg2);
	void SetSettingPower(float arg2)
	{
		_SetSettingPower_HrScreenStatus__QAEXM_Z mFunc = (_SetSettingPower_HrScreenStatus__QAEXM_Z)(GameModule + 0xa38d0);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") HrScreenStatus::GetStatusBatteryParam(class HrScreenStatus* const this) [?GetStatusBatteryParam@HrScreenStatus@@QAEMXZ]
	typedef float(__thiscall* _GetStatusBatteryParam_HrScreenStatus__QAEMXZ)(class HrScreenStatus* const thisPtr);
	float GetStatusBatteryParam()
	{
		_GetStatusBatteryParam_HrScreenStatus__QAEMXZ mFunc = (_GetStatusBatteryParam_HrScreenStatus__QAEMXZ)(GameModule + 0xaab50);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::SetStatusDataLoadFlag(class HrScreenStatus* const this, uint8_t arg2) [?SetStatusDataLoadFlag@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _SetStatusDataLoadFlag_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void SetStatusDataLoadFlag(uint8_t arg2)
	{
		_SetStatusDataLoadFlag_HrScreenStatus__QAEX_N_Z mFunc = (_SetStatusDataLoadFlag_HrScreenStatus__QAEX_N_Z)(GameModule + 0xaab60);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::GetStatusBatterySE_Flag(class HrScreenStatus* const this) [?GetStatusBatterySE_Flag@HrScreenStatus@@QAE_NXZ]
	typedef uint8_t(__thiscall* _GetStatusBatterySE_Flag_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t GetStatusBatterySE_Flag()
	{
		_GetStatusBatterySE_Flag_HrScreenStatus__QAE_NXZ mFunc = (_GetStatusBatterySE_Flag_HrScreenStatus__QAE_NXZ)(GameModule + 0xaab70);
		return mFunc(this);
	}
	// [Function] uint32_t __convention("thiscall") HrScreenStatus::GetSettingBGMVolume(class HrScreenStatus* const this) [?GetSettingBGMVolume@HrScreenStatus@@QAEIXZ]
	typedef uint32_t(__thiscall* _GetSettingBGMVolume_HrScreenStatus__QAEIXZ)(class HrScreenStatus* const thisPtr);
	uint32_t GetSettingBGMVolume()
	{
		_GetSettingBGMVolume_HrScreenStatus__QAEIXZ mFunc = (_GetSettingBGMVolume_HrScreenStatus__QAEIXZ)(GameModule + 0xba4b0);
		return mFunc(this);
	}
	// [Function] struct tagGHMR_TEX* __convention("thiscall") HrScreenStatus::GetScrollBarTexture(class HrScreenStatus* const this) [?GetScrollBarTexture@HrScreenStatus@@QBEPAUtagGHMR_TEX@@XZ]
	typedef struct tagGHMR_TEX*(__thiscall* _GetScrollBarTexture_HrScreenStatus__QBEPAUtagGHMR_TEX__XZ)(class HrScreenStatus* const thisPtr);
	struct tagGHMR_TEX* GetScrollBarTexture()
	{
		_GetScrollBarTexture_HrScreenStatus__QBEPAUtagGHMR_TEX__XZ mFunc = (_GetScrollBarTexture_HrScreenStatus__QBEPAUtagGHMR_TEX__XZ)(GameModule + 0xd4000);
		return mFunc(this);
	}
	// [Function] struct tagGHMR_TEX __convention("thiscall") HrScreenStatus::GetMapFrameTex(class HrScreenStatus* const this) [?GetMapFrameTex@HrScreenStatus@@QAE?AUtagGHMR_TEX@@XZ]
	typedef struct tagGHMR_TEX(__thiscall* _GetMapFrameTex_HrScreenStatus__QAEAUtagGHMR_TEX__XZ)(class HrScreenStatus* const thisPtr);
	struct tagGHMR_TEX GetMapFrameTex()
	{
		_GetMapFrameTex_HrScreenStatus__QAEAUtagGHMR_TEX__XZ mFunc = (_GetMapFrameTex_HrScreenStatus__QAEAUtagGHMR_TEX__XZ)(GameModule + 0xd4010);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") HrScreenStatus::GetSettingPower(class HrScreenStatus* const this) [?GetSettingPower@HrScreenStatus@@QAEMXZ]
	typedef float(__thiscall* _GetSettingPower_HrScreenStatus__QAEMXZ)(class HrScreenStatus* const thisPtr);
	float GetSettingPower()
	{
		_GetSettingPower_HrScreenStatus__QAEMXZ mFunc = (_GetSettingPower_HrScreenStatus__QAEMXZ)(GameModule + 0xd4040);
		return mFunc(this);
	}
	// [Function] class HrTask* HrScreenStatus::TestCreate() [?TestCreate@HrScreenStatus@@SAPAVHrTask@@XZ]
	typedef class HrTask*(__fastcall* _TestCreate_HrScreenStatus__SAPAVHrTask__XZ)();
	static class HrTask* TestCreate()
	{
		_TestCreate_HrScreenStatus__SAPAVHrTask__XZ mFunc = (_TestCreate_HrScreenStatus__SAPAVHrTask__XZ)(GameModule + 0x469d60);
		return mFunc();
	}
	// [Function] uint8_t HrScreenStatus::CheckUnionTerminate() [?CheckUnionTerminate@HrScreenStatus@@KA_NXZ]
	typedef uint8_t(__fastcall* _CheckUnionTerminate_HrScreenStatus__KA_NXZ)();
	static uint8_t CheckUnionTerminate()
	{
		_CheckUnionTerminate_HrScreenStatus__KA_NXZ mFunc = (_CheckUnionTerminate_HrScreenStatus__KA_NXZ)(GameModule + 0x469d70);
		return mFunc();
	}
	// [Function] uint8_t HrScreenStatus::UnionTerminate() [?UnionTerminate@HrScreenStatus@@KA_NXZ]
	typedef uint8_t(__fastcall* _UnionTerminate_HrScreenStatus__KA_NXZ)();
	static uint8_t UnionTerminate()
	{
		_UnionTerminate_HrScreenStatus__KA_NXZ mFunc = (_UnionTerminate_HrScreenStatus__KA_NXZ)(GameModule + 0x469e40);
		return mFunc();
	}
	// [Function] uint8_t HrScreenStatus::CheckUnionInitialize() [?CheckUnionInitialize@HrScreenStatus@@KA_NXZ]
	typedef uint8_t(__fastcall* _CheckUnionInitialize_HrScreenStatus__KA_NXZ)();
	static uint8_t CheckUnionInitialize()
	{
		_CheckUnionInitialize_HrScreenStatus__KA_NXZ mFunc = (_CheckUnionInitialize_HrScreenStatus__KA_NXZ)(GameModule + 0x469e70);
		return mFunc();
	}
	// [Function] uint8_t HrScreenStatus::UnionInitialize() [?UnionInitialize@HrScreenStatus@@KA_NXZ]
	typedef uint8_t(__fastcall* _UnionInitialize_HrScreenStatus__KA_NXZ)();
	static uint8_t UnionInitialize()
	{
		_UnionInitialize_HrScreenStatus__KA_NXZ mFunc = (_UnionInitialize_HrScreenStatus__KA_NXZ)(GameModule + 0x46a1e0);
		return mFunc();
	}
	// [Function] float __convention("thiscall") HrScreenStatus::dValUp(class HrScreenStatus* const this, float arg2, float arg3) [?dValUp@HrScreenStatus@@AAEMMM@Z]
	typedef float(__thiscall* _dValUp_HrScreenStatus__AAEMMM_Z)(class HrScreenStatus* const thisPtr, float arg2, float arg3);
	float dValUp(float arg2, float arg3)
	{
		_dValUp_HrScreenStatus__AAEMMM_Z mFunc = (_dValUp_HrScreenStatus__AAEMMM_Z)(GameModule + 0x46a210);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dSetMissionResultSceneTime(class HrScreenStatus* const this, int32_t arg2, uint8_t arg3) [?dSetMissionResultSceneTime@HrScreenStatus@@QAE_NHE@Z]
	typedef uint8_t(__thiscall* _dSetMissionResultSceneTime_HrScreenStatus__QAE_NHE_Z)(class HrScreenStatus* const thisPtr, int32_t arg2, uint8_t arg3);
	uint8_t dSetMissionResultSceneTime(int32_t arg2, uint8_t arg3)
	{
		_dSetMissionResultSceneTime_HrScreenStatus__QAE_NHE_Z mFunc = (_dSetMissionResultSceneTime_HrScreenStatus__QAE_NHE_Z)(GameModule + 0x46a280);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::BalloonCheckDraw(class HrScreenStatus* const this) [?BalloonCheckDraw@HrScreenStatus@@QAE_NXZ]
	typedef uint8_t(__thiscall* _BalloonCheckDraw_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t BalloonCheckDraw()
	{
		_BalloonCheckDraw_HrScreenStatus__QAE_NXZ mFunc = (_BalloonCheckDraw_HrScreenStatus__QAE_NXZ)(GameModule + 0x46a2d0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dLog_ScissoringBoxAnimationProc(class HrScreenStatus* const this, float* arg2, int16_t* arg3, int16_t* arg4, int32_t arg5) [?dLog_ScissoringBoxAnimationProc@HrScreenStatus@@AAEXPAMPAF1H@Z]
	typedef void(__thiscall* _dLog_ScissoringBoxAnimationProc_HrScreenStatus__AAEXPAMPAF1H_Z)(class HrScreenStatus* const thisPtr, float* arg2, int16_t* arg3, int16_t* arg4, int32_t arg5);
	void dLog_ScissoringBoxAnimationProc(float* arg2, int16_t* arg3, int16_t* arg4, int32_t arg5)
	{
		_dLog_ScissoringBoxAnimationProc_HrScreenStatus__AAEXPAMPAF1H_Z mFunc = (_dLog_ScissoringBoxAnimationProc_HrScreenStatus__AAEXPAMPAF1H_Z)(GameModule + 0x46a2e0);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::RenderProcess(class HrScreenStatus* const this) [?RenderProcess@HrScreenStatus@@MAEXXZ]
	typedef void(__thiscall* _RenderProcess_HrScreenStatus__MAEXXZ)(class HrScreenStatus* const thisPtr);
	void RenderProcess()
	{
		_RenderProcess_HrScreenStatus__MAEXXZ mFunc = (_RenderProcess_HrScreenStatus__MAEXXZ)(GameModule + 0x46a3e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::DispCheckPointMessage(class HrScreenStatus* const this) [?DispCheckPointMessage@HrScreenStatus@@AAEXXZ]
	typedef void(__thiscall* _DispCheckPointMessage_HrScreenStatus__AAEXXZ)(class HrScreenStatus* const thisPtr);
	void DispCheckPointMessage()
	{
		_DispCheckPointMessage_HrScreenStatus__AAEXXZ mFunc = (_DispCheckPointMessage_HrScreenStatus__AAEXXZ)(GameModule + 0x46a530);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::IsDrawKillCount(class HrScreenStatus* const this) [?IsDrawKillCount@HrScreenStatus@@AAE_NXZ]
	typedef uint8_t(__thiscall* _IsDrawKillCount_HrScreenStatus__AAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t IsDrawKillCount()
	{
		_IsDrawKillCount_HrScreenStatus__AAE_NXZ mFunc = (_IsDrawKillCount_HrScreenStatus__AAE_NXZ)(GameModule + 0x46a600);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::DrawSubMissionInfo(class HrScreenStatus* const this) [?DrawSubMissionInfo@HrScreenStatus@@AAEXXZ]
	typedef void(__thiscall* _DrawSubMissionInfo_HrScreenStatus__AAEXXZ)(class HrScreenStatus* const thisPtr);
	void DrawSubMissionInfo()
	{
		_DrawSubMissionInfo_HrScreenStatus__AAEXXZ mFunc = (_DrawSubMissionInfo_HrScreenStatus__AAEXXZ)(GameModule + 0x46a640);
		return mFunc(this);
	}
	// [Function] void HrScreenStatus::RenderProcessFront(void* arg1) [?RenderProcessFront@HrScreenStatus@@KAXPAX@Z]
	typedef void(__fastcall* _RenderProcessFront_HrScreenStatus__KAXPAX_Z)(void* arg1);
	static void RenderProcessFront(void* arg1)
	{
		_RenderProcessFront_HrScreenStatus__KAXPAX_Z mFunc = (_RenderProcessFront_HrScreenStatus__KAXPAX_Z)(GameModule + 0x46a940);
		return mFunc(arg1);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::FrameProcess(class HrScreenStatus* const this) [?FrameProcess@HrScreenStatus@@MAEXXZ]
	typedef void(__thiscall* _FrameProcess_HrScreenStatus__MAEXXZ)(class HrScreenStatus* const thisPtr);
	void FrameProcess()
	{
		_FrameProcess_HrScreenStatus__MAEXXZ mFunc = (_FrameProcess_HrScreenStatus__MAEXXZ)(GameModule + 0x46aab0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dLeavingExceptBattery(class HrScreenStatus* const this, uint8_t arg2) [?dLeavingExceptBattery@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _dLeavingExceptBattery_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void dLeavingExceptBattery(uint8_t arg2)
	{
		_dLeavingExceptBattery_HrScreenStatus__QAEX_N_Z mFunc = (_dLeavingExceptBattery_HrScreenStatus__QAEX_N_Z)(GameModule + 0x46ba60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::Terminate(class HrScreenStatus* const this) [?Terminate@HrScreenStatus@@MAEXXZ]
	typedef void(__thiscall* _Terminate_HrScreenStatus__MAEXXZ)(class HrScreenStatus* const thisPtr);
	void Terminate()
	{
		_Terminate_HrScreenStatus__MAEXXZ mFunc = (_Terminate_HrScreenStatus__MAEXXZ)(GameModule + 0x46bcd0);
		return mFunc(this);
	}
	// [Function] class ghmResGroup* HrScreenStatus::GetLanguageGroup(class ghmResGroup* arg1) [?GetLanguageGroup@HrScreenStatus@@SAPAVghmResGroup@@PAV2@@Z]
	typedef class ghmResGroup*(__fastcall* _GetLanguageGroup_HrScreenStatus__SAPAVghmResGroup__PAV2__Z)(class ghmResGroup* arg1);
	static class ghmResGroup* GetLanguageGroup(class ghmResGroup* arg1)
	{
		_GetLanguageGroup_HrScreenStatus__SAPAVghmResGroup__PAV2__Z mFunc = (_GetLanguageGroup_HrScreenStatus__SAPAVghmResGroup__PAV2__Z)(GameModule + 0x46c3f0);
		return mFunc(arg1);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::BalloonIsAppear(class HrScreenStatus* const this, enum HrScreenStatusBalloon::OBJ_ID arg2) [?BalloonIsAppear@HrScreenStatus@@QAE_NW4OBJ_ID@HrScreenStatusBalloon@@@Z]
	typedef uint8_t(__thiscall* _BalloonIsAppear_HrScreenStatus__QAE_NW4OBJ_ID_HrScreenStatusBalloon___Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatusBalloon::OBJ_ID arg2);
	uint8_t BalloonIsAppear(/* enum HrScreenStatusBalloon::OBJ_ID */ uint32_t arg2)
	{
		_BalloonIsAppear_HrScreenStatus__QAE_NW4OBJ_ID_HrScreenStatusBalloon___Z mFunc = (_BalloonIsAppear_HrScreenStatus__QAE_NW4OBJ_ID_HrScreenStatusBalloon___Z)(GameModule + 0x46c470);
		return mFunc(this, (enum HrScreenStatusBalloon::OBJ_ID)arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dAppearInGameMenu(class HrScreenStatus* const this) [?dAppearInGameMenu@HrScreenStatus@@QAE_NXZ]
	/// <summary>
	/// Called when the pause menu is spawned.
	/// </summary>
	typedef uint8_t(__thiscall* _dAppearInGameMenu_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t dAppearInGameMenu()
	{
		_dAppearInGameMenu_HrScreenStatus__QAE_NXZ mFunc = (_dAppearInGameMenu_HrScreenStatus__QAE_NXZ)(GameModule + 0x46c490);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::DemoButtonAppear(class HrScreenStatus* const this, enum CHrHUDDemoButton::PICT_ID_DEMO_BUTTON arg2) [?DemoButtonAppear@HrScreenStatus@@QAEXW4PICT_ID_DEMO_BUTTON@CHrHUDDemoButton@@@Z]
	typedef void(__thiscall* _DemoButtonAppear_HrScreenStatus__QAEXW4PICT_ID_DEMO_BUTTON_CHrHUDDemoButton___Z)(class HrScreenStatus* const thisPtr, enum CHrHUDDemoButton::PICT_ID_DEMO_BUTTON arg2);
	void DemoButtonAppear(/* enum CHrHUDDemoButton::PICT_ID_DEMO_BUTTON */ uint32_t arg2)
	{
		_DemoButtonAppear_HrScreenStatus__QAEXW4PICT_ID_DEMO_BUTTON_CHrHUDDemoButton___Z mFunc = (_DemoButtonAppear_HrScreenStatus__QAEXW4PICT_ID_DEMO_BUTTON_CHrHUDDemoButton___Z)(GameModule + 0x46c520);
		return mFunc(this, (enum CHrHUDDemoButton::PICT_ID_DEMO_BUTTON)arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::DemoButtonLeave(class HrScreenStatus* const this) [?DemoButtonLeave@HrScreenStatus@@QAEXXZ]
	typedef void(__thiscall* _DemoButtonLeave_HrScreenStatus__QAEXXZ)(class HrScreenStatus* const thisPtr);
	void DemoButtonLeave()
	{
		_DemoButtonLeave_HrScreenStatus__QAEXXZ mFunc = (_DemoButtonLeave_HrScreenStatus__QAEXXZ)(GameModule + 0x46c5c0);
		return mFunc(this);
	}
	// [Function] class HrScreenStatus* HrScreenStatus::Create() [?Create@HrScreenStatus@@SAPAV1@XZ]
	typedef class HrScreenStatus*(__fastcall* _Create_HrScreenStatus__SAPAV1_XZ)();
	static class HrScreenStatus* Create()
	{
		_Create_HrScreenStatus__SAPAV1_XZ mFunc = (_Create_HrScreenStatus__SAPAV1_XZ)(GameModule + 0x46c5d0);
		return mFunc();
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dSetType(class HrScreenStatus* const this, enum HrScreenStatus::STAT_DRAW_TYPE arg2) [?dSetType@HrScreenStatus@@QAEXW4STAT_DRAW_TYPE@1@@Z]
	typedef void(__thiscall* _dSetType_HrScreenStatus__QAEXW4STAT_DRAW_TYPE_1__Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatus::STAT_DRAW_TYPE arg2);
	void dSetType(/* enum HrScreenStatus::STAT_DRAW_TYPE */ uint32_t arg2)
	{
		_dSetType_HrScreenStatus__QAEXW4STAT_DRAW_TYPE_1__Z mFunc = (_dSetType_HrScreenStatus__QAEXW4STAT_DRAW_TYPE_1__Z)(GameModule + 0x46c840);
		return mFunc(this, (enum HrScreenStatus::STAT_DRAW_TYPE)arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dCheckDrawAll(class HrScreenStatus* const this) [?dCheckDrawAll@HrScreenStatus@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dCheckDrawAll_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t dCheckDrawAll()
	{
		_dCheckDrawAll_HrScreenStatus__QAE_NXZ mFunc = (_dCheckDrawAll_HrScreenStatus__QAE_NXZ)(GameModule + 0x46c850);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dCheckDraw(class HrScreenStatus* const this, enum HrScreenStatus::D_STATVAL_TYPE arg2) [?dCheckDraw@HrScreenStatus@@QAE_NW4D_STATVAL_TYPE@1@@Z]
	typedef uint8_t(__thiscall* _dCheckDraw_HrScreenStatus__QAE_NW4D_STATVAL_TYPE_1__Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatus::D_STATVAL_TYPE arg2);
	uint8_t dCheckDraw(/* enum HrScreenStatus::D_STATVAL_TYPE */ uint32_t arg2)
	{
		_dCheckDraw_HrScreenStatus__QAE_NW4D_STATVAL_TYPE_1__Z mFunc = (_dCheckDraw_HrScreenStatus__QAE_NW4D_STATVAL_TYPE_1__Z)(GameModule + 0x46c8b0);
		return mFunc(this, (enum HrScreenStatus::D_STATVAL_TYPE)arg2);
	}
	// [Function] int32_t __convention("thiscall") HrScreenStatus::dGetMissionResultType(class HrScreenStatus* const this) [?dGetMissionResultType@HrScreenStatus@@QAEHXZ]
	typedef int32_t(__thiscall* _dGetMissionResultType_HrScreenStatus__QAEHXZ)(class HrScreenStatus* const thisPtr);
	int32_t dGetMissionResultType()
	{
		_dGetMissionResultType_HrScreenStatus__QAEHXZ mFunc = (_dGetMissionResultType_HrScreenStatus__QAEHXZ)(GameModule + 0x46c9a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dLeavingSelect(class HrScreenStatus* const this, enum HrScreenStatus::D_STATVAL_TYPE arg2, char arg3) [?dLeavingSelect@HrScreenStatus@@QAEXW4D_STATVAL_TYPE@1@C@Z]
	typedef void(__thiscall* _dLeavingSelect_HrScreenStatus__QAEXW4D_STATVAL_TYPE_1_C_Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatus::D_STATVAL_TYPE arg2, char arg3);
	void dLeavingSelect(/* enum HrScreenStatus::D_STATVAL_TYPE */ uint32_t arg2, char arg3)
	{
		_dLeavingSelect_HrScreenStatus__QAEXW4D_STATVAL_TYPE_1_C_Z mFunc = (_dLeavingSelect_HrScreenStatus__QAEXW4D_STATVAL_TYPE_1_C_Z)(GameModule + 0x46c9d0);
		return mFunc(this, (enum HrScreenStatus::D_STATVAL_TYPE)arg2, arg3);
	}
	// [Function] float __convention("thiscall") HrScreenStatus::dGetHpScale(class HrScreenStatus* const this) [?dGetHpScale@HrScreenStatus@@QAEMXZ]
	typedef float(__thiscall* _dGetHpScale_HrScreenStatus__QAEMXZ)(class HrScreenStatus* const thisPtr);
	float dGetHpScale()
	{
		_dGetHpScale_HrScreenStatus__QAEMXZ mFunc = (_dGetHpScale_HrScreenStatus__QAEMXZ)(GameModule + 0x46cc70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BattleSimplMessage(class HrScreenStatus* const this, enum BATTLE_SIMPLMESSEAGE_NUM MessNum, bool SkipIfExists) [?BattleSimplMessage@HrScreenStatus@@QAEXH_N@Z]
	/// <summary>
	/// Displays a small center pop-up. Seen in normal play when picking up items, or standing on interaction circles.
	/// </summary>
	typedef void(__thiscall* _BattleSimplMessage_HrScreenStatus__QAEXH_N_Z)(class HrScreenStatus* const thisPtr, enum BATTLE_SIMPLMESSEAGE_NUM MessNum, bool SkipIfExists);
	void BattleSimplMessage(/* enum BATTLE_SIMPLMESSEAGE_NUM */ uint32_t MessNum, bool SkipIfExists)
	{
		_BattleSimplMessage_HrScreenStatus__QAEXH_N_Z mFunc = (_BattleSimplMessage_HrScreenStatus__QAEXH_N_Z)(GameModule + 0x46cc80);
		return mFunc(this, (enum BATTLE_SIMPLMESSEAGE_NUM)MessNum, SkipIfExists);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BalloonLeaveAll(class HrScreenStatus* const this, uint8_t arg2) [?BalloonLeaveAll@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _BalloonLeaveAll_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void BalloonLeaveAll(uint8_t arg2)
	{
		_BalloonLeaveAll_HrScreenStatus__QAEX_N_Z mFunc = (_BalloonLeaveAll_HrScreenStatus__QAEX_N_Z)(GameModule + 0x46cd70);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BalloonAppear(class HrScreenStatus* const this, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3) [?BalloonAppear@HrScreenStatus@@QAEXW4OBJ_ID@HrScreenStatusBalloon@@_N@Z]
	/// <summary>
	/// Makes a bubble appear above Travis. Bubble is seen in normal play when swapping weapons.
	/// </summary>
	typedef void(__thiscall* _BalloonAppear_HrScreenStatus__QAEXW4OBJ_ID_HrScreenStatusBalloon___N_Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3);
	void BalloonAppear(/* enum HrScreenStatusBalloon::OBJ_ID */ uint32_t arg2, uint8_t arg3)
	{
		_BalloonAppear_HrScreenStatus__QAEXW4OBJ_ID_HrScreenStatusBalloon___N_Z mFunc = (_BalloonAppear_HrScreenStatus__QAEXW4OBJ_ID_HrScreenStatusBalloon___N_Z)(GameModule + 0x46cd80);
		return mFunc(this, (enum HrScreenStatusBalloon::OBJ_ID)arg2, arg3);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BalloonLeave(class HrScreenStatus* const this, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3) [?BalloonLeave@HrScreenStatus@@QAEXW4OBJ_ID@HrScreenStatusBalloon@@_N@Z]
	typedef void(__thiscall* _BalloonLeave_HrScreenStatus__QAEXW4OBJ_ID_HrScreenStatusBalloon___N_Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatusBalloon::OBJ_ID arg2, uint8_t arg3);
	void BalloonLeave(/* enum HrScreenStatusBalloon::OBJ_ID */ uint32_t arg2, uint8_t arg3)
	{
		_BalloonLeave_HrScreenStatus__QAEXW4OBJ_ID_HrScreenStatusBalloon___N_Z mFunc = (_BalloonLeave_HrScreenStatus__QAEXW4OBJ_ID_HrScreenStatusBalloon___N_Z)(GameModule + 0x46cd90);
		return mFunc(this, (enum HrScreenStatusBalloon::OBJ_ID)arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dAppearMissionResult(class HrScreenStatus* const this, uint32_t arg2, int16_t arg3, int16_t arg4, int32_t arg5, char arg6, enum HrMissionResult::D_RESULT_TYPE arg7, int16_t arg8, int16_t arg9) [?dAppearMissionResult@HrScreenStatus@@QAE_NIFFHCW4D_RESULT_TYPE@HrMissionResult@@FF@Z]
	typedef uint8_t(__thiscall* _dAppearMissionResult_HrScreenStatus__QAE_NIFFHCW4D_RESULT_TYPE_HrMissionResult__FF_Z)(class HrScreenStatus* const thisPtr, uint32_t arg2, int16_t arg3, int16_t arg4, int32_t arg5, char arg6, enum HrMissionResult::D_RESULT_TYPE arg7, int16_t arg8, int16_t arg9);
	uint8_t dAppearMissionResult(uint32_t arg2, int16_t arg3, int16_t arg4, int32_t arg5, char arg6, /* enum HrMissionResult::D_RESULT_TYPE */ uint32_t arg7, int16_t arg8, int16_t arg9)
	{
		_dAppearMissionResult_HrScreenStatus__QAE_NIFFHCW4D_RESULT_TYPE_HrMissionResult__FF_Z mFunc = (_dAppearMissionResult_HrScreenStatus__QAE_NIFFHCW4D_RESULT_TYPE_HrMissionResult__FF_Z)(GameModule + 0x46cf00);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, (enum HrMissionResult::D_RESULT_TYPE)arg7, arg8, arg9);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dLeavingMissionResult(class HrScreenStatus* const this) [?dLeavingMissionResult@HrScreenStatus@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dLeavingMissionResult_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t dLeavingMissionResult()
	{
		_dLeavingMissionResult_HrScreenStatus__QAE_NXZ mFunc = (_dLeavingMissionResult_HrScreenStatus__QAE_NXZ)(GameModule + 0x46d080);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dSetMissionResultCameraPos(class HrScreenStatus* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4) [?dSetMissionResultCameraPos@HrScreenStatus@@QAE_NHAAUVec@@0@Z]
	typedef uint8_t(__thiscall* _dSetMissionResultCameraPos_HrScreenStatus__QAE_NHAAUVec__0_Z)(class HrScreenStatus* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4);
	uint8_t dSetMissionResultCameraPos(int32_t arg2, struct Vec& arg3, struct Vec& arg4)
	{
		_dSetMissionResultCameraPos_HrScreenStatus__QAE_NHAAUVec__0_Z mFunc = (_dSetMissionResultCameraPos_HrScreenStatus__QAE_NHAAUVec__0_Z)(GameModule + 0x46d0c0);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dReStartMissionResult(class HrScreenStatus* const this) [?dReStartMissionResult@HrScreenStatus@@QAE_NXZ]
	typedef uint8_t(__thiscall* _dReStartMissionResult_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t dReStartMissionResult()
	{
		_dReStartMissionResult_HrScreenStatus__QAE_NXZ mFunc = (_dReStartMissionResult_HrScreenStatus__QAE_NXZ)(GameModule + 0x46d130);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BattleSimplMessClear(class HrScreenStatus* const this) [?BattleSimplMessClear@HrScreenStatus@@QAEXXZ]
	typedef void(__thiscall* _BattleSimplMessClear_HrScreenStatus__QAEXXZ)(class HrScreenStatus* const thisPtr);
	void BattleSimplMessClear()
	{
		_BattleSimplMessClear_HrScreenStatus__QAEXXZ mFunc = (_BattleSimplMessClear_HrScreenStatus__QAEXXZ)(GameModule + 0x46d150);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::mSetBusFight(class HrScreenStatus* const this, uint8_t arg2) [?mSetBusFight@HrScreenStatus@@QAEX_N@Z]
	typedef void(__thiscall* _mSetBusFight_HrScreenStatus__QAEX_N_Z)(class HrScreenStatus* const thisPtr, uint8_t arg2);
	void mSetBusFight(uint8_t arg2)
	{
		_mSetBusFight_HrScreenStatus__QAEX_N_Z mFunc = (_mSetBusFight_HrScreenStatus__QAEX_N_Z)(GameModule + 0x46d190);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dAppear(class HrScreenStatus* const this) [?dAppear@HrScreenStatus@@QAEXXZ]
	typedef void(__thiscall* _dAppear_HrScreenStatus__QAEXXZ)(class HrScreenStatus* const thisPtr);
	void dAppear()
	{
		_dAppear_HrScreenStatus__QAEXXZ mFunc = (_dAppear_HrScreenStatus__QAEXXZ)(GameModule + 0x46d1a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dLeaving(class HrScreenStatus* const this, uint8_t arg2, enum HrScreenStatus::D_STATVAL_TYPE arg3) [?dLeaving@HrScreenStatus@@QAEX_NW4D_STATVAL_TYPE@1@@Z]
	typedef void(__thiscall* _dLeaving_HrScreenStatus__QAEX_NW4D_STATVAL_TYPE_1__Z)(class HrScreenStatus* const thisPtr, uint8_t arg2, enum HrScreenStatus::D_STATVAL_TYPE arg3);
	void dLeaving(uint8_t arg2, /* enum HrScreenStatus::D_STATVAL_TYPE */ uint32_t arg3)
	{
		_dLeaving_HrScreenStatus__QAEX_NW4D_STATVAL_TYPE_1__Z mFunc = (_dLeaving_HrScreenStatus__QAEX_NW4D_STATVAL_TYPE_1__Z)(GameModule + 0x46d3b0);
		return mFunc(this, arg2, (enum HrScreenStatus::D_STATVAL_TYPE)arg3);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::dAppearLog(class HrScreenStatus* const this, int32_t arg2, enum HrScreenStatus::E_LOG_DOID arg3) [?dAppearLog@HrScreenStatus@@QAE_NHW4E_LOG_DOID@1@@Z]
	typedef uint8_t(__thiscall* _dAppearLog_HrScreenStatus__QAE_NHW4E_LOG_DOID_1__Z)(class HrScreenStatus* const thisPtr, int32_t arg2, enum HrScreenStatus::E_LOG_DOID arg3);
	uint8_t dAppearLog(int32_t arg2, /* enum HrScreenStatus::E_LOG_DOID */ uint32_t arg3)
	{
		_dAppearLog_HrScreenStatus__QAE_NHW4E_LOG_DOID_1__Z mFunc = (_dAppearLog_HrScreenStatus__QAE_NHW4E_LOG_DOID_1__Z)(GameModule + 0x46d610);
		return mFunc(this, arg2, (enum HrScreenStatus::E_LOG_DOID)arg3);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BalloonTerminateStage(class HrScreenStatus* const this) [?BalloonTerminateStage@HrScreenStatus@@QAEXXZ]
	typedef void(__thiscall* _BalloonTerminateStage_HrScreenStatus__QAEXXZ)(class HrScreenStatus* const thisPtr);
	void BalloonTerminateStage()
	{
		_BalloonTerminateStage_HrScreenStatus__QAEXXZ mFunc = (_BalloonTerminateStage_HrScreenStatus__QAEXXZ)(GameModule + 0x46d770);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::dAppearSelect(class HrScreenStatus* const this, enum HrScreenStatus::D_STATVAL_TYPE arg2, uint8_t arg3, enum HrScreenStatus::D_CHECKPOINT_TYPE arg4) [?dAppearSelect@HrScreenStatus@@QAEXW4D_STATVAL_TYPE@1@_NW4D_CHECKPOINT_TYPE@1@@Z]
	typedef void(__thiscall* _dAppearSelect_HrScreenStatus__QAEXW4D_STATVAL_TYPE_1__NW4D_CHECKPOINT_TYPE_1__Z)(class HrScreenStatus* const thisPtr, enum HrScreenStatus::D_STATVAL_TYPE arg2, uint8_t arg3, enum HrScreenStatus::D_CHECKPOINT_TYPE arg4);
	void dAppearSelect(/* enum HrScreenStatus::D_STATVAL_TYPE */ uint32_t arg2, uint8_t arg3, /* enum HrScreenStatus::D_CHECKPOINT_TYPE */ uint32_t arg4)
	{
		_dAppearSelect_HrScreenStatus__QAEXW4D_STATVAL_TYPE_1__NW4D_CHECKPOINT_TYPE_1__Z mFunc = (_dAppearSelect_HrScreenStatus__QAEXW4D_STATVAL_TYPE_1__NW4D_CHECKPOINT_TYPE_1__Z)(GameModule + 0x46d8e0);
		return mFunc(this, (enum HrScreenStatus::D_STATVAL_TYPE)arg2, arg3, (enum HrScreenStatus::D_CHECKPOINT_TYPE)arg4);
	}
	// [Function] void __convention("thiscall") HrScreenStatus::BalloonInitializeStage(class HrScreenStatus* const this, class ghmResGroup* arg2) [?BalloonInitializeStage@HrScreenStatus@@QAEXPAVghmResGroup@@@Z]
	typedef void(__thiscall* _BalloonInitializeStage_HrScreenStatus__QAEXPAVghmResGroup___Z)(class HrScreenStatus* const thisPtr, class ghmResGroup* arg2);
	void BalloonInitializeStage(class ghmResGroup* arg2)
	{
		_BalloonInitializeStage_HrScreenStatus__QAEXPAVghmResGroup___Z mFunc = (_BalloonInitializeStage_HrScreenStatus__QAEXPAVghmResGroup___Z)(GameModule + 0x46dbc0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") HrScreenStatus::IsInGameMenuDisp(class HrScreenStatus* const this) [?IsInGameMenuDisp@HrScreenStatus@@QAE_NXZ]
	typedef uint8_t(__thiscall* _IsInGameMenuDisp_HrScreenStatus__QAE_NXZ)(class HrScreenStatus* const thisPtr);
	uint8_t IsInGameMenuDisp()
	{
		_IsInGameMenuDisp_HrScreenStatus__QAE_NXZ mFunc = (_IsInGameMenuDisp_HrScreenStatus__QAE_NXZ)(GameModule + 0x46dc80);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") HrScreenStatus::dGetMissionResultStat(class HrScreenStatus* const this) [?dGetMissionResultStat@HrScreenStatus@@QAEHXZ]
	typedef int32_t(__thiscall* _dGetMissionResultStat_HrScreenStatus__QAEHXZ)(class HrScreenStatus* const thisPtr);
	int32_t dGetMissionResultStat()
	{
		_dGetMissionResultStat_HrScreenStatus__QAEHXZ mFunc = (_dGetMissionResultStat_HrScreenStatus__QAEHXZ)(GameModule + 0x46dc90);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") HrScreenStatus::dGetMissionResultMode(class HrScreenStatus* const this) [?dGetMissionResultMode@HrScreenStatus@@QAEHXZ]
	typedef int32_t(__thiscall* _dGetMissionResultMode_HrScreenStatus__QAEHXZ)(class HrScreenStatus* const thisPtr);
	int32_t dGetMissionResultMode()
	{
		_dGetMissionResultMode_HrScreenStatus__QAEHXZ mFunc = (_dGetMissionResultMode_HrScreenStatus__QAEHXZ)(GameModule + 0x46dcc0);
		return mFunc(this);
	}
	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrScreenStatus [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrScreenStatus& InObject)
	{
		State = InObject.State;
		Map = InObject.Map;
		MapScaleType = InObject.MapScaleType;
		ScreenStatusBalloon = InObject.ScreenStatusBalloon;
		UnknownLanguageGroupResources = InObject.UnknownLanguageGroupResources;
		UnknownBalloonInitializeStageFlag = InObject.UnknownBalloonInitializeStageFlag;
		UnknownMissionTaskPointer = InObject.UnknownMissionTaskPointer;
		ScreenStatusSlot = InObject.ScreenStatusSlot;
		SimpleMessage = InObject.SimpleMessage;
		BattleSimpleMessagePtr = InObject.BattleSimpleMessagePtr;
		DrawFlag = InObject.DrawFlag;
		BusFight = InObject.BusFight;
		MiniMapVisible = InObject.MiniMapVisible;
		RevengeMissionAllEnmNum = InObject.RevengeMissionAllEnmNum;
		HealthFlag = InObject.HealthFlag;
		BatteryFlag = InObject.BatteryFlag;
		TensionHud = InObject.TensionHud;
		MoneyHud = InObject.MoneyHud;
		SpeedMeterFlag = InObject.SpeedMeterFlag;
		SettingBGMVolume = InObject.SettingBGMVolume;
		SettingSEVolume = InObject.SettingSEVolume;
		SettingMiniMap = InObject.SettingMiniMap;
		SettingPower = InObject.SettingPower;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrScreenStatus>("HrScreenStatus")
			.addFunction("__tostring", &HrScreenStatus::ToString)
			.addFunction("GetPtrAddr", &HrScreenStatus::GetPtrAddr)
			.addProperty("State", &HrScreenStatus::State)
			.addProperty("Map", &HrScreenStatus::Map)
			.addProperty("MapScaleType", &HrScreenStatus::MapScaleType)
			.addProperty("ScreenStatusBalloon", &HrScreenStatus::ScreenStatusBalloon)
			.addProperty("UnknownLanguageGroupResources", &HrScreenStatus::UnknownLanguageGroupResources)
			.addProperty("UnknownBalloonInitializeStageFlag", &HrScreenStatus::UnknownBalloonInitializeStageFlag)
			.addProperty("UnknownMissionTaskPointer", &HrScreenStatus::UnknownMissionTaskPointer)
			.addProperty("ScreenStatusSlot", &HrScreenStatus::ScreenStatusSlot)
			.addProperty("SimpleMessage", &HrScreenStatus::SimpleMessage)
			.addProperty("BattleSimpleMessagePtr", &HrScreenStatus::BattleSimpleMessagePtr)
			.addProperty("DrawFlag", &HrScreenStatus::DrawFlag)
			.addProperty("BusFight", &HrScreenStatus::BusFight)
			.addProperty("MiniMapVisible", &HrScreenStatus::MiniMapVisible)
			.addProperty("RevengeMissionAllEnmNum", &HrScreenStatus::RevengeMissionAllEnmNum)
			.addProperty("HealthFlag", &HrScreenStatus::HealthFlag)
			.addProperty("BatteryFlag", &HrScreenStatus::BatteryFlag)
			.addProperty("TensionHud", &HrScreenStatus::TensionHud)
			.addProperty("MoneyHud", &HrScreenStatus::MoneyHud)
			.addProperty("SpeedMeterFlag", &HrScreenStatus::SpeedMeterFlag)
			.addProperty("SettingBGMVolume", &HrScreenStatus::SettingBGMVolume)
			.addProperty("SettingSEVolume", &HrScreenStatus::SettingSEVolume)
			.addProperty("SettingMiniMap", &HrScreenStatus::SettingMiniMap)
			.addProperty("SettingPower", &HrScreenStatus::SettingPower)
			.addFunction("GetMap", &HrScreenStatus::GetMap)
			.addFunction("SetStatusBatterySE_Flag", &HrScreenStatus::SetStatusBatterySE_Flag)
			.addFunction("SetStatusMAXBatterySEStopFlag", &HrScreenStatus::SetStatusMAXBatterySEStopFlag)
			.addFunction("SetRevengeMissionAllEnmNum", &HrScreenStatus::SetRevengeMissionAllEnmNum)
			.addFunction("GetSlot", &HrScreenStatus::GetSlot)
			.addFunction("SetStatusProcess", &HrScreenStatus::SetStatusProcess)
			.addFunction("GetRevengeMissionAllEnmNum", &HrScreenStatus::GetRevengeMissionAllEnmNum)
			.addFunction("SetSettingBGMVolume", &HrScreenStatus::SetSettingBGMVolume)
			.addFunction("SetSettingSEVolume", &HrScreenStatus::SetSettingSEVolume)
			.addFunction("SetSettingMiniMap", &HrScreenStatus::SetSettingMiniMap)
			.addFunction("SetSettingPower", &HrScreenStatus::SetSettingPower)
			.addFunction("GetStatusBatteryParam", &HrScreenStatus::GetStatusBatteryParam)
			.addFunction("SetStatusDataLoadFlag", &HrScreenStatus::SetStatusDataLoadFlag)
			.addFunction("GetStatusBatterySE_Flag", &HrScreenStatus::GetStatusBatterySE_Flag)
			.addFunction("GetSettingBGMVolume", &HrScreenStatus::GetSettingBGMVolume)
			.addFunction("GetScrollBarTexture", &HrScreenStatus::GetScrollBarTexture)
			.addFunction("GetMapFrameTex", &HrScreenStatus::GetMapFrameTex)
			.addFunction("GetSettingPower", &HrScreenStatus::GetSettingPower)
			.addStaticFunction("TestCreate", &HrScreenStatus::TestCreate)
			.addStaticFunction("CheckUnionTerminate", &HrScreenStatus::CheckUnionTerminate)
			.addStaticFunction("UnionTerminate", &HrScreenStatus::UnionTerminate)
			.addStaticFunction("CheckUnionInitialize", &HrScreenStatus::CheckUnionInitialize)
			.addStaticFunction("UnionInitialize", &HrScreenStatus::UnionInitialize)
			.addFunction("dValUp", &HrScreenStatus::dValUp)
			.addFunction("dSetMissionResultSceneTime", &HrScreenStatus::dSetMissionResultSceneTime)
			.addFunction("BalloonCheckDraw", &HrScreenStatus::BalloonCheckDraw)
			// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("dLog_ScissoringBoxAnimationProc", &HrScreenStatus::dLog_ScissoringBoxAnimationProc)
			.addFunction("RenderProcess", &HrScreenStatus::RenderProcess)
			.addFunction("DispCheckPointMessage", &HrScreenStatus::DispCheckPointMessage)
			.addFunction("IsDrawKillCount", &HrScreenStatus::IsDrawKillCount)
			.addFunction("DrawSubMissionInfo", &HrScreenStatus::DrawSubMissionInfo)
			// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addStaticFunction("RenderProcessFront", &HrScreenStatus::RenderProcessFront)
			.addFunction("FrameProcess", &HrScreenStatus::FrameProcess)
			.addFunction("dLeavingExceptBattery", &HrScreenStatus::dLeavingExceptBattery)
			.addFunction("Terminate", &HrScreenStatus::Terminate)
			.addStaticFunction("GetLanguageGroup", &HrScreenStatus::GetLanguageGroup)
			.addFunction("BalloonIsAppear", &HrScreenStatus::BalloonIsAppear)
			.addFunction("dAppearInGameMenu", &HrScreenStatus::dAppearInGameMenu)
			.addFunction("DemoButtonAppear", &HrScreenStatus::DemoButtonAppear)
			.addFunction("DemoButtonLeave", &HrScreenStatus::DemoButtonLeave)
			.addStaticFunction("Create", &HrScreenStatus::Create)
			.addFunction("dSetType", &HrScreenStatus::dSetType)
			.addFunction("dCheckDrawAll", &HrScreenStatus::dCheckDrawAll)
			.addFunction("dCheckDraw", &HrScreenStatus::dCheckDraw)
			.addFunction("dGetMissionResultType", &HrScreenStatus::dGetMissionResultType)
			.addFunction("dLeavingSelect", &HrScreenStatus::dLeavingSelect)
			.addFunction("dGetHpScale", &HrScreenStatus::dGetHpScale)
			.addFunction("BattleSimplMessage", &HrScreenStatus::BattleSimplMessage)
			.addFunction("BalloonLeaveAll", &HrScreenStatus::BalloonLeaveAll)
			.addFunction("BalloonAppear", &HrScreenStatus::BalloonAppear)
			.addFunction("BalloonLeave", &HrScreenStatus::BalloonLeave)
			.addFunction("dAppearMissionResult", &HrScreenStatus::dAppearMissionResult)
			.addFunction("dLeavingMissionResult", &HrScreenStatus::dLeavingMissionResult)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("dSetMissionResultCameraPos", &HrScreenStatus::dSetMissionResultCameraPos)
			.addFunction("dReStartMissionResult", &HrScreenStatus::dReStartMissionResult)
			.addFunction("BattleSimplMessClear", &HrScreenStatus::BattleSimplMessClear)
			.addFunction("mSetBusFight", &HrScreenStatus::mSetBusFight)
			.addFunction("dAppear", &HrScreenStatus::dAppear)
			.addFunction("dLeaving", &HrScreenStatus::dLeaving)
			.addFunction("dAppearLog", &HrScreenStatus::dAppearLog)
			.addFunction("BalloonTerminateStage", &HrScreenStatus::BalloonTerminateStage)
			.addFunction("dAppearSelect", &HrScreenStatus::dAppearSelect)
			.addFunction("BalloonInitializeStage", &HrScreenStatus::BalloonInitializeStage)
			.addFunction("IsInGameMenuDisp", &HrScreenStatus::IsInGameMenuDisp)
			.addFunction("dGetMissionResultStat", &HrScreenStatus::dGetMissionResultStat)
			.addFunction("dGetMissionResultMode", &HrScreenStatus::dGetMissionResultMode)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrScreenStatus::State) == 4, "expected HrScreenStatus::State to be size 4");
static_assert(sizeof(HrScreenStatus::Map) == 4, "expected HrScreenStatus::Map to be size 4");
static_assert(sizeof(HrScreenStatus::MapScaleType) == 4, "expected HrScreenStatus::MapScaleType to be size 4");
static_assert(sizeof(HrScreenStatus::ScreenStatusBalloon) == 4, "expected HrScreenStatus::ScreenStatusBalloon to be size 4");
static_assert(sizeof(HrScreenStatus::UnknownLanguageGroupResources) == 4, "expected HrScreenStatus::UnknownLanguageGroupResources to be size 4");
static_assert(sizeof(HrScreenStatus::UnknownBalloonInitializeStageFlag) == 1, "expected HrScreenStatus::UnknownBalloonInitializeStageFlag to be size 1");
static_assert(sizeof(HrScreenStatus::UnknownMissionTaskPointer) == 4, "expected HrScreenStatus::UnknownMissionTaskPointer to be size 4");
static_assert(sizeof(HrScreenStatus::ScreenStatusSlot) == 4, "expected HrScreenStatus::ScreenStatusSlot to be size 4");
static_assert(sizeof(HrScreenStatus::SimpleMessage) == 4, "expected HrScreenStatus::SimpleMessage to be size 4");
static_assert(sizeof(HrScreenStatus::BattleSimpleMessagePtr) == 4, "expected HrScreenStatus::BattleSimpleMessagePtr to be size 4");
static_assert(sizeof(HrScreenStatus::DrawFlag) == 2, "expected HrScreenStatus::DrawFlag to be size 2");
static_assert(sizeof(HrScreenStatus::BusFight) == 1, "expected HrScreenStatus::BusFight to be size 1");
static_assert(sizeof(HrScreenStatus::MiniMapVisible) == 1, "expected HrScreenStatus::MiniMapVisible to be size 1");
static_assert(sizeof(HrScreenStatus::RevengeMissionAllEnmNum) == 4, "expected HrScreenStatus::RevengeMissionAllEnmNum to be size 4");
static_assert(sizeof(HrScreenStatus::HealthFlag) == 1, "expected HrScreenStatus::HealthFlag to be size 1");
static_assert(sizeof(HrScreenStatus::BatteryFlag) == 1, "expected HrScreenStatus::BatteryFlag to be size 1");
static_assert(sizeof(HrScreenStatus::TensionHud) == 432, "expected HrScreenStatus::TensionHud to be size 432");
static_assert(sizeof(HrScreenStatus::MoneyHud) == 668, "expected HrScreenStatus::MoneyHud to be size 668");
static_assert(sizeof(HrScreenStatus::SpeedMeterFlag) == 1, "expected HrScreenStatus::SpeedMeterFlag to be size 1");
static_assert(sizeof(HrScreenStatus::SettingBGMVolume) == 4, "expected HrScreenStatus::SettingBGMVolume to be size 4");
static_assert(sizeof(HrScreenStatus::SettingSEVolume) == 4, "expected HrScreenStatus::SettingSEVolume to be size 4");
static_assert(sizeof(HrScreenStatus::SettingMiniMap) == 1, "expected HrScreenStatus::SettingMiniMap to be size 1");
static_assert(sizeof(HrScreenStatus::SettingPower) == 4, "expected HrScreenStatus::SettingPower to be size 4");
static_assert(sizeof(HrScreenStatus) == 0x3870, "expected HrScreenStatus to be size 0x3870");

// [Structure] class HrTask
class HrTask
{
public:
	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData_0[8];

public:
	// <uint32_t MagicNumber, offset 0x8>
	uint32_t MagicNumber = 0;

	// <Unidentified data segment, offset 0xc>
private:
	char _UnidentifiedData_12[68];

public:
	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrTask [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrTask& InObject)
	{
		MagicNumber = InObject.MagicNumber;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrTask>("HrTask")
			.addFunction("__tostring", &HrTask::ToString)
			.addFunction("GetPtrAddr", &HrTask::GetPtrAddr)
			.addProperty("MagicNumber", &HrTask::MagicNumber)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrTask::MagicNumber) == 4, "expected HrTask::MagicNumber to be size 4");
static_assert(sizeof(HrTask) == 0x50, "expected HrTask to be size 0x50");

// [Structure] class EE::SmartPtr<ID3D11DepthStencilView>
namespace EE
{
	template<typename T>
	class SmartPtr
	{
	public:
		/// Struct member variables

		// <struct ID3D11DepthStencilView* m_pObject, offset 0x0>
		T* m_pObject = nullptr;

		/// 0 Functions

		/// Meta

		std::string ToString() const { std::stringstream stream; stream << "class EE::SmartPtr [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
		int GetPtrAddr() const { return (int)this; }
		void CopyFrom(EE::SmartPtr<ID3D11DepthStencilView>& InObject)
		{
			m_pObject = InObject.m_pObject;
		}
		// Exporting templated types to Lua currently not supported.
		// static void BindLua(luabridge::Namespace& NS)
	};
}
static_assert(sizeof(EE::SmartPtr<ID3D11DepthStencilView>::m_pObject) == 4, "expected EE::SmartPtr<ID3D11DepthStencilView>::m_pObject to be size 4");
static_assert(sizeof(EE::SmartPtr<ID3D11DepthStencilView>) == 0x4, "expected EE::SmartPtr<ID3D11DepthStencilView> to be size 0x4");

// [Structure] union GXSamplerStuff
union GXSamplerStuff
{
public:
	/// Struct member variables

	// <uint32_t wrapS, offset 0x0>
	uint32_t wrapS = 0;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "union GXSamplerStuff [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(GXSamplerStuff& InObject)
	{
		wrapS = InObject.wrapS;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GXSamplerStuff>("GXSamplerStuff")
			.addFunction("__tostring", &GXSamplerStuff::ToString)
			.addFunction("GetPtrAddr", &GXSamplerStuff::GetPtrAddr)
			.addProperty("wrapS", &GXSamplerStuff::wrapS)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXSamplerStuff::wrapS) == 4, "expected GXSamplerStuff::wrapS to be size 4");
static_assert(sizeof(GXSamplerStuff) == 0x4, "expected GXSamplerStuff to be size 0x4");

// [Structure] class EE::RefObject
namespace EE
{
	class RefObject
	{
	public:
		/// Struct member variables

		// <void* (* field_0)[0x1], offset 0x0>
		void* (* field_0)[0x1];

		// <int32_t volatile refCount, offset 0x4>
		int32_t volatile refCount;

		/// 0 Functions

		/// Meta

		std::string ToString() const { std::stringstream stream; stream << "class EE::RefObject [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
		int GetPtrAddr() const { return (int)this; }
		void CopyFrom(EE::RefObject& InObject)
		{
			refCount = InObject.refCount;
		}
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<RefObject>("EE_RefObject")
				.addFunction("__tostring", &EE::RefObject::ToString)
				.addFunction("GetPtrAddr", &EE::RefObject::GetPtrAddr)
				// delegates are not supported in LuaBridge
				//.addProperty("field_0", &EE::RefObject::field_0)
				// volatile not supported in LuaBridge and needs a getter
				//.addProperty("refCount", &EE::RefObject::refCount)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(EE::RefObject::field_0) == 4, "expected EE::RefObject::field_0 to be size 4");
static_assert(sizeof(EE::RefObject::refCount) == 4, "expected EE::RefObject::refCount to be size 4");
static_assert(sizeof(EE::RefObject) == 0x8, "expected EE::RefObject to be size 0x8");

// [Structure] class GXTexture
class GXTexture : public EE::RefObject
{
public:
	// [Structure] struct GXTexture::GXSpecs
	struct GXSpecs
	{
	public:
		/// Struct member variables

		// <uint16_t width, offset 0x0>
		uint16_t width = 0;

		// <uint16_t height, offset 0x2>
		uint16_t height = 0;

		// <uint16_t rtWidth, offset 0x4>
		uint16_t rtWidth = 0;

		// <uint16_t rtHeight, offset 0x6>
		uint16_t rtHeight = 0;

		// <enum _GXTexFmt format, offset 0x8>
		enum _GXTexFmt format;

		// <uint8_t mipmap, offset 0xc>
		uint8_t mipmap = 0;

		// <uint8_t bias_clamp, offset 0xd>
		uint8_t bias_clamp = 0;

		// <uint8_t do_edge_lod, offset 0xe>
		uint8_t do_edge_lod = 0;

		// <Unidentified data segment, offset 0xf>
	private:
		char _UnidentifiedData_15[1];

	public:
		// <uint32_t hash, offset 0x10>
		uint32_t hash = 0;

		/// 0 Functions

		/// Meta

		std::string ToString() const { std::stringstream stream; stream << "struct GXTexture::GXSpecs [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
		int GetPtrAddr() const { return (int)this; }
		void CopyFrom(GXTexture::GXSpecs& InObject)
		{
			width = InObject.width;
			height = InObject.height;
			rtWidth = InObject.rtWidth;
			rtHeight = InObject.rtHeight;
			format = InObject.format;
			mipmap = InObject.mipmap;
			bias_clamp = InObject.bias_clamp;
			do_edge_lod = InObject.do_edge_lod;
			hash = InObject.hash;
		}
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<GXSpecs>("GXTexture_GXSpecs")
				.addFunction("__tostring", &GXTexture::GXSpecs::ToString)
				.addFunction("GetPtrAddr", &GXTexture::GXSpecs::GetPtrAddr)
				.addProperty("width", &GXTexture::GXSpecs::width)
				.addProperty("height", &GXTexture::GXSpecs::height)
				.addProperty("rtWidth", &GXTexture::GXSpecs::rtWidth)
				.addProperty("rtHeight", &GXTexture::GXSpecs::rtHeight)
				.addProperty("format", &GXTexture::GXSpecs::format)
				.addProperty("mipmap", &GXTexture::GXSpecs::mipmap)
				.addProperty("bias_clamp", &GXTexture::GXSpecs::bias_clamp)
				.addProperty("do_edge_lod", &GXTexture::GXSpecs::do_edge_lod)
				.addProperty("hash", &GXTexture::GXSpecs::hash)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(GXTexture::GXSpecs::width) == 2, "expected GXTexture::GXSpecs::width to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::height) == 2, "expected GXTexture::GXSpecs::height to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::rtWidth) == 2, "expected GXTexture::GXSpecs::rtWidth to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::rtHeight) == 2, "expected GXTexture::GXSpecs::rtHeight to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::format) == 4, "expected GXTexture::GXSpecs::format to be size 4");
	static_assert(sizeof(GXTexture::GXSpecs::mipmap) == 1, "expected GXTexture::GXSpecs::mipmap to be size 1");
	static_assert(sizeof(GXTexture::GXSpecs::bias_clamp) == 1, "expected GXTexture::GXSpecs::bias_clamp to be size 1");
	static_assert(sizeof(GXTexture::GXSpecs::do_edge_lod) == 1, "expected GXTexture::GXSpecs::do_edge_lod to be size 1");
	static_assert(sizeof(GXTexture::GXSpecs::hash) == 4, "expected GXTexture::GXSpecs::hash to be size 4");
	static_assert(sizeof(GXTexture::GXSpecs) == 0x14, "expected GXTexture::GXSpecs to be size 0x14");

	/// Struct member variables

	// <class EE::RefObject field_0, offset 0x0>
	// class EE::RefObject Super;

	// <uint32_t marker, offset 0x8>
	uint32_t marker = 0;

	// <union GXSamplerStuff sampler, offset 0xc>
	union GXSamplerStuff sampler;

	// <class EE::SmartPtr<ID3D11ShaderResourceView> textureView, offset 0x10>
	class EE::SmartPtr<ID3D11ShaderResourceView> textureView;

	// <uint32_t textureViewId, offset 0x14>
	uint32_t textureViewId = 0;

	// <struct GXTexture::GXSpecs gxSpecs, offset 0x18>
	struct GXTexture::GXSpecs gxSpecs;

	// <class EE::SmartPtr<ID3D11Texture2D> texture, offset 0x2c>
	class EE::SmartPtr<ID3D11Texture2D> texture;

	// <class EE::SmartPtr<ID3D11RenderTargetView> renderTargetView, offset 0x30>
	class EE::SmartPtr<ID3D11RenderTargetView> renderTargetView;

	// <class EE::SmartPtr<ID3D11DepthStencilView> depthStencilView, offset 0x34>
	class EE::SmartPtr<ID3D11DepthStencilView> depthStencilView;

	// <class EE::SmartPtr<ID3D11Texture2D> stagingTex, offset 0x38>
	class EE::SmartPtr<ID3D11Texture2D> stagingTex;

	// <struct D3D11_MAPPED_SUBRESOURCE stagingTexMap, offset 0x3c>
	struct D3D11_MAPPED_SUBRESOURCE stagingTexMap;

	// <struct EE::OptListNode<GXTexture *> renderTargetListNode, offset 0x48>
	struct EE::OptListNode<GXTexture *> renderTargetListNode;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class GXTexture [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(GXTexture& InObject)
	{
		marker = InObject.marker;
		sampler = InObject.sampler;
		textureView = InObject.textureView;
		textureViewId = InObject.textureViewId;
		gxSpecs = InObject.gxSpecs;
		texture = InObject.texture;
		renderTargetView = InObject.renderTargetView;
		depthStencilView = InObject.depthStencilView;
		stagingTex = InObject.stagingTex;
		stagingTexMap = InObject.stagingTexMap;
		renderTargetListNode = InObject.renderTargetListNode;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<GXTexture, EE::RefObject>("GXTexture")
			.addFunction("__tostring", &GXTexture::ToString)
			.addFunction("GetPtrAddr", &GXTexture::GetPtrAddr)
			.addProperty("marker", &GXTexture::marker)
			.addProperty("sampler", &GXTexture::sampler)
			.addProperty("textureView", &GXTexture::textureView)
			.addProperty("textureViewId", &GXTexture::textureViewId)
			.addProperty("gxSpecs", &GXTexture::gxSpecs)
			.addProperty("texture", &GXTexture::texture)
			.addProperty("renderTargetView", &GXTexture::renderTargetView)
			.addProperty("depthStencilView", &GXTexture::depthStencilView)
			.addProperty("stagingTex", &GXTexture::stagingTex)
			.addProperty("stagingTexMap", &GXTexture::stagingTexMap)
			.addProperty("renderTargetListNode", &GXTexture::renderTargetListNode)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXTexture::marker) == 4, "expected GXTexture::marker to be size 4");
static_assert(sizeof(GXTexture::sampler) == 4, "expected GXTexture::sampler to be size 4");
static_assert(sizeof(GXTexture::textureView) == 4, "expected GXTexture::textureView to be size 4");
static_assert(sizeof(GXTexture::textureViewId) == 4, "expected GXTexture::textureViewId to be size 4");
static_assert(sizeof(GXTexture::gxSpecs) == 20, "expected GXTexture::gxSpecs to be size 20");
static_assert(sizeof(GXTexture::texture) == 4, "expected GXTexture::texture to be size 4");
static_assert(sizeof(GXTexture::renderTargetView) == 4, "expected GXTexture::renderTargetView to be size 4");
static_assert(sizeof(GXTexture::depthStencilView) == 4, "expected GXTexture::depthStencilView to be size 4");
static_assert(sizeof(GXTexture::stagingTex) == 4, "expected GXTexture::stagingTex to be size 4");
static_assert(sizeof(GXTexture::stagingTexMap) == 12, "expected GXTexture::stagingTexMap to be size 12");
static_assert(sizeof(GXTexture::renderTargetListNode) == 12, "expected GXTexture::renderTargetListNode to be size 12");
static_assert(sizeof(GXTexture) == 0x54, "expected GXTexture to be size 0x54");

// [Structure] class GtSimplMes
class GtSimplMes
{
public:
	/// Struct member variables

	// <class ghmGcFile* mpMSFile, offset 0x0>
	class ghmGcFile* mpMSFile = nullptr;

	// <void* mpMesRes, offset 0x4>
	void* mpMesRes = nullptr;

	// <uint32_t mHandol, offset 0x8>
	uint32_t mHandol = 0;

	// <int32_t mInitScane, offset 0xc>
	int32_t mInitScane = 0;

	// <uint8_t mInitFlg, offset 0x10>
	uint8_t mInitFlg = 0;

	// <Unidentified data segment, offset 0x11>
private:
	char _UnidentifiedData_17[3];

public:
	// <struct BATTLESIMPLMESS_SET* mpMessTop, offset 0x14>
	struct BATTLESIMPLMESS_SET* mpMessTop = nullptr;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class GtSimplMes [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(GtSimplMes& InObject)
	{
		mpMSFile = InObject.mpMSFile;
		mpMesRes = InObject.mpMesRes;
		mHandol = InObject.mHandol;
		mInitScane = InObject.mInitScane;
		mInitFlg = InObject.mInitFlg;
		mpMessTop = InObject.mpMessTop;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GtSimplMes>("GtSimplMes")
			.addFunction("__tostring", &GtSimplMes::ToString)
			.addFunction("GetPtrAddr", &GtSimplMes::GetPtrAddr)
			.addProperty("mpMSFile", &GtSimplMes::mpMSFile)
			// void type not supported in LuaBridge
			//.addProperty("mpMesRes", &GtSimplMes::mpMesRes)
			.addProperty("mHandol", &GtSimplMes::mHandol)
			.addProperty("mInitScane", &GtSimplMes::mInitScane)
			.addProperty("mInitFlg", &GtSimplMes::mInitFlg)
			.addProperty("mpMessTop", &GtSimplMes::mpMessTop)
		.endClass();
	}
#endif
};
static_assert(sizeof(GtSimplMes::mpMSFile) == 4, "expected GtSimplMes::mpMSFile to be size 4");
static_assert(sizeof(GtSimplMes::mpMesRes) == 4, "expected GtSimplMes::mpMesRes to be size 4");
static_assert(sizeof(GtSimplMes::mHandol) == 4, "expected GtSimplMes::mHandol to be size 4");
static_assert(sizeof(GtSimplMes::mInitScane) == 4, "expected GtSimplMes::mInitScane to be size 4");
static_assert(sizeof(GtSimplMes::mInitFlg) == 1, "expected GtSimplMes::mInitFlg to be size 1");
static_assert(sizeof(GtSimplMes::mpMessTop) == 4, "expected GtSimplMes::mpMessTop to be size 4");
static_assert(sizeof(GtSimplMes) == 0x18, "expected GtSimplMes to be size 0x18");

// [Structure] struct DVDCommandBlock
struct DVDCommandBlock
{
public:
	/// Struct member variables

	// <DVDCommandBlock* next, offset 0x0>
	DVDCommandBlock* next = nullptr;

	// <DVDCommandBlock* prev, offset 0x4>
	DVDCommandBlock* prev = nullptr;

	// <uint32_t command, offset 0x8>
	uint32_t command = 0;

	// <int32_t volatile state, offset 0xc>
	int32_t volatile state;

	// <uint32_t offset, offset 0x10>
	uint32_t offset = 0;

	// <uint32_t length, offset 0x14>
	uint32_t length = 0;

	// <void* addr, offset 0x18>
	void* addr = nullptr;

	// <uint32_t currTransferSize, offset 0x1c>
	uint32_t currTransferSize = 0;

	// <uint32_t transferredSize, offset 0x20>
	uint32_t transferredSize = 0;

	// <struct DVDDiskID* id, offset 0x24>
	struct DVDDiskID* id = nullptr;

	// <void (* callback)(int32_t, DVDCommandBlock*), offset 0x28>
	void (* callback)(int32_t, DVDCommandBlock*);

	// <void* userData, offset 0x2c>
	void* userData = nullptr;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct DVDCommandBlock [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(DVDCommandBlock& InObject)
	{
		next = InObject.next;
		prev = InObject.prev;
		command = InObject.command;
		state = InObject.state;
		offset = InObject.offset;
		length = InObject.length;
		addr = InObject.addr;
		currTransferSize = InObject.currTransferSize;
		transferredSize = InObject.transferredSize;
		id = InObject.id;
		userData = InObject.userData;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<DVDCommandBlock>("DVDCommandBlock")
			.addFunction("__tostring", &DVDCommandBlock::ToString)
			.addFunction("GetPtrAddr", &DVDCommandBlock::GetPtrAddr)
			.addProperty("next", &DVDCommandBlock::next)
			.addProperty("prev", &DVDCommandBlock::prev)
			.addProperty("command", &DVDCommandBlock::command)
			// volatile not supported in LuaBridge and needs a getter
			//.addProperty("state", &DVDCommandBlock::state)
			.addProperty("offset", &DVDCommandBlock::offset)
			.addProperty("length", &DVDCommandBlock::length)
			// void type not supported in LuaBridge
			//.addProperty("addr", &DVDCommandBlock::addr)
			.addProperty("currTransferSize", &DVDCommandBlock::currTransferSize)
			.addProperty("transferredSize", &DVDCommandBlock::transferredSize)
			.addProperty("id", &DVDCommandBlock::id)
			// delegates are not supported in LuaBridge
			//.addProperty("callback", &DVDCommandBlock::callback)
			// void type not supported in LuaBridge
			//.addProperty("userData", &DVDCommandBlock::userData)
		.endClass();
	}
#endif
};
static_assert(sizeof(DVDCommandBlock::next) == 4, "expected DVDCommandBlock::next to be size 4");
static_assert(sizeof(DVDCommandBlock::prev) == 4, "expected DVDCommandBlock::prev to be size 4");
static_assert(sizeof(DVDCommandBlock::command) == 4, "expected DVDCommandBlock::command to be size 4");
static_assert(sizeof(DVDCommandBlock::state) == 4, "expected DVDCommandBlock::state to be size 4");
static_assert(sizeof(DVDCommandBlock::offset) == 4, "expected DVDCommandBlock::offset to be size 4");
static_assert(sizeof(DVDCommandBlock::length) == 4, "expected DVDCommandBlock::length to be size 4");
static_assert(sizeof(DVDCommandBlock::addr) == 4, "expected DVDCommandBlock::addr to be size 4");
static_assert(sizeof(DVDCommandBlock::currTransferSize) == 4, "expected DVDCommandBlock::currTransferSize to be size 4");
static_assert(sizeof(DVDCommandBlock::transferredSize) == 4, "expected DVDCommandBlock::transferredSize to be size 4");
static_assert(sizeof(DVDCommandBlock::id) == 4, "expected DVDCommandBlock::id to be size 4");
static_assert(sizeof(DVDCommandBlock::callback) == 4, "expected DVDCommandBlock::callback to be size 4");
static_assert(sizeof(DVDCommandBlock::userData) == 4, "expected DVDCommandBlock::userData to be size 4");
static_assert(sizeof(DVDCommandBlock) == 0x30, "expected DVDCommandBlock to be size 0x30");

// [Structure] struct DVDFileInfo
struct DVDFileInfo
{
public:
	/// Struct member variables

	// <struct DVDCommandBlock cb, offset 0x0>
	struct DVDCommandBlock cb;

	// <uint32_t startAddr, offset 0x30>
	uint32_t startAddr = 0;

	// <uint32_t length, offset 0x34>
	uint32_t length = 0;

	// <void (* callback)(int32_t, DVDFileInfo*), offset 0x38>
	void (* callback)(int32_t, DVDFileInfo*);

	// <class EE::SmartPtr<EE::IFile> file, offset 0x3c>
	class EE::SmartPtr<EE::IFile> file;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct DVDFileInfo [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(DVDFileInfo& InObject)
	{
		cb = InObject.cb;
		startAddr = InObject.startAddr;
		length = InObject.length;
		file = InObject.file;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<DVDFileInfo>("DVDFileInfo")
			.addFunction("__tostring", &DVDFileInfo::ToString)
			.addFunction("GetPtrAddr", &DVDFileInfo::GetPtrAddr)
			.addProperty("cb", &DVDFileInfo::cb)
			.addProperty("startAddr", &DVDFileInfo::startAddr)
			.addProperty("length", &DVDFileInfo::length)
			// delegates are not supported in LuaBridge
			//.addProperty("callback", &DVDFileInfo::callback)
			.addProperty("file", &DVDFileInfo::file)
		.endClass();
	}
#endif
};
static_assert(sizeof(DVDFileInfo::cb) == 48, "expected DVDFileInfo::cb to be size 48");
static_assert(sizeof(DVDFileInfo::startAddr) == 4, "expected DVDFileInfo::startAddr to be size 4");
static_assert(sizeof(DVDFileInfo::length) == 4, "expected DVDFileInfo::length to be size 4");
static_assert(sizeof(DVDFileInfo::callback) == 4, "expected DVDFileInfo::callback to be size 4");
static_assert(sizeof(DVDFileInfo::file) == 4, "expected DVDFileInfo::file to be size 4");
static_assert(sizeof(DVDFileInfo) == 0x40, "expected DVDFileInfo to be size 0x40");

// [Structure] class ghmGcFile
class ghmGcFile
{
public:
	// enum ghmGcFile::ghmGcFileState
	enum ghmGcFileState : uint32_t
	{
		// <READFINISH = 0x1>
		READFINISH = 1,

		// <CANCELED = 0x1>
		CANCELED = 1,

		// <CLOSED = 0x0>
		CLOSED = 0,

		// <OPENED = 0x1>
		OPENED = 1,

		// <READ = 0x2>
		READ = 2,

		// <READRETRY = 0x3>
		READRETRY = 3

	};

	// [Structure] struct ghmGcFile::ghmGcFileInfo
	struct ghmGcFileInfo
	{
	public:
		/// Struct member variables

		// <struct DVDFileInfo mFileInfo, offset 0x0>
		struct DVDFileInfo mFileInfo;

		// <int32_t mOffset, offset 0x40>
		int32_t mOffset = 0;

		// <int32_t mLength, offset 0x44>
		int32_t mLength = 0;

		// <int32_t mRequestNo, offset 0x48>
		int32_t mRequestNo = 0;

		// <int32_t volatile mReadStatus, offset 0x4c>
		int32_t volatile mReadStatus;

		// <int32_t volatile mReadResult, offset 0x50>
		int32_t volatile mReadResult;

		// <enum ghmGcFile::ghmGcFileState mState, offset 0x54>
		enum ghmGcFileState mState;

		// <uint8_t mDivRead, offset 0x58>
		uint8_t mDivRead = 0;

		// <Unidentified data segment, offset 0x59>
	private:
		char _UnidentifiedData_89[3];

	public:
		// <int32_t mTotalReadLength, offset 0x5c>
		int32_t mTotalReadLength = 0;

		// <int32_t mOneReadLength, offset 0x60>
		int32_t mOneReadLength = 0;

		// <int32_t mReadOffset, offset 0x64>
		int32_t mReadOffset = 0;

		// <void* mpBuffer, offset 0x68>
		void* mpBuffer = nullptr;

		// <int32_t mReadCount, offset 0x6c>
		int32_t mReadCount = 0;

		// <int32_t mDivNum, offset 0x70>
		int32_t mDivNum = 0;

		/// 0 Functions

		/// Meta

		std::string ToString() const { std::stringstream stream; stream << "struct ghmGcFile::ghmGcFileInfo [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
		int GetPtrAddr() const { return (int)this; }
		void CopyFrom(ghmGcFile::ghmGcFileInfo& InObject)
		{
			mFileInfo = InObject.mFileInfo;
			mOffset = InObject.mOffset;
			mLength = InObject.mLength;
			mRequestNo = InObject.mRequestNo;
			mReadStatus = InObject.mReadStatus;
			mReadResult = InObject.mReadResult;
			mState = InObject.mState;
			mDivRead = InObject.mDivRead;
			mTotalReadLength = InObject.mTotalReadLength;
			mOneReadLength = InObject.mOneReadLength;
			mReadOffset = InObject.mReadOffset;
			mpBuffer = InObject.mpBuffer;
			mReadCount = InObject.mReadCount;
			mDivNum = InObject.mDivNum;
		}
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<ghmGcFileInfo>("ghmGcFile_ghmGcFileInfo")
				.addFunction("__tostring", &ghmGcFile::ghmGcFileInfo::ToString)
				.addFunction("GetPtrAddr", &ghmGcFile::ghmGcFileInfo::GetPtrAddr)
				.addProperty("mFileInfo", &ghmGcFile::ghmGcFileInfo::mFileInfo)
				.addProperty("mOffset", &ghmGcFile::ghmGcFileInfo::mOffset)
				.addProperty("mLength", &ghmGcFile::ghmGcFileInfo::mLength)
				.addProperty("mRequestNo", &ghmGcFile::ghmGcFileInfo::mRequestNo)
				// volatile not supported in LuaBridge and needs a getter
				//.addProperty("mReadStatus", &ghmGcFile::ghmGcFileInfo::mReadStatus)
				// volatile not supported in LuaBridge and needs a getter
				//.addProperty("mReadResult", &ghmGcFile::ghmGcFileInfo::mReadResult)
				.addProperty("mState", &ghmGcFile::ghmGcFileInfo::mState)
				.addProperty("mDivRead", &ghmGcFile::ghmGcFileInfo::mDivRead)
				.addProperty("mTotalReadLength", &ghmGcFile::ghmGcFileInfo::mTotalReadLength)
				.addProperty("mOneReadLength", &ghmGcFile::ghmGcFileInfo::mOneReadLength)
				.addProperty("mReadOffset", &ghmGcFile::ghmGcFileInfo::mReadOffset)
				// void type not supported in LuaBridge
				//.addProperty("mpBuffer", &ghmGcFile::ghmGcFileInfo::mpBuffer)
				.addProperty("mReadCount", &ghmGcFile::ghmGcFileInfo::mReadCount)
				.addProperty("mDivNum", &ghmGcFile::ghmGcFileInfo::mDivNum)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mFileInfo) == 64, "expected ghmGcFile::ghmGcFileInfo::mFileInfo to be size 64");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mOffset) == 4, "expected ghmGcFile::ghmGcFileInfo::mOffset to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mLength) == 4, "expected ghmGcFile::ghmGcFileInfo::mLength to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mRequestNo) == 4, "expected ghmGcFile::ghmGcFileInfo::mRequestNo to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadStatus) == 4, "expected ghmGcFile::ghmGcFileInfo::mReadStatus to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadResult) == 4, "expected ghmGcFile::ghmGcFileInfo::mReadResult to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mState) == 4, "expected ghmGcFile::ghmGcFileInfo::mState to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mDivRead) == 1, "expected ghmGcFile::ghmGcFileInfo::mDivRead to be size 1");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mTotalReadLength) == 4, "expected ghmGcFile::ghmGcFileInfo::mTotalReadLength to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mOneReadLength) == 4, "expected ghmGcFile::ghmGcFileInfo::mOneReadLength to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadOffset) == 4, "expected ghmGcFile::ghmGcFileInfo::mReadOffset to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mpBuffer) == 4, "expected ghmGcFile::ghmGcFileInfo::mpBuffer to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadCount) == 4, "expected ghmGcFile::ghmGcFileInfo::mReadCount to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mDivNum) == 4, "expected ghmGcFile::ghmGcFileInfo::mDivNum to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo) == 0x74, "expected ghmGcFile::ghmGcFileInfo to be size 0x74");

	/// Struct member variables

	// <struct ghmGcFile::ghmGcFileInfo mInfo, offset 0x0>
	struct ghmGcFile::ghmGcFileInfo mInfo;

	// <ghmGcFile* mpPrev, offset 0x74>
	ghmGcFile* mpPrev = nullptr;

	// <ghmGcFile* mpNext, offset 0x78>
	ghmGcFile* mpNext = nullptr;

	// <char mFileName[0x40], offset 0x7c>
	char mFileName[64];

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class ghmGcFile [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(ghmGcFile& InObject)
	{
		mInfo = InObject.mInfo;
		mpPrev = InObject.mpPrev;
		mpNext = InObject.mpNext;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcFile>("ghmGcFile")
			.addFunction("__tostring", &ghmGcFile::ToString)
			.addFunction("GetPtrAddr", &ghmGcFile::GetPtrAddr)
			.addProperty("mInfo", &ghmGcFile::mInfo)
			.addProperty("mpPrev", &ghmGcFile::mpPrev)
			.addProperty("mpNext", &ghmGcFile::mpNext)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mFileName", &ghmGcFile::mFileName)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcFile::mInfo) == 116, "expected ghmGcFile::mInfo to be size 116");
static_assert(sizeof(ghmGcFile::mpPrev) == 4, "expected ghmGcFile::mpPrev to be size 4");
static_assert(sizeof(ghmGcFile::mpNext) == 4, "expected ghmGcFile::mpNext to be size 4");
static_assert(sizeof(ghmGcFile::mFileName) == 64, "expected ghmGcFile::mFileName to be size 64");
static_assert(sizeof(ghmGcFile) == 0xbc, "expected ghmGcFile to be size 0xbc");

// [Structure] struct DVDDiskID
struct DVDDiskID
{
public:
	/// Struct member variables

	// <char gameName[0x4], offset 0x0>
	char gameName[4];

	// <char company[0x2], offset 0x4>
	char company[2];

	// <uint8_t diskNumber, offset 0x6>
	uint8_t diskNumber = 0;

	// <uint8_t gameVersion, offset 0x7>
	uint8_t gameVersion = 0;

	// <uint8_t streaming, offset 0x8>
	uint8_t streaming = 0;

	// <uint8_t streamingBufSize, offset 0x9>
	uint8_t streamingBufSize = 0;

	// <uint8_t padding[0xe], offset 0xa>
	uint8_t padding[14];

	// <uint32_t rvlMagic, offset 0x18>
	uint32_t rvlMagic = 0;

	// <uint32_t gcMagic, offset 0x1c>
	uint32_t gcMagic = 0;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct DVDDiskID [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(DVDDiskID& InObject)
	{
		diskNumber = InObject.diskNumber;
		gameVersion = InObject.gameVersion;
		streaming = InObject.streaming;
		streamingBufSize = InObject.streamingBufSize;
		rvlMagic = InObject.rvlMagic;
		gcMagic = InObject.gcMagic;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<DVDDiskID>("DVDDiskID")
			.addFunction("__tostring", &DVDDiskID::ToString)
			.addFunction("GetPtrAddr", &DVDDiskID::GetPtrAddr)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("gameName", &DVDDiskID::gameName)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("company", &DVDDiskID::company)
			.addProperty("diskNumber", &DVDDiskID::diskNumber)
			.addProperty("gameVersion", &DVDDiskID::gameVersion)
			.addProperty("streaming", &DVDDiskID::streaming)
			.addProperty("streamingBufSize", &DVDDiskID::streamingBufSize)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("padding", &DVDDiskID::padding)
			.addProperty("rvlMagic", &DVDDiskID::rvlMagic)
			.addProperty("gcMagic", &DVDDiskID::gcMagic)
		.endClass();
	}
#endif
};
static_assert(sizeof(DVDDiskID::gameName) == 4, "expected DVDDiskID::gameName to be size 4");
static_assert(sizeof(DVDDiskID::company) == 2, "expected DVDDiskID::company to be size 2");
static_assert(sizeof(DVDDiskID::diskNumber) == 1, "expected DVDDiskID::diskNumber to be size 1");
static_assert(sizeof(DVDDiskID::gameVersion) == 1, "expected DVDDiskID::gameVersion to be size 1");
static_assert(sizeof(DVDDiskID::streaming) == 1, "expected DVDDiskID::streaming to be size 1");
static_assert(sizeof(DVDDiskID::streamingBufSize) == 1, "expected DVDDiskID::streamingBufSize to be size 1");
static_assert(sizeof(DVDDiskID::padding) == 14, "expected DVDDiskID::padding to be size 14");
static_assert(sizeof(DVDDiskID::rvlMagic) == 4, "expected DVDDiskID::rvlMagic to be size 4");
static_assert(sizeof(DVDDiskID::gcMagic) == 4, "expected DVDDiskID::gcMagic to be size 4");
static_assert(sizeof(DVDDiskID) == 0x20, "expected DVDDiskID to be size 0x20");

// [Structure] class EE::IFile
namespace EE
{
	class IFile : public EE::RefObject
	{
	public:
		/// Struct member variables

		// <class EE::RefObject field_0, offset 0x0>
		// class RefObject Super;

		// <class EE::String name, offset 0x8>
		class String name;

		// <uint8_t endianSwap, offset 0x14>
		uint8_t endianSwap = 0;

		// <Unidentified data segment, offset 0x15>
	private:
		char _UnidentifiedData_21[3];

	public:
		/// 0 Functions

		/// Meta

		std::string ToString() const { std::stringstream stream; stream << "class EE::IFile [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
		int GetPtrAddr() const { return (int)this; }
		void CopyFrom(EE::IFile& InObject)
		{
			name = InObject.name;
			endianSwap = InObject.endianSwap;
		}
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.deriveClass<IFile, EE::RefObject>("EE_IFile")
				.addFunction("__tostring", &EE::IFile::ToString)
				.addFunction("GetPtrAddr", &EE::IFile::GetPtrAddr)
				.addProperty("name", &EE::IFile::name)
				.addProperty("endianSwap", &EE::IFile::endianSwap)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(EE::IFile::name) == 12, "expected EE::IFile::name to be size 12");
static_assert(sizeof(EE::IFile::endianSwap) == 1, "expected EE::IFile::endianSwap to be size 1");
static_assert(sizeof(EE::IFile) == 0x18, "expected EE::IFile to be size 0x18");

// [Structure] struct BATTLESIMPLMESS_SET
/// <summary>
/// Stores info on simple battle messages.
/// </summary>
struct BATTLESIMPLMESS_SET
{
public:
	/// Struct member variables

	// <int16_t mMessNum, offset 0x0>
	int16_t mMessNum = 0;

	// <Unidentified data segment, offset 0x2>
private:
	char _UnidentifiedData_2[2];

public:
	// <float mMesPosY, offset 0x4>
	float mMesPosY = 0;

	// <int32_t mAnimCount, offset 0x8>
	int32_t mAnimCount = 0;

	// <int32_t mAlpha, offset 0xc>
	int32_t mAlpha = 0;

	// <uint8_t mLiveflg, offset 0x10>
	uint8_t mLiveflg = 0;

	// <Unidentified data segment, offset 0x11>
private:
	char _UnidentifiedData_17[1];

public:
	// <int16_t mMax_Cnt, offset 0x12>
	int16_t mMax_Cnt = 0;

	// <BATTLESIMPLMESS_SET* pNext, offset 0x14>
	BATTLESIMPLMESS_SET* pNext = nullptr;

	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "struct BATTLESIMPLMESS_SET [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(BATTLESIMPLMESS_SET& InObject)
	{
		mMessNum = InObject.mMessNum;
		mMesPosY = InObject.mMesPosY;
		mAnimCount = InObject.mAnimCount;
		mAlpha = InObject.mAlpha;
		mLiveflg = InObject.mLiveflg;
		mMax_Cnt = InObject.mMax_Cnt;
		pNext = InObject.pNext;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<BATTLESIMPLMESS_SET>("BATTLESIMPLMESS_SET")
			.addFunction("__tostring", &BATTLESIMPLMESS_SET::ToString)
			.addFunction("GetPtrAddr", &BATTLESIMPLMESS_SET::GetPtrAddr)
			.addProperty("mMessNum", &BATTLESIMPLMESS_SET::mMessNum)
			.addProperty("mMesPosY", &BATTLESIMPLMESS_SET::mMesPosY)
			.addProperty("mAnimCount", &BATTLESIMPLMESS_SET::mAnimCount)
			.addProperty("mAlpha", &BATTLESIMPLMESS_SET::mAlpha)
			.addProperty("mLiveflg", &BATTLESIMPLMESS_SET::mLiveflg)
			.addProperty("mMax_Cnt", &BATTLESIMPLMESS_SET::mMax_Cnt)
			.addProperty("pNext", &BATTLESIMPLMESS_SET::pNext)
		.endClass();
	}
#endif
};
static_assert(sizeof(BATTLESIMPLMESS_SET::mMessNum) == 2, "expected BATTLESIMPLMESS_SET::mMessNum to be size 2");
static_assert(sizeof(BATTLESIMPLMESS_SET::mMesPosY) == 4, "expected BATTLESIMPLMESS_SET::mMesPosY to be size 4");
static_assert(sizeof(BATTLESIMPLMESS_SET::mAnimCount) == 4, "expected BATTLESIMPLMESS_SET::mAnimCount to be size 4");
static_assert(sizeof(BATTLESIMPLMESS_SET::mAlpha) == 4, "expected BATTLESIMPLMESS_SET::mAlpha to be size 4");
static_assert(sizeof(BATTLESIMPLMESS_SET::mLiveflg) == 1, "expected BATTLESIMPLMESS_SET::mLiveflg to be size 1");
static_assert(sizeof(BATTLESIMPLMESS_SET::mMax_Cnt) == 2, "expected BATTLESIMPLMESS_SET::mMax_Cnt to be size 2");
static_assert(sizeof(BATTLESIMPLMESS_SET::pNext) == 4, "expected BATTLESIMPLMESS_SET::pNext to be size 4");
static_assert(sizeof(BATTLESIMPLMESS_SET) == 0x18, "expected BATTLESIMPLMESS_SET to be size 0x18");

// [Structure] class HrEffectShutter
class HrEffectShutter : public HrTask
{
public:
	// enum HrEffectShutter::D_EFFECTSHUTTER_STAT
	enum D_EFFECTSHUTTER_STAT : uint32_t
	{
		// <NONE = 0x0>
		NONE = 0,

		// <CLOSE_DO = 0x1>
		CLOSE_DO = 1,

		// <CLOSE_ED = 0x2>
		CLOSE_ED = 2,

		// <OPEN_DO = 0x3>
		OPEN_DO = 3,

		// <OPEN_ED = 0x4>
		OPEN_ED = 4

	};

	/// Struct member variables

	// <class HrTask field_0, offset 0x0>
	// class HrTask Super;

	// <enum HrEffectShutter::D_EFFECTSHUTTER_STAT m_Stat, offset 0x50>
	enum HrEffectShutter::D_EFFECTSHUTTER_STAT m_Stat;

	// <int16_t m_Counter, offset 0x54>
	int16_t m_Counter = 0;

	// <int16_t m_OpenTime, offset 0x56>
	int16_t m_OpenTime = 0;

	// <int16_t m_CloseTime, offset 0x58>
	int16_t m_CloseTime = 0;

	// <Unidentified data segment, offset 0x5a>
private:
	char _UnidentifiedData_90[2];

public:
	/// 0 Functions

	/// Meta

	std::string ToString() const { std::stringstream stream; stream << "class HrEffectShutter [0x" << std::hex << GetPtrAddr() << "]"; return stream.str(); }
	int GetPtrAddr() const { return (int)this; }
	void CopyFrom(HrEffectShutter& InObject)
	{
		m_Stat = InObject.m_Stat;
		m_Counter = InObject.m_Counter;
		m_OpenTime = InObject.m_OpenTime;
		m_CloseTime = InObject.m_CloseTime;
	}
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<HrEffectShutter, HrTask>("HrEffectShutter")
			.addFunction("__tostring", &HrEffectShutter::ToString)
			.addFunction("GetPtrAddr", &HrEffectShutter::GetPtrAddr)
			.addProperty("m_Stat", &HrEffectShutter::m_Stat)
			.addProperty("m_Counter", &HrEffectShutter::m_Counter)
			.addProperty("m_OpenTime", &HrEffectShutter::m_OpenTime)
			.addProperty("m_CloseTime", &HrEffectShutter::m_CloseTime)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrEffectShutter::m_Stat) == 4, "expected HrEffectShutter::m_Stat to be size 4");
static_assert(sizeof(HrEffectShutter::m_Counter) == 2, "expected HrEffectShutter::m_Counter to be size 2");
static_assert(sizeof(HrEffectShutter::m_OpenTime) == 2, "expected HrEffectShutter::m_OpenTime to be size 2");
static_assert(sizeof(HrEffectShutter::m_CloseTime) == 2, "expected HrEffectShutter::m_CloseTime to be size 2");
static_assert(sizeof(HrEffectShutter) == 0x5c, "expected HrEffectShutter to be size 0x5c");

// enum GHMR_BLEND
enum GHMR_BLEND : uint32_t
{
	// <GHMR_BLEND_ADD = 0x0>
	GHMR_BLEND_ADD = 0,

	// <GHMR_BLEND_SUB = 0x1>
	GHMR_BLEND_SUB = 1,

	// <GHMR_BLEND_MUL = 0x2>
	GHMR_BLEND_MUL = 2,

	// <GHMR_BLEND_ALPHA = 0x3>
	GHMR_BLEND_ALPHA = 3,

	// <GHMR_BLEND_NONE = 0x4>
	GHMR_BLEND_NONE = 4,

	// <GHMR_BLEND_NUM = 0x5>
	GHMR_BLEND_NUM = 5

};

// [Structure] class EfBase
class EfBase
{
public:
	/// Struct member variables

	// <uint8_t mBitFlag, offset 0x0>
	uint8_t mBitFlag = 0;

	// <Unidentified data segment, offset 0x1>
private:
	char _UnidentifiedData_1[3];

public:
	// <uint32_t mTick, offset 0x4>
