// Exporter by @MekuCube

#pragma once

/// Forward Declaration

struct stBtEffect;
struct Vec;
class mHRBattle;
class CTimeRatioInterpolate;
struct stFade;
class CSpringInterpolate;
class CDoubleSpringInterpolate;
class CAmbientShadow;
struct stCharaEffect;
class stCharaFileData;
class ghmSegment;
class ghmCapsule;
class ghmGcOctTreeNodeObj;
class ghmGcCollObj;
class ghmGcCollObjCapsule;
class WAnim;
class WAnimF;
struct stDamageInfo;
class ghmTriangle;
class ghmPlane;
class ghmGcCollObjHitResultObj;
struct stVec;
struct Quaternion;
struct stCharaStatus;
class ghmListObj;
struct CharControlMotID;
struct GXColor;
class vector4f;
class vector4x;
class tiVector;
namespace mot
{
	class IBoneEffectModel;
}
namespace mot
{
	class IBoneEffectModelPJ;
}
class TGmf;
class NYPhase;
class NYApproachToTargetVal;
class HrTask;
class HrBattleIcon;
class mHRChara;
class HROBJDummy;
struct stTiger;
struct stHugWalk;
struct stPcEffect;
struct stPcSndData;
struct stDarkSideInfo;
struct stPcSaveData;
struct stMiniDemo;
struct stPcStatus;
class mHRPc;
class ghmAABB;
class ghmGcOctTreeNode;
class ghmGcOctTree;
class ghmGcCollObjHitResult;
struct WGclMaterialSpec;
namespace EE
{
	template<typename T>
	class SmartPtr;
}
struct DVDCommandBlock;
struct DVDFileInfo;
class ghmGcFile;
struct DVDDiskID;
namespace EE
{
	class RefObject;
}
namespace EE
{
	class IFile;
}
class ghmResGroup;
class ghmResStrTable;
class TGanPlay;
class TGan;
struct WGanSpec;
struct WGanMaterialSpec;
struct WGanFAnmSpec;

namespace ti
{
	class CCamera;
}
class CGameCamera;
class CCameraman;
class HrMiniDemoObj;
class HrMiniDemoModel;
class STG0202;
struct tagHRTASKCHECK;
class EffectBoneElect;
class BoneStreamObj;
class EffectMetalElect;
class EffectCutMark;
class PJTateshi;
class PJState;
class ZkState_DownAttack;
class State_AwayAfterAttack;
class State_CloseBeforeAttack;
class State_StepInAttack;
class State_DownDamage;
class State_TojoBaseState;
class State_LeadPcWayPointMove;
class State_FixTurret;
class State_WayPointMoveAfterPop;
class State_Tojo_RoomRunner;
class State_Tojo_AeroBike;
class State_Tojo_BreakCmnObj;
class State_Tojo_JumpOff;
class State_Tojo_Car;
class State_Tojo_RunAndTurnPc;
class State_Idle;
class State_Tojo_AgainstWall;
class State_Tojo_LookAround;
class State_Tojo_Stand;
class State_Tojo_Bench;
class State_Tojo_Sit;
class State_Tojo_SuddenAttack;
class State_ReleaseWaitIdle;
class State_Scare_Base;
class State_Scare_Kosinukasi;
class State_Scare_Run;
class State_WayPointMove;
class State_Pressure;
class State_ThroughDamage;
class State_Defence;
class State_Evacuate;
class State_ComboAttack;
class State_Damage;
struct CollInfo;
struct ZkGuardParam;
struct ZkEvacuateParam;
class FkCounter;
struct ZkSetDamageInfo;
class State_Scare_Yotunbai;
class State_Scare_Stand;
class State_RandomMove;
class State_PerformIll;
class PJZAKO;
class PJStateMachine;
class EffectDanmenFlash;
class EffectQuestion;
class PJZakoMotMng;
class PathPlanner;
class FkDynamicParam;
class FkObstacleSensor;
class FkBulletManager;
class EffectFkTobiDoguBase;
class rQuadEx;
class EffectGunTrack;
class pcSNB;
class State_Tojo_Knife_SuddenAttack;
class ZkKnifeState_ThroughKnife;
class PJZAKOBoneB;
class PJZakoKnife;
class bsSKE;
class bsLEZ;
class bsCEW;
class bsAST;
class bsRKT;
template<typename T>
class KrBaseState;
class GLBDeathState;
class GLBWalkState;
class GLBComboState;
class GLBIdleState;
class GLBJampState;
template<typename T1, int T2>
class KrStateMachine;
class rSideScrollCamera;
class GLBDamageState;
class GLBGuardState;
class GLBAirKickState;
class pcGLB;
class EfRoboInterface;
class EffectSpeedBlur;
class CmDeathState;
class SDPDeathState;
class SDPComboState;
class CmDamageState;
class SDPDamageState;
class SDPBeamState;
class CmIdleState;
class SDPIdleState;
class bsBasic;
class SDPMoveState;
class SDPGuardState;
class bsSDP;
class FkTriangleList;
class EffectModelBeam;
struct FkVtx;
class EfGeneralBeam;
class PJOBJ0029;
class PJOBJ0033;
struct EFFECTSIMPLEOBJ3PARAM;
struct EFFECTMODELFIREPARAM;
class EffectModelFire;
class EffectSimpleObj3;
struct tagTLIST;
class PJOBJ0036;
class PJOBJ0037;
class PJOBJ0104;
class PJOBJ0155;
class PJOBJ0190;
class PJPTR;
struct FkDbgInfo_EventArea;
class FkGlobalDBG;
class EffectBloodSplash;
class EffectSimpleObj2;
class EffectSlashHit;
class FkBoss;
class EffectSlashTrack;
class EffectBeamDragon;
class EffectGYNMissile;
class EffectMoeMissile;
class CMotionPlayer;

/// Full Declaration

// [Structure] struct stBtEffect
struct stBtEffect
{
public:
	// enum stBtEffect::SlowType
	enum SlowType : uint32_t
	{
		// <FinishInput = 0x0>
		FinishInput = 0,

		// <BossFinish = 0x1>
		BossFinish = 1

	};

	/// Struct member variables

	// <class HrScreenStatus* pScreenStatus, offset 0x0>
	class HrScreenStatus* pScreenStatus;

	// <class HrEffectShutter* pShutter, offset 0x4>
	class HrEffectShutter* pShutter;

	// <class EfSmoke* pSmoke, offset 0x8>
	class EfSmoke* pSmoke;

	// <int32_t slowMotTotalTick, offset 0xc>
	int32_t slowMotTotalTick;

	// <int32_t slowMotTick, offset 0x10>
	int32_t slowMotTick;

	// <enum stBtEffect::SlowType slowType, offset 0x14>
	enum stBtEffect::SlowType slowType;

	// <int32_t bulletSlowTick, offset 0x18>
	int32_t bulletSlowTick;

	// <int32_t bossBreakSlowTick, offset 0x1c>
	int32_t bossBreakSlowTick;

	std::string ToString() const { return "struct stBtEffect(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stBtEffect>("stBtEffect")
			.addFunction("__tostring", &stBtEffect::ToString)
			.addFunction("GetPtrAddr", &stBtEffect::GetPtrAddr)
			.addProperty("pScreenStatus", &stBtEffect::pScreenStatus)
			.addProperty("pShutter", &stBtEffect::pShutter)
			.addProperty("pSmoke", &stBtEffect::pSmoke)
			.addProperty("slowMotTotalTick", &stBtEffect::slowMotTotalTick)
			.addProperty("slowMotTick", &stBtEffect::slowMotTick)
			.addProperty("slowType", &stBtEffect::slowType)
			.addProperty("bulletSlowTick", &stBtEffect::bulletSlowTick)
			.addProperty("bossBreakSlowTick", &stBtEffect::bossBreakSlowTick)
		.endClass();
	}
#endif
};
static_assert(sizeof(stBtEffect::pScreenStatus) == 4, "expected pScreenStatus to be size 4");
static_assert(sizeof(stBtEffect::pShutter) == 4, "expected pShutter to be size 4");
static_assert(sizeof(stBtEffect::pSmoke) == 4, "expected pSmoke to be size 4");
static_assert(sizeof(stBtEffect::slowMotTotalTick) == 4, "expected slowMotTotalTick to be size 4");
static_assert(sizeof(stBtEffect::slowMotTick) == 4, "expected slowMotTick to be size 4");
static_assert(sizeof(stBtEffect::slowType) == 4, "expected slowType to be size 4");
static_assert(sizeof(stBtEffect::bulletSlowTick) == 4, "expected bulletSlowTick to be size 4");
static_assert(sizeof(stBtEffect::bossBreakSlowTick) == 4, "expected bossBreakSlowTick to be size 4");
static_assert(sizeof(stBtEffect) == 32, "expected struct stBtEffect to be size 32");

// enum enPopReqType
enum enPopReqType : uint32_t
{
	// <ePopTypeDistance = 0x0>
	ePopTypeDistance = 0,

	// <ePopTypeAlways = 0x1>
	ePopTypeAlways = 1,

	// <ePopTypeOrder = 0x2>
	ePopTypeOrder = 2,

	// <ePopTypeOutOfCamera = 0x3>
	ePopTypeOutOfCamera = 3,

	// <ePopTypeMax = 0x4>
	ePopTypeMax = 4

};

// enum enCharaType
enum enCharaType : uint32_t
{
	// <eCharaTypeNone = 0x0>
	eCharaTypeNone = 0,

	// <eCharaTypePC = 0x1>
	eCharaTypePC = 1,

	// <CHARACTER_TYPE_ZAKO_BEGIN = 0x2>
	CHARACTER_TYPE_ZAKO_BEGIN = 2,

	// <eCharaTypeZKPipe = 0x3>
	eCharaTypeZKPipe = 3,

	// <eCharaTypeZKBat = 0x4>
	eCharaTypeZKBat = 4,

	// <eCharaTypeZKHandGun = 0x5>
	eCharaTypeZKHandGun = 5,

	// <eCharaTypeZKSubMachineGun = 0x6>
	eCharaTypeZKSubMachineGun = 6,

	// <eCharaTypeZKKnife = 0x7>
	eCharaTypeZKKnife = 7,

	// <eCharaTypeZKKakuto = 0x8>
	eCharaTypeZKKakuto = 8,

	// <eCharaTypeZKNihonto = 0x9>
	eCharaTypeZKNihonto = 9,

	// <eCharaTypeZKBeamKatana = 0xa>
	eCharaTypeZKBeamKatana = 10,

	// <eCharaTypeZKWarPick = 0xb>
	eCharaTypeZKWarPick = 11,

	// <eCharaTypeZKChainSaw = 0xc>
	eCharaTypeZKChainSaw = 12,

	// <eCharaTypeZKFiveNata = 0xd>
	eCharaTypeZKFiveNata = 13,

	// <eCharaTypeZKFiveHandGun = 0xe>
	eCharaTypeZKFiveHandGun = 14,

	// <eCharaTypeZKFiveMachineGun = 0xf>
	eCharaTypeZKFiveMachineGun = 15,

	// <CHARACTER_TYPE_ZAKO_END = 0x10>
	CHARACTER_TYPE_ZAKO_END = 16,

	// <CHARACTER_TYPE_BOSS_BEGIN = 0x11>
	CHARACTER_TYPE_BOSS_BEGIN = 17,

	// <eCharaTypeSKE = 0x12>
	eCharaTypeSKE = 18,

	// <eCharaTypeSPU = 0x13>
	eCharaTypeSPU = 19,

	// <eCharaTypeDSL = 0x14>
	eCharaTypeDSL = 20,

	// <eCharaTypeDSR = 0x15>
	eCharaTypeDSR = 21,

	// <eCharaTypeGSR = 0x16>
	eCharaTypeGSR = 22,

	// <eCharaTypePOP = 0x17>
	eCharaTypePOP = 23,

	// <eCharaTypeJPY = 0x18>
	eCharaTypeJPY = 24,

	// <eCharaTypeGYN = 0x19>
	eCharaTypeGYN = 25,

	// <eCharaTypeMGN = 0x1a>
	eCharaTypeMGN = 26,

	// <eCharaTypeMOE = 0x1b>
	eCharaTypeMOE = 27,

	// <eCharaTypeLEZ = 0x1c>
	eCharaTypeLEZ = 28,

	// <eCharaTypeCEW = 0x1d>
	eCharaTypeCEW = 29,

	// <eCharaTypeJBJA = 0x1e>
	eCharaTypeJBJA = 30,

	// <eCharaTypeJBJB = 0x1f>
	eCharaTypeJBJB = 31,

	// <eCharaTypeJBJC = 0x20>
	eCharaTypeJBJC = 32,

	// <eCharaTypeAST = 0x21>
	eCharaTypeAST = 33,

	// <eCharaTypeRKT = 0x22>
	eCharaTypeRKT = 34,

	// <eCharaTypeGLB = 0x23>
	eCharaTypeGLB = 35,

	// <eCharaTypeSDP = 0x24>
	eCharaTypeSDP = 36,

	// <eCharaTypeBIKJPY = 0x25>
	eCharaTypeBIKJPY = 37,

	// <CHARACTER_TYPE_BOSS_END = 0x26>
	CHARACTER_TYPE_BOSS_END = 38,

	// <eCharaTypePatroller = 0x27>
	eCharaTypePatroller = 39,

	// <eCharaTypeZKCar_Sedan = 0x28>
	eCharaTypeZKCar_Sedan = 40,

	// <eCharaTypeZKCar_Van = 0x29>
	eCharaTypeZKCar_Van = 41,

	// <eCharaTypePhotoCat = 0x2a>
	eCharaTypePhotoCat = 42,

	// <eCharaTypeFCA = 0x2b>
	eCharaTypeFCA = 43,

	// <eCharaTypeCommonNpc = 0x2c>
	eCharaTypeCommonNpc = 44,

	// <eCharaTypeScorpion = 0x2d>
	eCharaTypeScorpion = 45,

	// <eCharaTypeHelicopter = 0x2e>
	eCharaTypeHelicopter = 46,

	// <eCharaTypeCommonNpc_BUG = 0x2f>
	eCharaTypeCommonNpc_BUG = 47,

	// <eCharaTypeCommonNpc_PIPE = 0x30>
	eCharaTypeCommonNpc_PIPE = 48,

	// <eCharaTypeCommonNpc_COCONUT = 0x31>
	eCharaTypeCommonNpc_COCONUT = 49,

	// <eCharaTypeCommonNpc_DEBLI = 0x32>
	eCharaTypeCommonNpc_DEBLI = 50,

	// <eCharaTypeCommonNpc_PIZZA = 0x33>
	eCharaTypeCommonNpc_PIZZA = 51,

	// <eCharaTypeCommonNpc_TILE = 0x34>
	eCharaTypeCommonNpc_TILE = 52,

	// <eCharaTypeCommonNpc_STEAK = 0x35>
	eCharaTypeCommonNpc_STEAK = 53,

	// <eCharaTypeCommonNpc_SCORPION = 0x36>
	eCharaTypeCommonNpc_SCORPION = 54,

	// <eCharaTypeCommonNpc_CAR_BUG = 0x37>
	eCharaTypeCommonNpc_CAR_BUG = 55,

	// <eCharaTypeCommonNpc_CAR_PIPE = 0x38>
	eCharaTypeCommonNpc_CAR_PIPE = 56,

	// <eCharaTypeCommonNpc_CAR_COCONUT = 0x39>
	eCharaTypeCommonNpc_CAR_COCONUT = 57,

	// <eCharaTypeCommonNpc_CAR_DEBLI = 0x3a>
	eCharaTypeCommonNpc_CAR_DEBLI = 58,

	// <eCharaTypeCommonNpc_CAR_TILE = 0x3b>
	eCharaTypeCommonNpc_CAR_TILE = 59,

	// <eCharaTypeCommonNpc_CAR_STEAK = 0x3c>
	eCharaTypeCommonNpc_CAR_STEAK = 60,

	// <eCharaTypeCommonNpc_CAR_SCORPION = 0x3d>
	eCharaTypeCommonNpc_CAR_SCORPION = 61,

	// <eCharaTypeCmnObj = 0x3e8>
	eCharaTypeCmnObj = 1000,

	// <eCharaTypePlayerWeapon = 0x3e9>
	eCharaTypePlayerWeapon = 1001,

	// <eCustomColliderObject = 0x3ea>
	eCustomColliderObject = 1002

};

// enum eLightRefPriority
enum eLightRefPriority : uint32_t
{
	// <eLightRefPriority_MostHigh = 0x0>
	eLightRefPriority_MostHigh = 0,

	// <eLightRefPriority_PC_CUT = 0x1>
	eLightRefPriority_PC_CUT = 1,

	// <eLightRefPriority_GUARD = 0x2>
	eLightRefPriority_GUARD = 2,

	// <eLightRefPriority_MUZZLE_FLASH = 0x3>
	eLightRefPriority_MUZZLE_FLASH = 3,

	// <eLightRefPriority_Low = 0x4>
	eLightRefPriority_Low = 4

};

// [Structure] struct Vec
/// <summary>
/// 3D Vector (x, y, z). Y-up.
/// </summary>
struct Vec
{
public:
	/// Struct member variables

	// <float x, offset 0x0>
	float x;

	// <float y, offset 0x4>
	float y;

	// <float z, offset 0x8>
	float z;

	Vec() { x = 0; y = 0; z = 0; }
	Vec(float inX, float inY, float inZ) { x = inX; y = inY; z = inZ; }
	std::string ToString() const { return "struct Vec(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Vec>("Vec")
			.addFunction("__tostring", &Vec::ToString)
			.addFunction("GetPtrAddr", &Vec::GetPtrAddr)
			.addProperty("x", &Vec::x)
			.addProperty("y", &Vec::y)
			.addProperty("z", &Vec::z)
			.addConstructor<void (*) (void)>()
			.addConstructor<void (*) (float, float, float)>()
			.addProperty("pitch", &Vec::x)
			.addProperty("yaw", &Vec::y)
			.addProperty("roll", &Vec::z)
		.endClass();
	}
#endif
};
static_assert(sizeof(Vec::x) == 4, "expected x to be size 4");
static_assert(sizeof(Vec::y) == 4, "expected y to be size 4");
static_assert(sizeof(Vec::z) == 4, "expected z to be size 4");
static_assert(sizeof(Vec) == 12, "expected struct Vec to be size 12");

// enum enBattleFrameProc
enum enBattleFrameProc : uint32_t
{
	// <eBtlFrameInit = 0x0>
	eBtlFrameInit = 0,

	// <eBtlFrameMain = 0x1>
	eBtlFrameMain = 1,

	// <eBtlFramePcTermWait = 0x2>
	eBtlFramePcTermWait = 2,

	// <eBtlFramePcInitWait = 0x3>
	eBtlFramePcInitWait = 3,

	// <eBtlFrameReleaseNpc = 0x4>
	eBtlFrameReleaseNpc = 4

};

// enum enPcKind
/// <summary>
/// Player character type (Travis, Shinobu, Henry)
/// </summary>
enum enPcKind : uint32_t
{
	// <ePcUndefined = 0xffffffffffffffff>
	ePcUndefined = UINT32_MAX,

	// <ePcTRV = 0x0>
	ePcTRV = 0,

	// <ePcSNB = 0x1>
	ePcSNB = 1,

	// <ePcHEN = 0x2>
	ePcHEN = 2,

	// <ePcKindMax = 0x3>
	ePcKindMax = 3

};

// [Structure] class mHRBattle
class mHRBattle
{
public:
	// [Function] class mHRPc* __convention("thiscall") mHRBattle::mGetPcPtr(class mHRBattle* const this) [?mGetPcPtr@mHRBattle@@QAEPAVmHRPc@@XZ]
	class mHRPc* mGetPcPtr()
	{
		typedef class mHRPc*(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x9c010);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetSlowMotionTick(class mHRBattle* const this) [?mGetSlowMotionTick@mHRBattle@@QAEHXZ]
	int32_t mGetSlowMotionTick()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x9cdf0);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetBulletSlow(class mHRBattle* const this) [?mGetBulletSlow@mHRBattle@@QAEHXZ]
	int32_t mGetBulletSlow()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x9ce00);
		return mFunc(this);
	}
	// [Function] struct stBtEffect* __convention("thiscall") mHRBattle::mGetBtEffect(class mHRBattle* const this) [?mGetBtEffect@mHRBattle@@QAEPAUstBtEffect@@XZ]
	struct stBtEffect* mGetBtEffect()
	{
		typedef struct stBtEffect*(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x9ce10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetNpcAttackFlag(class mHRBattle* const this, uint8_t arg2) [?mSetNpcAttackFlag@mHRBattle@@QAEX_N@Z]
	void mSetNpcAttackFlag(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x9ce20);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRBattle::mSetNpcAttackRate(class mHRBattle* const this, float arg2) [?mSetNpcAttackRate@mHRBattle@@QAEMM@Z]
	float mSetNpcAttackRate(float arg2)
	{
		typedef float(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0x9ce50);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::SetNpcDatMax(class mHRBattle* const this, int32_t arg2) [?SetNpcDatMax@mHRBattle@@QAEXH@Z]
	void SetNpcDatMax(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x9ce90);
		return mFunc(this, arg2);
	}
	// [Function] class EfSmoke* __convention("thiscall") mHRBattle::GetSmokeEf(class mHRBattle* const this) [?GetSmokeEf@mHRBattle@@QAEPAVEfSmoke@@XZ]
	class EfSmoke* GetSmokeEf()
	{
		typedef class EfSmoke*(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x9fbf0);
		return mFunc(this);
	}
	// [Function] enum enPcKind __convention("thiscall") mHRBattle::mGetPcKind(class mHRBattle* const this) [?mGetPcKind@mHRBattle@@QAE?AW4enPcKind@@XZ]
	enum enPcKind mGetPcKind()
	{
		typedef enum enPcKind(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2060);
		return mFunc(this);
	}
	// [Function] enum enBattleFrameProc __convention("thiscall") mHRBattle::mGetFrameProc(class mHRBattle* const this) [?mGetFrameProc@mHRBattle@@QAE?AW4enBattleFrameProc@@XZ]
	enum enBattleFrameProc mGetFrameProc()
	{
		typedef enum enBattleFrameProc(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2070);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraAngle(class mHRBattle* const this, float arg2) [?mSetCameraAngle@mHRBattle@@QAEXM@Z]
	void mSetCameraAngle(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2080);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCamMotFlag(class mHRBattle* const this, uint8_t arg2) [?mSetCamMotFlag@mHRBattle@@QAEX_N@Z]
	void mSetCamMotFlag(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa20b0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCamMotFlagNoUse(class mHRBattle* const this, uint8_t arg2) [?mSetCamMotFlagNoUse@mHRBattle@@QAEX_N@Z]
	void mSetCamMotFlagNoUse(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa20c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraAutoReturnDisEnable(class mHRBattle* const this, uint8_t arg2) [?mSetCameraAutoReturnDisEnable@mHRBattle@@QAEX_N@Z]
	void mSetCameraAutoReturnDisEnable(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa20e0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mClearKillNum(class mHRBattle* const this) [?mClearKillNum@mHRBattle@@QAEXXZ]
	void mClearKillNum()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2100);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetKillNum(class mHRBattle* const this) [?mGetKillNum@mHRBattle@@QAEHXZ]
	int32_t mGetKillNum()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2110);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetKillNum(class mHRBattle* const this, int32_t arg2) [?mSetKillNum@mHRBattle@@QAEXH@Z]
	void mSetKillNum(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2120);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetRevengeMissionZakoKillNum(class mHRBattle* const this) [?GetRevengeMissionZakoKillNum@mHRBattle@@QAEHXZ]
	int32_t GetRevengeMissionZakoKillNum()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2140);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::ClearRevengeMissionZakoKillNum(class mHRBattle* const this) [?ClearRevengeMissionZakoKillNum@mHRBattle@@QAEXXZ]
	void ClearRevengeMissionZakoKillNum()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2150);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetBattlePause(class mHRBattle* const this, uint8_t arg2) [?mSetBattlePause@mHRBattle@@QAEX_N@Z]
	void mSetBattlePause(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2160);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetDispStatusDisEnable(class mHRBattle* const this, uint8_t arg2) [?mSetDispStatusDisEnable@mHRBattle@@QAEX_N@Z]
	void mSetDispStatusDisEnable(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2190);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetDispStatusDisEnable(class mHRBattle* const this) [?mGetDispStatusDisEnable@mHRBattle@@QAE_NXZ]
	uint8_t mGetDispStatusDisEnable()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa21b0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetChargeDamage(class mHRBattle* const this, uint8_t arg2) [?mSetChargeDamage@mHRBattle@@QAEX_N@Z]
	void mSetChargeDamage(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa21c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mClearTotalKillNum(class mHRBattle* const this) [?mClearTotalKillNum@mHRBattle@@QAEXXZ]
	void mClearTotalKillNum()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3860);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetTutoRun(class mHRBattle* const this) [?mGetTutoRun@mHRBattle@@QAE_NXZ]
	uint8_t mGetTutoRun()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3870);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSubRepopNum(class mHRBattle* const this, int32_t arg2) [?mSubRepopNum@mHRBattle@@QAEXH@Z]
	void mSubRepopNum(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4750);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetRepopTimer(class mHRBattle* const this, int32_t arg2, int32_t arg3) [?mSetRepopTimer@mHRBattle@@QAEXHH@Z]
	void mSetRepopTimer(int32_t arg2, int32_t arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3);
		_Func mFunc = (_Func)(GameModule + 0xa4770);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetNewGameDataRequest(class mHRBattle* const this) [?mGetNewGameDataRequest@mHRBattle@@QAE_NXZ]
	uint8_t mGetNewGameDataRequest()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5290);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetDontChangeTeppeiCamera(class mHRBattle* const this) [?mGetDontChangeTeppeiCamera@mHRBattle@@QAE_NXZ]
	uint8_t mGetDontChangeTeppeiCamera()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa52a0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetCameraProjection(class mHRBattle* const this) [?mGetCameraProjection@mHRBattle@@QAEMXZ]
	float mGetCameraProjection()
	{
		typedef float(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa52b0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraMoveFlag(class mHRBattle* const this, uint8_t arg2) [?mSetCameraMoveFlag@mHRBattle@@QAEX_N@Z]
	void mSetCameraMoveFlag(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa52c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMotionCameraPos(class mHRBattle* const this, struct Vec* arg2) [?mSetMotionCameraPos@mHRBattle@@QAEXPAUVec@@@Z]
	void mSetMotionCameraPos(struct Vec* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, struct Vec* arg2);
		_Func mFunc = (_Func)(GameModule + 0xa52d0);
		return mFunc(this, arg2);
	}
	// [Function] struct Vec* __convention("thiscall") mHRBattle::mGetMotionCameraPos(class mHRBattle* const this) [?mGetMotionCameraPos@mHRBattle@@QAEPAUVec@@XZ]
	struct Vec* mGetMotionCameraPos()
	{
		typedef struct Vec*(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa52e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMotionCameraY(class mHRBattle* const this, float* arg2) [?mSetMotionCameraY@mHRBattle@@QAEXPAM@Z]
	void mSetMotionCameraY(float* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float* arg2);
		_Func mFunc = (_Func)(GameModule + 0xa52f0);
		return mFunc(this, arg2);
	}
	// [Function] float* __convention("thiscall") mHRBattle::mGetMotionCameraY(class mHRBattle* const this) [?mGetMotionCameraY@mHRBattle@@QAEPAMXZ]
	// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetMotionCameraY()
	{
		typedef float*(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5300);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetBattlePause(class mHRBattle* const this) [?mGetBattlePause@mHRBattle@@QAE_NXZ]
	uint8_t mGetBattlePause()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5310);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetChargeDamage(class mHRBattle* const this) [?mGetChargeDamage@mHRBattle@@QAE_NXZ]
	uint8_t mGetChargeDamage()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5320);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetChangeCameraRailFlag(class mHRBattle* const this) [?mGetChangeCameraRailFlag@mHRBattle@@QAE_NXZ]
	uint8_t mGetChangeCameraRailFlag()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaa7a0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetCameraAngleX(class mHRBattle* const this) [?mGetCameraAngleX@mHRBattle@@QAEMXZ]
	float mGetCameraAngleX()
	{
		typedef float(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaa7c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockNavelPos(class mHRBattle* const this, uint8_t arg2) [?mSetLockNavelPos@mHRBattle@@QAEX_N@Z]
	void mSetLockNavelPos(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xaa7d0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetTotalKillNum(class mHRBattle* const this) [?mGetTotalKillNum@mHRBattle@@QAEHXZ]
	int32_t mGetTotalKillNum()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaa7f0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetTotalKillNum(class mHRBattle* const this, int32_t arg2) [?mSetTotalKillNum@mHRBattle@@QAEXH@Z]
	void mSetTotalKillNum(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xaa800);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetBossBreakSlow(class mHRBattle* const this) [?mGetBossBreakSlow@mHRBattle@@QAEHXZ]
	int32_t mGetBossBreakSlow()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaffb0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetNpcAttackFlag(class mHRBattle* const this) [?mGetNpcAttackFlag@mHRBattle@@QAE_NXZ]
	uint8_t mGetNpcAttackFlag()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xbade0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetNpcAttackRate(class mHRBattle* const this) [?mGetNpcAttackRate@mHRBattle@@QAEMXZ]
	float mGetNpcAttackRate()
	{
		typedef float(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xbae00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::AddRevengeMissionZakoKillNum(class mHRBattle* const this) [?AddRevengeMissionZakoKillNum@mHRBattle@@QAEXXZ]
	void AddRevengeMissionZakoKillNum()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xbae10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::SetCameraMotionEndStop(class mHRBattle* const this, uint8_t arg2) [?SetCameraMotionEndStop@mHRBattle@@QAEX_N@Z]
	void SetCameraMotionEndStop(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xc1f40);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::IsBgmEffect(class mHRBattle* const this) [?IsBgmEffect@mHRBattle@@QAE_NXZ]
	uint8_t IsBgmEffect()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xc64c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetDontChangeTeppeiCamera(class mHRBattle* const this, uint8_t arg2) [?mSetDontChangeTeppeiCamera@mHRBattle@@QAEX_N@Z]
	void mSetDontChangeTeppeiCamera(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xc8b00);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::UpdateMassKillAchievement(class mHRBattle* const this) [?UpdateMassKillAchievement@mHRBattle@@AAEXXZ]
	void UpdateMassKillAchievement()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f38c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::UpdateMainScreenUI(class mHRBattle* const this) [?UpdateMainScreenUI@mHRBattle@@AAEXXZ]
	void UpdateMainScreenUI()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f39e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::BgmEffectProc(class mHRBattle* const this) [?BgmEffectProc@mHRBattle@@QAEXXZ]
	void BgmEffectProc()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f3cb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::SetBgmEffect(class mHRBattle* const this, float arg2, int32_t arg3) [?SetBgmEffect@mHRBattle@@QAEXMH@Z]
	void SetBgmEffect(float arg2, int32_t arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2, int32_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x3f3d00);
		return mFunc(this, arg2, arg3);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::GetNpc(class mHRBattle* const this, int32_t arg2) [?GetNpc@mHRBattle@@QAEPAVmHRChara@@H@Z]
	class mHRChara* GetNpc(int32_t arg2)
	{
		typedef class mHRChara*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f3d80);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckPcLoaded4WepaponChange(class mHRBattle* const this) [?mCheckPcLoaded4WepaponChange@mHRBattle@@QAE_NXZ]
	uint8_t mCheckPcLoaded4WepaponChange()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f3dc0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckBattleInit(class mHRBattle* const this) [?mCheckBattleInit@mHRBattle@@QAE_NXZ]
	uint8_t mCheckBattleInit()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f3e20);
		return mFunc(this);
	}
	// [Function] uint8_t mHRBattle::ChkToiletStage() [?ChkToiletStage@mHRBattle@@SA_NXZ]
	static uint8_t ChkToiletStage()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x3f3e30);
		return mFunc();
	}
	// [Function] uint8_t mHRBattle::ChkBikeStage() [?ChkBikeStage@mHRBattle@@SA_NXZ]
	static uint8_t ChkBikeStage()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x3f3e40);
		return mFunc();
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetPickUpGomiSubMissionResult(class mHRBattle* const this, int32_t arg2) [?GetPickUpGomiSubMissionResult@mHRBattle@@QAEHH@Z]
	int32_t GetPickUpGomiSubMissionResult(int32_t arg2)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f3e60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mAddKillNum(class mHRBattle* const this) [?mAddKillNum@mHRBattle@@QAEXXZ]
	void mAddKillNum()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f3e90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mSetNpcAppear(class mHRBattle* const this, int32_t arg2) [?mSetNpcAppear@mHRBattle@@QAE_NH@Z]
	uint8_t mSetNpcAppear(int32_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f3fc0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::FixRotationOfItem(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4) [?FixRotationOfItem@mHRBattle@@QAEXHAAUVec@@ABU2@@Z]
	void FixRotationOfItem(int32_t arg2, struct Vec& arg3, struct Vec& arg4)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4);
		_Func mFunc = (_Func)(GameModule + 0x3f4010);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRBattle::FixPositionOfItem(class mHRBattle* const this, int32_t arg2, struct Vec& arg3) [?FixPositionOfItem@mHRBattle@@QAEXHAAUVec@@@Z]
	void FixPositionOfItem(int32_t arg2, struct Vec& arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3);
		_Func mFunc = (_Func)(GameModule + 0x3f40e0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitCustomColliderObj(class mHRBattle* const this) [?mSetInitCustomColliderObj@mHRBattle@@QAEHXZ]
	int32_t mSetInitCustomColliderObj()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4390);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mSetInitCharaPos(class mHRBattle* const this, class mHRChara* arg2, struct Vec& arg3, struct Vec& arg4) [?mSetInitCharaPos@mHRBattle@@QAE_NPAVmHRChara@@ABUVec@@1@Z]
	uint8_t mSetInitCharaPos(class mHRChara* arg2, struct Vec& arg3, struct Vec& arg4)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, class mHRChara* arg2, struct Vec& arg3, struct Vec& arg4);
		_Func mFunc = (_Func)(GameModule + 0x3f4430);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckStatusDispOnlyBattery(class mHRBattle* const this) [?mCheckStatusDispOnlyBattery@mHRBattle@@QAE_NXZ]
	uint8_t mCheckStatusDispOnlyBattery()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4520);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckStatusDispWithoutBattery(class mHRBattle* const this) [?mCheckStatusDispWithoutBattery@mHRBattle@@QAE_NXZ]
	uint8_t mCheckStatusDispWithoutBattery()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4560);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckStatusDisp(class mHRBattle* const this) [?mCheckStatusDisp@mHRBattle@@QAE_NXZ]
	uint8_t mCheckStatusDisp()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4590);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mUndispMoney(class mHRBattle* const this) [?mUndispMoney@mHRBattle@@QAEXXZ]
	void mUndispMoney()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f45e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mDispMoney(class mHRBattle* const this) [?mDispMoney@mHRBattle@@QAEXXZ]
	void mDispMoney()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f45f0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetDispPcStatus(class mHRBattle* const this) [?mGetDispPcStatus@mHRBattle@@QAE_NXZ]
	uint8_t mGetDispPcStatus()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4640);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mReleaseAllNpcWithoutCmnObj(class mHRBattle* const this) [?mReleaseAllNpcWithoutCmnObj@mHRBattle@@QAE_NXZ]
	uint8_t mReleaseAllNpcWithoutCmnObj()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4650);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetBulletSlowTick(class mHRBattle* const this, int32_t arg2) [?mSetBulletSlowTick@mHRBattle@@QAEXH@Z]
	void mSetBulletSlowTick(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f4750);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetBulletSlow(class mHRBattle* const this) [?mResetBulletSlow@mHRBattle@@QAEXXZ]
	void mResetBulletSlow()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4770);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetSlowMotion(class mHRBattle* const this) [?mResetSlowMotion@mHRBattle@@QAEXXZ]
	void mResetSlowMotion()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f47a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mLightReflectEfProc(class mHRBattle* const this) [?mLightReflectEfProc@mHRBattle@@QAEXXZ]
	void mLightReflectEfProc()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f47d0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCheckSamePopNpcPosAsNpcDat(class mHRBattle* const this, struct Vec& arg2) [?mCheckSamePopNpcPosAsNpcDat@mHRBattle@@QAEXABUVec@@@Z]
	void mCheckSamePopNpcPosAsNpcDat(struct Vec& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, struct Vec& arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f4910);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetEmptyNpcDatIndex(class mHRBattle* const this) [?mGetEmptyNpcDatIndex@mHRBattle@@QAEHXZ]
	int32_t mGetEmptyNpcDatIndex()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4920);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mRestorePcData4Lap(class mHRBattle* const this) [?mRestorePcData4Lap@mHRBattle@@QAEXXZ]
	void mRestorePcData4Lap()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4950);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mStorePcData4Lap(class mHRBattle* const this) [?mStorePcData4Lap@mHRBattle@@QAEXXZ]
	void mStorePcData4Lap()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4970);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCallPadProcess(class mHRBattle* const this) [?mCallPadProcess@mHRBattle@@QAEXXZ]
	void mCallPadProcess()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4d30);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mClearNpcDat(class mHRBattle* const this, int32_t arg2) [?mClearNpcDat@mHRBattle@@QAEXH@Z]
	void mClearNpcDat(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f4d60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mEffectProc(class mHRBattle* const this) [?mEffectProc@mHRBattle@@QAEXXZ]
	void mEffectProc()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f4ea0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetPopNpc(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4) [?mSetPopNpc@mHRBattle@@QAEXHABUVec@@0@Z]
	void mSetPopNpc(int32_t arg2, struct Vec& arg3, struct Vec& arg4)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4);
		_Func mFunc = (_Func)(GameModule + 0x3f5140);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mTestNpcType(class mHRBattle* const this, class mHRChara* arg2) [?mTestNpcType@mHRBattle@@QAE_NPAVmHRChara@@@Z]
	uint8_t mTestNpcType(class mHRChara* arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, class mHRChara* arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f51b0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetNpcEnterPattern(class mHRBattle* const this, int32_t arg2, int32_t arg3, struct Vec& arg4) [?mSetNpcEnterPattern@mHRBattle@@QAEXHHABUVec@@@Z]
	void mSetNpcEnterPattern(int32_t arg2, int32_t arg3, struct Vec& arg4)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3, struct Vec& arg4);
		_Func mFunc = (_Func)(GameModule + 0x3f5210);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetShadowRate4CommonObject(class mHRBattle* const this, int32_t arg2, int32_t arg3) [?mSetShadowRate4CommonObject@mHRBattle@@QAEXHH@Z]
	void mSetShadowRate4CommonObject(int32_t arg2, int32_t arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x3f53a0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCreateNewNpc(class mHRBattle* const this, int32_t arg2, int32_t arg3) [?mCreateNewNpc@mHRBattle@@QAEXHH@Z]
	void mCreateNewNpc(int32_t arg2, int32_t arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, int32_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x3f5410);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckNpcInitHp(class mHRBattle* const this, float* arg2) [?mCheckNpcInitHp@mHRBattle@@QAE_NPAM@Z]
	uint8_t mCheckNpcInitHp(float* arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, float* arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f7a30);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCheckDeadNpc(class mHRBattle* const this) [?mCheckDeadNpc@mHRBattle@@QAEXXZ]
	void mCheckDeadNpc()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f7a50);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetEmptyNpcIndex(class mHRBattle* const this) [?mGetEmptyNpcIndex@mHRBattle@@QAEHXZ]
	int32_t mGetEmptyNpcIndex()
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f7af0);
		return mFunc(this);
	}
	// [Function] uint32_t __convention("thiscall") mHRBattle::mGetResourceNpcNum(class mHRBattle* const this) [?mGetResourceNpcNum@mHRBattle@@QAEIXZ]
	uint32_t mGetResourceNpcNum()
	{
		typedef uint32_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f7b10);
		return mFunc(this);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceZakoNpcMotion(class mHRBattle* const this, char* arg2) [?mGetResourceZakoNpcMotion@mHRBattle@@QAEPAXPAD@Z]
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceZakoNpcMotion(char* arg2)
	{
		typedef void*(__thiscall* _Func)(class mHRBattle* const thisPtr, char* arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f7bb0);
		mFunc(this, arg2);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceZakoCmnMotion(class mHRBattle* const this, int32_t arg2) [?mGetResourceZakoCmnMotion@mHRBattle@@QAEPAXH@Z]
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceZakoCmnMotion(int32_t arg2)
	{
		typedef void*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f7cc0);
		mFunc(this, arg2);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceZakoWepMotion(class mHRBattle* const this, int32_t arg2) [?mGetResourceZakoWepMotion@mHRBattle@@QAEPAXH@Z]
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceZakoWepMotion(int32_t arg2)
	{
		typedef void*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f7cf0);
		mFunc(this, arg2);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceNpc(class mHRBattle* const this, int32_t arg2, char const** arg3) [?mGetResourceNpc@mHRBattle@@QAEPAXHPAPBD@Z]
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceNpc(int32_t arg2, char const** arg3)
	{
		typedef void*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, char const** arg3);
		_Func mFunc = (_Func)(GameModule + 0x3f7d90);
		mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetNpcDatIndexByCharPtr(class mHRBattle* const this, class mHRChara* arg2) [?GetNpcDatIndexByCharPtr@mHRBattle@@QAEHPAVmHRChara@@@Z]
	int32_t GetNpcDatIndexByCharPtr(class mHRChara* arg2)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, class mHRChara* arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f7e70);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotD(class mHRBattle* const this) [?mCameraRotD@mHRBattle@@QAEXXZ]
	void mCameraRotD()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f7ed0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotU(class mHRBattle* const this) [?mCameraRotU@mHRBattle@@QAEXXZ]
	void mCameraRotU()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f7f50);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotR(class mHRBattle* const this) [?mCameraRotR@mHRBattle@@QAEXXZ]
	void mCameraRotR()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f7fd0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraRotL(class mHRBattle* const this) [?mCameraRotL@mHRBattle@@QAEXXZ]
	void mCameraRotL()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f8080);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mCameraFrameProc(class mHRBattle* const this) [?mCameraFrameProc@mHRBattle@@QAEXXZ]
	void mCameraFrameProc()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f8130);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraOffset4Fps(class mHRBattle* const this, float arg2, float arg3, float arg4, int32_t arg5) [?mSetCameraOffset4Fps@mHRBattle@@QAEXMMMH@Z]
	void mSetCameraOffset4Fps(float arg2, float arg3, float arg4, int32_t arg5)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2, float arg3, float arg4, int32_t arg5);
		_Func mFunc = (_Func)(GameModule + 0x3f8e40);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetCameraOffset4Fps(class mHRBattle* const this, int32_t arg2) [?mResetCameraOffset4Fps@mHRBattle@@QAEXH@Z]
	void mResetCameraOffset4Fps(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f8f00);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraOffset4En(class mHRBattle* const this, float arg2, float arg3, float arg4, int32_t arg5) [?mSetCameraOffset4En@mHRBattle@@QAEXMMMH@Z]
	void mSetCameraOffset4En(float arg2, float arg3, float arg4, int32_t arg5)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2, float arg3, float arg4, int32_t arg5);
		_Func mFunc = (_Func)(GameModule + 0x3f8fd0);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraOffset4Pc(class mHRBattle* const this, float arg2, float arg3, float arg4, int32_t arg5) [?mSetCameraOffset4Pc@mHRBattle@@QAEXMMMH@Z]
	void mSetCameraOffset4Pc(float arg2, float arg3, float arg4, int32_t arg5)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2, float arg3, float arg4, int32_t arg5);
		_Func mFunc = (_Func)(GameModule + 0x3f9090);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockOnCameraZoomIn(class mHRBattle* const this, int32_t arg2) [?mSetLockOnCameraZoomIn@mHRBattle@@QAEXH@Z]
	void mSetLockOnCameraZoomIn(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f9130);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockOnCameraZoomOut(class mHRBattle* const this, int32_t arg2) [?mSetLockOnCameraZoomOut@mHRBattle@@QAEXH@Z]
	void mSetLockOnCameraZoomOut(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f91f0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mResetLockOnCameraZoom(class mHRBattle* const this, int32_t arg2) [?mResetLockOnCameraZoom@mHRBattle@@QAEXH@Z]
	void mResetLockOnCameraZoom(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f92c0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckUndispStatusStage(class mHRBattle* const this) [?mCheckUndispStatusStage@mHRBattle@@QAE_NXZ]
	uint8_t mCheckUndispStatusStage()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f9390);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMoveInitCamera4MiniDemo(class mHRBattle* const this) [?mSetMoveInitCamera4MiniDemo@mHRBattle@@QAEXXZ]
	void mSetMoveInitCamera4MiniDemo()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f93a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLockOnCamera(class mHRBattle* const this) [?mSetLockOnCamera@mHRBattle@@QAEXXZ]
	void mSetLockOnCamera()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f9470);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mPcTerm(class mHRBattle* const this) [?mPcTerm@mHRBattle@@QAE_NXZ]
	uint8_t mPcTerm()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f9480);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mPcInit(class mHRBattle* const this) [?mPcInit@mHRBattle@@QAE_NXZ]
	uint8_t mPcInit()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f94e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mPopPcSaveData(class mHRBattle* const this) [?mPopPcSaveData@mHRBattle@@QAEXXZ]
	void mPopPcSaveData()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f9980);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mPushPcSaveData(class mHRBattle* const this) [?mPushPcSaveData@mHRBattle@@QAEXXZ]
	void mPushPcSaveData()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f99c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mInitStart(class mHRBattle* const this) [?mInitStart@mHRBattle@@QAEXXZ]
	void mInitStart()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3f99f0);
		return mFunc(this);
	}
	// [Function] void* __convention("thiscall") mHRBattle::mGetResourceCmnObj(class mHRBattle* const this, int32_t arg2) [?mGetResourceCmnObj@mHRBattle@@QAEPAXH@Z]
	// Can't export void pointer 'void*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetResourceCmnObj(int32_t arg2)
	{
		typedef void*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3f9cb0);
		mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetLightReflecte(class mHRBattle* const this, struct Vec& arg2, float const arg3, uint32_t const arg4, int32_t const arg5, float const arg6, enum eLightRefPriority arg7) [?mSetLightReflecte@mHRBattle@@QAEXABUVec@@MIHMW4eLightRefPriority@@@Z]
	void mSetLightReflecte(struct Vec& arg2, float const arg3, uint32_t const arg4, int32_t const arg5, float const arg6, enum eLightRefPriority arg7)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, struct Vec& arg2, float const arg3, uint32_t const arg4, int32_t const arg5, float const arg6, enum eLightRefPriority arg7);
		_Func mFunc = (_Func)(GameModule + 0x3f9d50);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mInit(class mHRBattle* const this) [?mInit@mHRBattle@@QAE_NXZ]
	uint8_t mInit()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa000);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mFrameProc(class mHRBattle* const this) [?mFrameProc@mHRBattle@@QAE_NXZ]
	uint8_t mFrameProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa0a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetVisibleAll(class mHRBattle* const this, uint8_t arg2) [?mSetVisibleAll@mHRBattle@@QAEX_N@Z]
	void mSetVisibleAll(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fa310);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetOperateAll(class mHRBattle* const this, uint8_t arg2) [?mSetOperateAll@mHRBattle@@QAEX_N@Z]
	void mSetOperateAll(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fa370);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetNewGameDataRequest(class mHRBattle* const this, uint8_t arg2) [?mSetNewGameDataRequest@mHRBattle@@QAEX_N@Z]
	void mSetNewGameDataRequest(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fa3b0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mTerm(class mHRBattle* const this) [?mTerm@mHRBattle@@QAE_NXZ]
	uint8_t mTerm()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa3d0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mPostRenderProc(class mHRBattle* const this) [?mPostRenderProc@mHRBattle@@QAE_NXZ]
	uint8_t mPostRenderProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa480);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::GetBowlingSubMissionResult(class mHRBattle* const this, int32_t arg2) [?GetBowlingSubMissionResult@mHRBattle@@QAEHH@Z]
	int32_t GetBowlingSubMissionResult(int32_t arg2)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fa4f0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckPcLoaded(class mHRBattle* const this) [?mCheckPcLoaded@mHRBattle@@QAE_NXZ]
	uint8_t mCheckPcLoaded()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa500);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mGetPcOperate(class mHRBattle* const this) [?mGetPcOperate@mHRBattle@@QAE_NXZ]
	uint8_t mGetPcOperate()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa520);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetMoveInitCamera(class mHRBattle* const this, uint8_t arg2, uint8_t arg3, uint8_t arg4, uint8_t arg5) [?mSetMoveInitCamera@mHRBattle@@QAEX_N000@Z]
	void mSetMoveInitCamera(uint8_t arg2, uint8_t arg3, uint8_t arg4, uint8_t arg5)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2, uint8_t arg3, uint8_t arg4, uint8_t arg5);
		_Func mFunc = (_Func)(GameModule + 0x3fa540);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] void __convention("thiscall") mHRBattle::mInitStartMainMission(class mHRBattle* const this) [?mInitStartMainMission@mHRBattle@@QAEXXZ]
	void mInitStartMainMission()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fa6a0);
		return mFunc(this);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::mGetNpcPtr(class mHRBattle* const this, int32_t arg2) [?mGetNpcPtr@mHRBattle@@QAEPAVmHRChara@@H@Z]
	class mHRChara* mGetNpcPtr(int32_t arg2)
	{
		typedef class mHRChara*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fa6d0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, uint8_t arg8) [?mSetInitNpcDat@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@_N@Z]
	int32_t mSetInitNpcDat(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, uint8_t arg8)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, uint8_t arg8);
		_Func mFunc = (_Func)(GameModule + 0x3fa710);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitObjDat(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4, uint8_t arg5, char const* arg6, class TGmfNode* arg7, int32_t arg8, int32_t arg9) [?mSetInitObjDat@mHRBattle@@QAEHHABUVec@@0_NPBDPBVTGmfNode@@HH@Z]
	int32_t mSetInitObjDat(int32_t arg2, struct Vec& arg3, struct Vec& arg4, uint8_t arg5, std::string arg6, class TGmfNode* arg7, int32_t arg8, int32_t arg9)
	{
		char const* arg6_c_str = arg6.c_str();
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4, uint8_t arg5, char const* arg6, class TGmfNode* arg7, int32_t arg8, int32_t arg9);
		_Func mFunc = (_Func)(GameModule + 0x3fa830);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6_c_str, arg7, arg8, arg9);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetPopType(class mHRBattle* const this, int32_t arg2, enum enPopReqType arg3) [?mSetPopType@mHRBattle@@QAEXHW4enPopReqType@@@Z]
	void mSetPopType(int32_t arg2, enum enPopReqType arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enPopReqType arg3);
		_Func mFunc = (_Func)(GameModule + 0x3fac90);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mSetPcKind(class mHRBattle* const this, enum enPcKind arg2, uint8_t arg3) [?mSetPcKind@mHRBattle@@QAE_NW4enPcKind@@_N@Z]
	uint8_t mSetPcKind(enum enPcKind arg2, uint8_t arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, enum enPcKind arg2, uint8_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x3facc0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat2(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, uint8_t arg11) [?mSetInitNpcDat2@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMM_N@Z]
	int32_t mSetInitNpcDat2(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, uint8_t arg11)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, uint8_t arg11);
		_Func mFunc = (_Func)(GameModule + 0x3fadc0);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10, arg11);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat3(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, uint8_t arg12) [?mSetInitNpcDat3@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMH_N@Z]
	int32_t mSetInitNpcDat3(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, uint8_t arg12)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, uint8_t arg12);
		_Func mFunc = (_Func)(GameModule + 0x3faef0);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10, arg11, arg12);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat4(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13) [?mSetInitNpcDat4@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_N@Z]
	int32_t mSetInitNpcDat4(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13);
		_Func mFunc = (_Func)(GameModule + 0x3fb020);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10, arg11, arg12, arg13);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat5(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15) [?mSetInitNpcDat5@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_NMH@Z]
	int32_t mSetInitNpcDat5(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15);
		_Func mFunc = (_Func)(GameModule + 0x3fb190);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10, arg11, arg12, arg13, arg14, arg15);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat6(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16) [?mSetInitNpcDat6@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_NMHH@Z]
	int32_t mSetInitNpcDat6(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16);
		_Func mFunc = (_Func)(GameModule + 0x3fb310);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10, arg11, arg12, arg13, arg14, arg15, arg16);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDat7(class mHRBattle* const this, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16) [?mSetInitNpcDat7@mHRBattle@@QAEHHW4enCharaType@@HABUVec@@1W4enPopReqType@@HMMHPAD_NMHH@Z]
	int32_t mSetInitNpcDat7(int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum enCharaType arg3, int32_t arg4, struct Vec& arg5, struct Vec& arg6, enum enPopReqType arg7, int32_t arg8, float arg9, float arg10, int32_t arg11, char* arg12, uint8_t arg13, float arg14, int32_t arg15, int32_t arg16);
		_Func mFunc = (_Func)(GameModule + 0x3fb4a0);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10, arg11, arg12, arg13, arg14, arg15, arg16);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDatObj095(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6) [?mSetInitNpcDatObj095@mHRBattle@@QAEHHABUVec@@0HH@Z]
	int32_t mSetInitNpcDatObj095(int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6);
		_Func mFunc = (_Func)(GameModule + 0x3fb630);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6);
	}
	// [Function] void __convention("thiscall") mHRBattle::mDispPcStatus(class mHRBattle* const this) [?mDispPcStatus@mHRBattle@@QAEXXZ]
	void mDispPcStatus()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fb740);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mDispMiniMap(class mHRBattle* const this) [?mDispMiniMap@mHRBattle@@QAEXXZ]
	void mDispMiniMap()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fb750);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mUndispMiniMap(class mHRBattle* const this) [?mUndispMiniMap@mHRBattle@@QAEXXZ]
	void mUndispMiniMap()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fb7f0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mDeleteNpc(class mHRBattle* const this, int32_t arg2) [?mDeleteNpc@mHRBattle@@QAE_NH@Z]
	uint8_t mDeleteNpc(int32_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fb810);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::RequestMotionNoNpc(class mHRBattle* const this, enum enCharaType arg2, int32_t arg3, uint8_t arg4) [?RequestMotionNoNpc@mHRBattle@@QAE_NW4enCharaType@@H_N@Z]
	uint8_t RequestMotionNoNpc(enum enCharaType arg2, int32_t arg3, uint8_t arg4)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, enum enCharaType arg2, int32_t arg3, uint8_t arg4);
		_Func mFunc = (_Func)(GameModule + 0x3fb8b0);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::mGetNpcPtrFromCharaType(class mHRBattle* const this, enum enCharaType arg2) [?mGetNpcPtrFromCharaType@mHRBattle@@QAEPAVmHRChara@@W4enCharaType@@@Z]
	class mHRChara* mGetNpcPtrFromCharaType(enum enCharaType arg2)
	{
		typedef class mHRChara*(__thiscall* _Func)(class mHRBattle* const thisPtr, enum enCharaType arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fb970);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetZakoNpcMotionProcessDisEnable(class mHRBattle* const this, uint8_t arg2) [?mSetZakoNpcMotionProcessDisEnable@mHRBattle@@QAEX_N@Z]
	void mSetZakoNpcMotionProcessDisEnable(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fb9d0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetAspectRate(class mHRBattle* const this, float arg2, int32_t arg3) [?mSetAspectRate@mHRBattle@@QAEXMH@Z]
	void mSetAspectRate(float arg2, int32_t arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2, int32_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x3fba20);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mCheckExistEnemy(class mHRBattle* const this) [?mCheckExistEnemy@mHRBattle@@QAE_NXZ]
	uint8_t mCheckExistEnemy()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fba60);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mAllTestZakoDamage(class mHRBattle* const this, int32_t arg2) [?mAllTestZakoDamage@mHRBattle@@QAE_NH@Z]
	uint8_t mAllTestZakoDamage(int32_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fbab0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mAllTestZakoTameDamage(class mHRBattle* const this) [?mAllTestZakoTameDamage@mHRBattle@@QAE_NXZ]
	uint8_t mAllTestZakoTameDamage()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fbb00);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mAllEnemyDie(class mHRBattle* const this) [?mAllEnemyDie@mHRBattle@@QAE_NXZ]
	uint8_t mAllEnemyDie()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fbb20);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mAllClearNpcData(class mHRBattle* const this) [?mAllClearNpcData@mHRBattle@@QAEXXZ]
	void mAllClearNpcData()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fbbb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetCameraProjection(class mHRBattle* const this, float arg2) [?mSetCameraProjection@mHRBattle@@QAEXM@Z]
	void mSetCameraProjection(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fbcb0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mGetObjNpcID(class mHRBattle* const this, int32_t arg2, char* arg3) [?mGetObjNpcID@mHRBattle@@QAEHHPAD@Z]
	int32_t mGetObjNpcID(int32_t arg2, char* arg3)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, char* arg3);
		_Func mFunc = (_Func)(GameModule + 0x3fbcf0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRBattle::mGetObjPtr(class mHRBattle* const this, int32_t arg2, char* arg3) [?mGetObjPtr@mHRBattle@@QAEPAVmHRChara@@HPAD@Z]
	class mHRChara* mGetObjPtr(int32_t arg2, char* arg3)
	{
		typedef class mHRChara*(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, char* arg3);
		_Func mFunc = (_Func)(GameModule + 0x3fbd70);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRBattle::mPopNpc(class mHRBattle* const this) [?mPopNpc@mHRBattle@@QAEXXZ]
	void mPopNpc()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fbe00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetSlowMotionTick(class mHRBattle* const this, int32_t arg2, enum stBtEffect::SlowType arg3) [?mSetSlowMotionTick@mHRBattle@@QAEXHW4SlowType@stBtEffect@@@Z]
	void mSetSlowMotionTick(int32_t arg2, enum stBtEffect::SlowType arg3)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, enum stBtEffect::SlowType arg3);
		_Func mFunc = (_Func)(GameModule + 0x3fca40);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mReleaseAllEnemy(class mHRBattle* const this) [?mReleaseAllEnemy@mHRBattle@@QAE_NXZ]
	uint8_t mReleaseAllEnemy()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fca70);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRBattle::mSetInitNpcDatObj183(class mHRBattle* const this, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6, uint8_t arg7, int32_t arg8) [?mSetInitNpcDatObj183@mHRBattle@@QAEHHABUVec@@0HH_NH@Z]
	int32_t mSetInitNpcDatObj183(int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6, uint8_t arg7, int32_t arg8)
	{
		typedef int32_t(__thiscall* _Func)(class mHRBattle* const thisPtr, int32_t arg2, struct Vec& arg3, struct Vec& arg4, int32_t arg5, int32_t arg6, uint8_t arg7, int32_t arg8);
		_Func mFunc = (_Func)(GameModule + 0x3fcb80);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mReleaseAllNpc(class mHRBattle* const this) [?mReleaseAllNpc@mHRBattle@@QAE_NXZ]
	uint8_t mReleaseAllNpc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fcca0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetDontAppearStatus(class mHRBattle* const this) [?mSetDontAppearStatus@mHRBattle@@QAEXXZ]
	void mSetDontAppearStatus()
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fcd70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRBattle::CameraMotionModeReset(class mHRBattle* const this, uint8_t arg2) [?CameraMotionModeReset@mHRBattle@@QAEX_N@Z]
	void CameraMotionModeReset(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fcd80);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mSetPcOperate(class mHRBattle* const this, uint8_t arg2) [?mSetPcOperate@mHRBattle@@QAEX_N@Z]
	void mSetPcOperate(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fce10);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRBattle::mUndispPcStatus(class mHRBattle* const this, uint8_t arg2) [?mUndispPcStatus@mHRBattle@@QAEX_N@Z]
	void mUndispPcStatus(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRBattle* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fce30);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRBattle::mRenderProc(class mHRBattle* const this) [?mRenderProc@mHRBattle@@QAE_NXZ]
	uint8_t mRenderProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRBattle* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x3fce50);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRBattle::mGetNpcMotionSpd(class mHRBattle* const this, class mHRChara* arg2) [?mGetNpcMotionSpd@mHRBattle@@QAEMPAVmHRChara@@@Z]
	float mGetNpcMotionSpd(class mHRChara* arg2)
	{
		typedef float(__thiscall* _Func)(class mHRBattle* const thisPtr, class mHRChara* arg2);
		_Func mFunc = (_Func)(GameModule + 0x3fce60);
		return mFunc(this, arg2);
	}
	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData[146492];
public:

	std::string ToString() const { return "class mHRBattle(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<mHRBattle>("mHRBattle")
			.addFunction("__tostring", &mHRBattle::ToString)
			.addFunction("GetPtrAddr", &mHRBattle::GetPtrAddr)
			.addFunction("mGetPcPtr", &mHRBattle::mGetPcPtr)
			.addFunction("mGetSlowMotionTick", &mHRBattle::mGetSlowMotionTick)
			.addFunction("mGetBulletSlow", &mHRBattle::mGetBulletSlow)
			.addFunction("mGetBtEffect", &mHRBattle::mGetBtEffect)
			.addFunction("mSetNpcAttackFlag", &mHRBattle::mSetNpcAttackFlag)
			.addFunction("mSetNpcAttackRate", &mHRBattle::mSetNpcAttackRate)
			.addFunction("SetNpcDatMax", &mHRBattle::SetNpcDatMax)
			.addFunction("GetSmokeEf", &mHRBattle::GetSmokeEf)
			.addFunction("mGetPcKind", &mHRBattle::mGetPcKind)
			.addFunction("mGetFrameProc", &mHRBattle::mGetFrameProc)
			.addFunction("mSetCameraAngle", &mHRBattle::mSetCameraAngle)
			.addFunction("mSetCamMotFlag", &mHRBattle::mSetCamMotFlag)
			.addFunction("mSetCamMotFlagNoUse", &mHRBattle::mSetCamMotFlagNoUse)
			.addFunction("mSetCameraAutoReturnDisEnable", &mHRBattle::mSetCameraAutoReturnDisEnable)
			.addFunction("mClearKillNum", &mHRBattle::mClearKillNum)
			.addFunction("mGetKillNum", &mHRBattle::mGetKillNum)
			.addFunction("mSetKillNum", &mHRBattle::mSetKillNum)
			.addFunction("GetRevengeMissionZakoKillNum", &mHRBattle::GetRevengeMissionZakoKillNum)
			.addFunction("ClearRevengeMissionZakoKillNum", &mHRBattle::ClearRevengeMissionZakoKillNum)
			.addFunction("mSetBattlePause", &mHRBattle::mSetBattlePause)
			.addFunction("mSetDispStatusDisEnable", &mHRBattle::mSetDispStatusDisEnable)
			.addFunction("mGetDispStatusDisEnable", &mHRBattle::mGetDispStatusDisEnable)
			.addFunction("mSetChargeDamage", &mHRBattle::mSetChargeDamage)
			.addFunction("mClearTotalKillNum", &mHRBattle::mClearTotalKillNum)
			.addFunction("mGetTutoRun", &mHRBattle::mGetTutoRun)
			.addFunction("mSubRepopNum", &mHRBattle::mSubRepopNum)
			.addFunction("mSetRepopTimer", &mHRBattle::mSetRepopTimer)
			.addFunction("mGetNewGameDataRequest", &mHRBattle::mGetNewGameDataRequest)
			.addFunction("mGetDontChangeTeppeiCamera", &mHRBattle::mGetDontChangeTeppeiCamera)
			.addFunction("mGetCameraProjection", &mHRBattle::mGetCameraProjection)
			.addFunction("mSetCameraMoveFlag", &mHRBattle::mSetCameraMoveFlag)
			.addFunction("mSetMotionCameraPos", &mHRBattle::mSetMotionCameraPos)
			.addFunction("mGetMotionCameraPos", &mHRBattle::mGetMotionCameraPos)
			// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetMotionCameraY", &mHRBattle::mSetMotionCameraY)
			.addFunction("mGetMotionCameraY", &mHRBattle::mGetMotionCameraY)
			.addFunction("mGetBattlePause", &mHRBattle::mGetBattlePause)
			.addFunction("mGetChargeDamage", &mHRBattle::mGetChargeDamage)
			.addFunction("mGetChangeCameraRailFlag", &mHRBattle::mGetChangeCameraRailFlag)
			.addFunction("mGetCameraAngleX", &mHRBattle::mGetCameraAngleX)
			.addFunction("mSetLockNavelPos", &mHRBattle::mSetLockNavelPos)
			.addFunction("mGetTotalKillNum", &mHRBattle::mGetTotalKillNum)
			.addFunction("mSetTotalKillNum", &mHRBattle::mSetTotalKillNum)
			.addFunction("mGetBossBreakSlow", &mHRBattle::mGetBossBreakSlow)
			.addFunction("mGetNpcAttackFlag", &mHRBattle::mGetNpcAttackFlag)
			.addFunction("mGetNpcAttackRate", &mHRBattle::mGetNpcAttackRate)
			.addFunction("AddRevengeMissionZakoKillNum", &mHRBattle::AddRevengeMissionZakoKillNum)
			.addFunction("SetCameraMotionEndStop", &mHRBattle::SetCameraMotionEndStop)
			.addFunction("IsBgmEffect", &mHRBattle::IsBgmEffect)
			.addFunction("mSetDontChangeTeppeiCamera", &mHRBattle::mSetDontChangeTeppeiCamera)
			.addFunction("UpdateMassKillAchievement", &mHRBattle::UpdateMassKillAchievement)
			.addFunction("UpdateMainScreenUI", &mHRBattle::UpdateMainScreenUI)
			.addFunction("BgmEffectProc", &mHRBattle::BgmEffectProc)
			.addFunction("SetBgmEffect", &mHRBattle::SetBgmEffect)
			.addFunction("GetNpc", &mHRBattle::GetNpc)
			.addFunction("mCheckPcLoaded4WepaponChange", &mHRBattle::mCheckPcLoaded4WepaponChange)
			.addFunction("mCheckBattleInit", &mHRBattle::mCheckBattleInit)
			.addStaticFunction("ChkToiletStage", &mHRBattle::ChkToiletStage)
			.addStaticFunction("ChkBikeStage", &mHRBattle::ChkBikeStage)
			.addFunction("GetPickUpGomiSubMissionResult", &mHRBattle::GetPickUpGomiSubMissionResult)
			.addFunction("mAddKillNum", &mHRBattle::mAddKillNum)
			.addFunction("mSetNpcAppear", &mHRBattle::mSetNpcAppear)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("FixRotationOfItem", &mHRBattle::FixRotationOfItem)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("FixPositionOfItem", &mHRBattle::FixPositionOfItem)
			.addFunction("mSetInitCustomColliderObj", &mHRBattle::mSetInitCustomColliderObj)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitCharaPos", &mHRBattle::mSetInitCharaPos)
			.addFunction("mCheckStatusDispOnlyBattery", &mHRBattle::mCheckStatusDispOnlyBattery)
			.addFunction("mCheckStatusDispWithoutBattery", &mHRBattle::mCheckStatusDispWithoutBattery)
			.addFunction("mCheckStatusDisp", &mHRBattle::mCheckStatusDisp)
			.addFunction("mUndispMoney", &mHRBattle::mUndispMoney)
			.addFunction("mDispMoney", &mHRBattle::mDispMoney)
			.addFunction("mGetDispPcStatus", &mHRBattle::mGetDispPcStatus)
			.addFunction("mReleaseAllNpcWithoutCmnObj", &mHRBattle::mReleaseAllNpcWithoutCmnObj)
			.addFunction("mSetBulletSlowTick", &mHRBattle::mSetBulletSlowTick)
			.addFunction("mResetBulletSlow", &mHRBattle::mResetBulletSlow)
			.addFunction("mResetSlowMotion", &mHRBattle::mResetSlowMotion)
			.addFunction("mLightReflectEfProc", &mHRBattle::mLightReflectEfProc)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mCheckSamePopNpcPosAsNpcDat", &mHRBattle::mCheckSamePopNpcPosAsNpcDat)
			.addFunction("mGetEmptyNpcDatIndex", &mHRBattle::mGetEmptyNpcDatIndex)
			.addFunction("mRestorePcData4Lap", &mHRBattle::mRestorePcData4Lap)
			.addFunction("mStorePcData4Lap", &mHRBattle::mStorePcData4Lap)
			.addFunction("mCallPadProcess", &mHRBattle::mCallPadProcess)
			.addFunction("mClearNpcDat", &mHRBattle::mClearNpcDat)
			.addFunction("mEffectProc", &mHRBattle::mEffectProc)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetPopNpc", &mHRBattle::mSetPopNpc)
			.addFunction("mTestNpcType", &mHRBattle::mTestNpcType)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetNpcEnterPattern", &mHRBattle::mSetNpcEnterPattern)
			.addFunction("mSetShadowRate4CommonObject", &mHRBattle::mSetShadowRate4CommonObject)
			.addFunction("mCreateNewNpc", &mHRBattle::mCreateNewNpc)
			// Can't export pointer to native type 'float*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mCheckNpcInitHp", &mHRBattle::mCheckNpcInitHp)
			.addFunction("mCheckDeadNpc", &mHRBattle::mCheckDeadNpc)
			.addFunction("mGetEmptyNpcIndex", &mHRBattle::mGetEmptyNpcIndex)
			.addFunction("mGetResourceNpcNum", &mHRBattle::mGetResourceNpcNum)
			// Can't export pointer to native type 'char*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mGetResourceZakoNpcMotion", &mHRBattle::mGetResourceZakoNpcMotion)
			.addFunction("mGetResourceZakoCmnMotion", &mHRBattle::mGetResourceZakoCmnMotion)
			.addFunction("mGetResourceZakoWepMotion", &mHRBattle::mGetResourceZakoWepMotion)
			// Can't export pointer to native type 'char const**' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mGetResourceNpc", &mHRBattle::mGetResourceNpc)
			.addFunction("GetNpcDatIndexByCharPtr", &mHRBattle::GetNpcDatIndexByCharPtr)
			.addFunction("mCameraRotD", &mHRBattle::mCameraRotD)
			.addFunction("mCameraRotU", &mHRBattle::mCameraRotU)
			.addFunction("mCameraRotR", &mHRBattle::mCameraRotR)
			.addFunction("mCameraRotL", &mHRBattle::mCameraRotL)
			.addFunction("mCameraFrameProc", &mHRBattle::mCameraFrameProc)
			.addFunction("mSetCameraOffset4Fps", &mHRBattle::mSetCameraOffset4Fps)
			.addFunction("mResetCameraOffset4Fps", &mHRBattle::mResetCameraOffset4Fps)
			.addFunction("mSetCameraOffset4En", &mHRBattle::mSetCameraOffset4En)
			.addFunction("mSetCameraOffset4Pc", &mHRBattle::mSetCameraOffset4Pc)
			.addFunction("mSetLockOnCameraZoomIn", &mHRBattle::mSetLockOnCameraZoomIn)
			.addFunction("mSetLockOnCameraZoomOut", &mHRBattle::mSetLockOnCameraZoomOut)
			.addFunction("mResetLockOnCameraZoom", &mHRBattle::mResetLockOnCameraZoom)
			.addFunction("mCheckUndispStatusStage", &mHRBattle::mCheckUndispStatusStage)
			.addFunction("mSetMoveInitCamera4MiniDemo", &mHRBattle::mSetMoveInitCamera4MiniDemo)
			.addFunction("mSetLockOnCamera", &mHRBattle::mSetLockOnCamera)
			.addFunction("mPcTerm", &mHRBattle::mPcTerm)
			.addFunction("mPcInit", &mHRBattle::mPcInit)
			.addFunction("mPopPcSaveData", &mHRBattle::mPopPcSaveData)
			.addFunction("mPushPcSaveData", &mHRBattle::mPushPcSaveData)
			.addFunction("mInitStart", &mHRBattle::mInitStart)
			.addFunction("mGetResourceCmnObj", &mHRBattle::mGetResourceCmnObj)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetLightReflecte", &mHRBattle::mSetLightReflecte)
			.addFunction("mInit", &mHRBattle::mInit)
			.addFunction("mFrameProc", &mHRBattle::mFrameProc)
			.addFunction("mSetVisibleAll", &mHRBattle::mSetVisibleAll)
			.addFunction("mSetOperateAll", &mHRBattle::mSetOperateAll)
			.addFunction("mSetNewGameDataRequest", &mHRBattle::mSetNewGameDataRequest)
			.addFunction("mTerm", &mHRBattle::mTerm)
			.addFunction("mPostRenderProc", &mHRBattle::mPostRenderProc)
			.addFunction("GetBowlingSubMissionResult", &mHRBattle::GetBowlingSubMissionResult)
			.addFunction("mCheckPcLoaded", &mHRBattle::mCheckPcLoaded)
			.addFunction("mGetPcOperate", &mHRBattle::mGetPcOperate)
			.addFunction("mSetMoveInitCamera", &mHRBattle::mSetMoveInitCamera)
			.addFunction("mInitStartMainMission", &mHRBattle::mInitStartMainMission)
			.addFunction("mGetNpcPtr", &mHRBattle::mGetNpcPtr)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDat", &mHRBattle::mSetInitNpcDat)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitObjDat", &mHRBattle::mSetInitObjDat)
			.addFunction("mSetPopType", &mHRBattle::mSetPopType)
			.addFunction("mSetPcKind", &mHRBattle::mSetPcKind)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat2", &mHRBattle::mSetInitNpcDat2)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat3", &mHRBattle::mSetInitNpcDat3)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat4", &mHRBattle::mSetInitNpcDat4)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat5", &mHRBattle::mSetInitNpcDat5)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat6", &mHRBattle::mSetInitNpcDat6)
			// Can't export functions with more than 8 parameters to LuaBridge.
			//.addFunction("mSetInitNpcDat7", &mHRBattle::mSetInitNpcDat7)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDatObj095", &mHRBattle::mSetInitNpcDatObj095)
			.addFunction("mDispPcStatus", &mHRBattle::mDispPcStatus)
			.addFunction("mDispMiniMap", &mHRBattle::mDispMiniMap)
			.addFunction("mUndispMiniMap", &mHRBattle::mUndispMiniMap)
			.addFunction("mDeleteNpc", &mHRBattle::mDeleteNpc)
			.addFunction("RequestMotionNoNpc", &mHRBattle::RequestMotionNoNpc)
			.addFunction("mGetNpcPtrFromCharaType", &mHRBattle::mGetNpcPtrFromCharaType)
			.addFunction("mSetZakoNpcMotionProcessDisEnable", &mHRBattle::mSetZakoNpcMotionProcessDisEnable)
			.addFunction("mSetAspectRate", &mHRBattle::mSetAspectRate)
			.addFunction("mCheckExistEnemy", &mHRBattle::mCheckExistEnemy)
			.addFunction("mAllTestZakoDamage", &mHRBattle::mAllTestZakoDamage)
			.addFunction("mAllTestZakoTameDamage", &mHRBattle::mAllTestZakoTameDamage)
			.addFunction("mAllEnemyDie", &mHRBattle::mAllEnemyDie)
			.addFunction("mAllClearNpcData", &mHRBattle::mAllClearNpcData)
			.addFunction("mSetCameraProjection", &mHRBattle::mSetCameraProjection)
			// Can't export pointer to native type 'char*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mGetObjNpcID", &mHRBattle::mGetObjNpcID)
			// Can't export pointer to native type 'char*' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mGetObjPtr", &mHRBattle::mGetObjPtr)
			.addFunction("mPopNpc", &mHRBattle::mPopNpc)
			.addFunction("mSetSlowMotionTick", &mHRBattle::mSetSlowMotionTick)
			.addFunction("mReleaseAllEnemy", &mHRBattle::mReleaseAllEnemy)
			// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
			//.addFunction("mSetInitNpcDatObj183", &mHRBattle::mSetInitNpcDatObj183)
			.addFunction("mReleaseAllNpc", &mHRBattle::mReleaseAllNpc)
			.addFunction("mSetDontAppearStatus", &mHRBattle::mSetDontAppearStatus)
			.addFunction("CameraMotionModeReset", &mHRBattle::CameraMotionModeReset)
			.addFunction("mSetPcOperate", &mHRBattle::mSetPcOperate)
			.addFunction("mUndispPcStatus", &mHRBattle::mUndispPcStatus)
			.addFunction("mRenderProc", &mHRBattle::mRenderProc)
			.addFunction("mGetNpcMotionSpd", &mHRBattle::mGetNpcMotionSpd)
		.endClass();
	}
#endif
};
static_assert(sizeof(mHRBattle) == 146492, "expected class mHRBattle to be size 146492");

// enum enPcAttackEffect
enum enPcAttackEffect : uint32_t
{
	// <eEfGuard = 0x0>
	eEfGuard = 0,

	// <eEfHitSword = 0x1>
	eEfHitSword = 1,

	// <eEfHitFight = 0x2>
	eEfHitFight = 2,

	// <eEfHitPiyori = 0x3>
	eEfHitPiyori = 3,

	// <eEfHitGuardBreak = 0x4>
	eEfHitGuardBreak = 4,

	// <eEfMax = 0x5>
	eEfMax = 5

};

// enum enThrowDir
enum enThrowDir : uint32_t
{
	// <enThrowDirF = 0x0>
	enThrowDirF = 0,

	// <enThrowDirB = 0x1>
	enThrowDirB = 1,

	// <enThrowDirLR = 0x2>
	enThrowDirLR = 2,

	// <enThrowDirH = 0x3>
	enThrowDirH = 3,

	// <enThrowDirMax = 0x4>
	enThrowDirMax = 4

};

// enum enScreenChangeStatus
enum enScreenChangeStatus : uint32_t
{
	// <ScreenChangeStatusStandby = 0x0>
	ScreenChangeStatusStandby = 0,

	// <ScreenChangeStatusFadeIn = 0x1>
	ScreenChangeStatusFadeIn = 1,

	// <ScreenChangeStatusFadeStandby = 0x2>
	ScreenChangeStatusFadeStandby = 2,

	// <ScreenChangeStatusFadeOut = 0x3>
	ScreenChangeStatusFadeOut = 3,

	// <ScreenChangeStatusMax = 0x4>
	ScreenChangeStatusMax = 4

};

// enum eEfDmgLevel
enum eEfDmgLevel : uint32_t
{
	// <eEfDmgLevel_UNKNOWN = 0xffffffffffffffff>
	eEfDmgLevel_UNKNOWN = UINT32_MAX,

	// <eEfDmgLevel_Small = 0x0>
	eEfDmgLevel_Small = 0,

	// <eEfDmgLevel_Big = 0x1>
	eEfDmgLevel_Big = 1,

	// <eEfDmgLevel_Slash = 0x2>
	eEfDmgLevel_Slash = 2,

	// <eEfDmgLevel_NUM = 0x3>
	eEfDmgLevel_NUM = 3

};

// enum enDownStatus
enum enDownStatus : uint32_t
{
	// <eDownFront = 0x0>
	eDownFront = 0,

	// <eDownBack = 0x1>
	eDownBack = 1,

	// <eDownMax = 0x2>
	eDownMax = 2

};

// enum enPcPose
enum enPcPose : uint32_t
{
	// <ePcPoseUpper = 0x0>
	ePcPoseUpper = 0,

	// <ePcPoseBottom = 0x1>
	ePcPoseBottom = 1,

	// <ePcPoseMax = 0x2>
	ePcPoseMax = 2

};

// enum enPcCmbKind
enum enPcCmbKind : uint32_t
{
	// <ePcAtkFghtCmbUp = 0x0>
	ePcAtkFghtCmbUp = 0,

	// <ePcAtkFghtCmbDw = 0x1>
	ePcAtkFghtCmbDw = 1,

	// <ePcAtkCmb01Up = 0x2>
	ePcAtkCmb01Up = 2,

	// <ePcAtkCmb01Btm = 0x3>
	ePcAtkCmb01Btm = 3,

	// <ePcAtkCmb02Up = 0x4>
	ePcAtkCmb02Up = 4,

	// <ePcAtkCmb02Btm = 0x5>
	ePcAtkCmb02Btm = 5,

	// <ePcAtkCmb03Up = 0x6>
	ePcAtkCmb03Up = 6,

	// <ePcAtkCmb03Btm = 0x7>
	ePcAtkCmb03Btm = 7,

	// <ePcAtkCmb04Up = 0x8>
	ePcAtkCmb04Up = 8,

	// <ePcAtkCmb04Btm = 0x9>
	ePcAtkCmb04Btm = 9,

	// <ePcAtkCmb01Dncng = 0xa>
	ePcAtkCmb01Dncng = 10,

	// <ePcAtkCmb02Dncng = 0xb>
	ePcAtkCmb02Dncng = 11,

	// <ePcAtkCmb03Dncng = 0xc>
	ePcAtkCmb03Dncng = 12,

	// <ePcAtkCmb04Dncng = 0xd>
	ePcAtkCmb04Dncng = 13,

	// <eSNBAtkCmb01Up = 0xe>
	eSNBAtkCmb01Up = 14,

	// <eSNBAtkCmb01Btm = 0xf>
	eSNBAtkCmb01Btm = 15,

	// <eHENAtkCmb01Up = 0x10>
	eHENAtkCmb01Up = 16,

	// <eHENAtkCmb01Btm = 0x11>
	eHENAtkCmb01Btm = 17,

	// <ePcAtkCmbKindMax = 0x12>
	ePcAtkCmbKindMax = 18

};

// enum enShakeDir
enum enShakeDir : uint32_t
{
	// <eShakeUp2Down = 0x0>
	eShakeUp2Down = 0,

	// <eShakeDown2Up = 0x1>
	eShakeDown2Up = 1,

	// <eShakeLeft2Right = 0x2>
	eShakeLeft2Right = 2,

	// <eShakeRight2Left = 0x3>
	eShakeRight2Left = 3,

	// <eShakeThrust = 0x4>
	eShakeThrust = 4,

	// <eShakePull = 0x5>
	eShakePull = 5,

	// <eShakeCross = 0x6>
	eShakeCross = 6,

	// <eShakeNone = 0x7>
	eShakeNone = 7

};

// enum enEqKind
enum enEqKind : uint32_t
{
	// <eEqWeaponR = 0x0>
	eEqWeaponR = 0,

	// <eEqSunglass = 0x1>
	eEqSunglass = 1,

	// <eEqJacket = 0x2>
	eEqJacket = 2,

	// <eEqShoes = 0x3>
	eEqShoes = 3,

	// <eEqPants = 0x4>
	eEqPants = 4,

	// <eEqBelt = 0x5>
	eEqBelt = 5,

	// <eEqTshirt = 0x6>
	eEqTshirt = 6,

	// <eEqWBand = 0x7>
	eEqWBand = 7,

	// <eEqWeaponL = 0x8>
	eEqWeaponL = 8,

	// <eEqKindMax = 0x9>
	eEqKindMax = 9

};

// [Structure] class CTimeRatioInterpolate
class CTimeRatioInterpolate
{
public:
	/// Struct member variables

	// <float m_fOneRatioTime, offset 0x0>
	float m_fOneRatioTime;

	// <float m_fRatio, offset 0x4>
	float m_fRatio;

	// <float m_fTimer, offset 0x8>
	float m_fTimer;

	std::string ToString() const { return "class CTimeRatioInterpolate(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CTimeRatioInterpolate>("CTimeRatioInterpolate")
			.addFunction("__tostring", &CTimeRatioInterpolate::ToString)
			.addFunction("GetPtrAddr", &CTimeRatioInterpolate::GetPtrAddr)
			.addProperty("m_fOneRatioTime", &CTimeRatioInterpolate::m_fOneRatioTime)
			.addProperty("m_fRatio", &CTimeRatioInterpolate::m_fRatio)
			.addProperty("m_fTimer", &CTimeRatioInterpolate::m_fTimer)
		.endClass();
	}
#endif
};
static_assert(sizeof(CTimeRatioInterpolate::m_fOneRatioTime) == 4, "expected m_fOneRatioTime to be size 4");
static_assert(sizeof(CTimeRatioInterpolate::m_fRatio) == 4, "expected m_fRatio to be size 4");
static_assert(sizeof(CTimeRatioInterpolate::m_fTimer) == 4, "expected m_fTimer to be size 4");
static_assert(sizeof(CTimeRatioInterpolate) == 12, "expected class CTimeRatioInterpolate to be size 12");

// enum enWepChangeProc
enum enWepChangeProc : uint32_t
{
	// <eWepChangeInit = 0x0>
	eWepChangeInit = 0,

	// <eWepChangeWait = 0x1>
	eWepChangeWait = 1,

	// <eWepChangeMax = 0x2>
	eWepChangeMax = 2

};

// [Structure] union uniSMflag
union uniSMflag
{
public:
	/// Struct member variables

	// <uint16_t smBaceActivSubMission, offset 0x0>
	uint16_t smBaceActivSubMission;

	std::string ToString() const { return "union uniSMflag(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<uniSMflag>("uniSMflag")
			.addFunction("__tostring", &uniSMflag::ToString)
			.addFunction("GetPtrAddr", &uniSMflag::GetPtrAddr)
			.addProperty("smBaceActivSubMission", &uniSMflag::smBaceActivSubMission)
		.endClass();
	}
#endif
};
static_assert(sizeof(uniSMflag::smBaceActivSubMission) == 2, "expected smBaceActivSubMission to be size 2");
static_assert(sizeof(uniSMflag) == 2, "expected union uniSMflag to be size 2");

// enum enScreenChangeKind
enum enScreenChangeKind : uint32_t
{
	// <eScreenChangeStencil = 0x0>
	eScreenChangeStencil = 0,

	// <eScreenChangeFade = 0x1>
	eScreenChangeFade = 1,

	// <eScreenChangeMax = 0x2>
	eScreenChangeMax = 2

};

// [Structure] struct stFade
struct stFade
{
public:
	/// Struct member variables

	// <enum enScreenChangeKind kind, offset 0x0>
	enum enScreenChangeKind kind;

	// <uint8_t requestStart, offset 0x4>
	uint8_t requestStart;

	// <uint8_t requestEnd, offset 0x5>
	uint8_t requestEnd;

	// <Unidentified data segment, offset 0x6>
private:
	char _UnidentifiedData3[2];

public:
	// <class HrOverLap* pOverLap, offset 0x8>
	class HrOverLap* pOverLap;

	std::string ToString() const { return "struct stFade(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stFade>("stFade")
			.addFunction("__tostring", &stFade::ToString)
			.addFunction("GetPtrAddr", &stFade::GetPtrAddr)
			.addProperty("kind", &stFade::kind)
			.addProperty("requestStart", &stFade::requestStart)
			.addProperty("requestEnd", &stFade::requestEnd)
			.addProperty("pOverLap", &stFade::pOverLap)
		.endClass();
	}
#endif
};
static_assert(sizeof(stFade::kind) == 4, "expected kind to be size 4");
static_assert(sizeof(stFade::requestStart) == 1, "expected requestStart to be size 1");
static_assert(sizeof(stFade::requestEnd) == 1, "expected requestEnd to be size 1");
static_assert(sizeof(stFade::pOverLap) == 4, "expected pOverLap to be size 4");
static_assert(sizeof(stFade) == 12, "expected struct stFade to be size 12");

// enum enCharaInitProc
enum enCharaInitProc : uint32_t
{
	// <eCharaInitProcPrepareForReadRsl = 0x0>
	eCharaInitProcPrepareForReadRsl = 0,

	// <eCharaInitProcReadRsl = 0x1>
	eCharaInitProcReadRsl = 1,

	// <eCharaInitProcReadRslWait = 0x2>
	eCharaInitProcReadRslWait = 2,

	// <eCharaInitProcPrepareForRsl = 0x3>
	eCharaInitProcPrepareForRsl = 3,

	// <eCharaInitProcFinish = 0x4>
	eCharaInitProcFinish = 4,

	// <eCharaInitProcMax = 0x5>
	eCharaInitProcMax = 5

};

// [Structure] class CSpringInterpolate
class CSpringInterpolate
{
public:
	/// Struct member variables

	// <float m_fSpringCoe, offset 0x0>
	float m_fSpringCoe;

	// <float m_fMaxVel, offset 0x4>
	float m_fMaxVel;

	// <float m_fMinVel, offset 0x8>
	float m_fMinVel;

	// <uint8_t m_bIsRadiInterp, offset 0xc>
	uint8_t m_bIsRadiInterp;

	// <Unidentified data segment, offset 0xd>
private:
	char _UnidentifiedData4[3];

public:
	// <float m_fEpsilon, offset 0x10>
	float m_fEpsilon;

	// <float m_fValue, offset 0x14>
	float m_fValue;

	std::string ToString() const { return "class CSpringInterpolate(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CSpringInterpolate>("CSpringInterpolate")
			.addFunction("__tostring", &CSpringInterpolate::ToString)
			.addFunction("GetPtrAddr", &CSpringInterpolate::GetPtrAddr)
			.addProperty("m_fSpringCoe", &CSpringInterpolate::m_fSpringCoe)
			.addProperty("m_fMaxVel", &CSpringInterpolate::m_fMaxVel)
			.addProperty("m_fMinVel", &CSpringInterpolate::m_fMinVel)
			.addProperty("m_bIsRadiInterp", &CSpringInterpolate::m_bIsRadiInterp)
			.addProperty("m_fEpsilon", &CSpringInterpolate::m_fEpsilon)
			.addProperty("m_fValue", &CSpringInterpolate::m_fValue)
		.endClass();
	}
#endif
};
static_assert(sizeof(CSpringInterpolate::m_fSpringCoe) == 4, "expected m_fSpringCoe to be size 4");
static_assert(sizeof(CSpringInterpolate::m_fMaxVel) == 4, "expected m_fMaxVel to be size 4");
static_assert(sizeof(CSpringInterpolate::m_fMinVel) == 4, "expected m_fMinVel to be size 4");
static_assert(sizeof(CSpringInterpolate::m_bIsRadiInterp) == 1, "expected m_bIsRadiInterp to be size 1");
static_assert(sizeof(CSpringInterpolate::m_fEpsilon) == 4, "expected m_fEpsilon to be size 4");
static_assert(sizeof(CSpringInterpolate::m_fValue) == 4, "expected m_fValue to be size 4");
static_assert(sizeof(CSpringInterpolate) == 24, "expected class CSpringInterpolate to be size 24");

// [Structure] class CDoubleSpringInterpolate
class CDoubleSpringInterpolate
{
public:
	/// Struct member variables

	// <class CSpringInterpolate m_inHopeInterp, offset 0x0>
	class CSpringInterpolate m_inHopeInterp;

	// <class CSpringInterpolate m_inCurInterp, offset 0x18>
	class CSpringInterpolate m_inCurInterp;

	std::string ToString() const { return "class CDoubleSpringInterpolate(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CDoubleSpringInterpolate>("CDoubleSpringInterpolate")
			.addFunction("__tostring", &CDoubleSpringInterpolate::ToString)
			.addFunction("GetPtrAddr", &CDoubleSpringInterpolate::GetPtrAddr)
			.addProperty("m_inHopeInterp", &CDoubleSpringInterpolate::m_inHopeInterp)
			.addProperty("m_inCurInterp", &CDoubleSpringInterpolate::m_inCurInterp)
		.endClass();
	}
#endif
};
static_assert(sizeof(CDoubleSpringInterpolate::m_inHopeInterp) == 24, "expected m_inHopeInterp to be size 24");
static_assert(sizeof(CDoubleSpringInterpolate::m_inCurInterp) == 24, "expected m_inCurInterp to be size 24");
static_assert(sizeof(CDoubleSpringInterpolate) == 48, "expected class CDoubleSpringInterpolate to be size 48");

// [Structure] class CAmbientShadow
class CAmbientShadow
{
public:
	/// Struct member variables

	// <class CDoubleSpringInterpolate m_inRatio, offset 0x0>
	class CDoubleSpringInterpolate m_inRatio;

	// <float m_fSetRatio, offset 0x30>
	float m_fSetRatio;

	// <class TGmf* m_pPreGmf, offset 0x34>
	class TGmf* m_pPreGmf;

	std::string ToString() const { return "class CAmbientShadow(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CAmbientShadow>("CAmbientShadow")
			.addFunction("__tostring", &CAmbientShadow::ToString)
			.addFunction("GetPtrAddr", &CAmbientShadow::GetPtrAddr)
			.addProperty("m_inRatio", &CAmbientShadow::m_inRatio)
			.addProperty("m_fSetRatio", &CAmbientShadow::m_fSetRatio)
			.addProperty("m_pPreGmf", &CAmbientShadow::m_pPreGmf)
		.endClass();
	}
#endif
};
static_assert(sizeof(CAmbientShadow::m_inRatio) == 48, "expected m_inRatio to be size 48");
static_assert(sizeof(CAmbientShadow::m_fSetRatio) == 4, "expected m_fSetRatio to be size 4");
static_assert(sizeof(CAmbientShadow::m_pPreGmf) == 4, "expected m_pPreGmf to be size 4");
static_assert(sizeof(CAmbientShadow) == 56, "expected class CAmbientShadow to be size 56");

// [Structure] struct stCharaEffect
struct stCharaEffect
{
public:
	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData[292];
public:

	std::string ToString() const { return "struct stCharaEffect(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stCharaEffect>("stCharaEffect")
			.addFunction("__tostring", &stCharaEffect::ToString)
			.addFunction("GetPtrAddr", &stCharaEffect::GetPtrAddr)
		.endClass();
	}
#endif
};
static_assert(sizeof(stCharaEffect) == 292, "expected struct stCharaEffect to be size 292");

// [Structure] class stCharaFileData
class stCharaFileData
{
public:
	/// Struct member variables

	// <class ghmGcFile* file, offset 0x0>
	class ghmGcFile* file;

	// <void* pData, offset 0x4>
	void* pData;

	// <class ghmResGroup* pRsl, offset 0x8>
	class ghmResGroup* pRsl;

	// <class TGmf* pGmf, offset 0xc>
	class TGmf* pGmf;

	// <class TGmf* pGmfDead, offset 0x10>
	class TGmf* pGmfDead;

	// <class TGmf* pGmfWepR, offset 0x14>
	class TGmf* pGmfWepR;

	// <class TGmf* pGmfWepL, offset 0x18>
	class TGmf* pGmfWepL;

	// <int16_t motionNumMax, offset 0x1c>
	int16_t motionNumMax;

	// <uint8_t readyDelete, offset 0x1e>
	uint8_t readyDelete;

	// <Unidentified data segment, offset 0x1f>
private:
	char _UnidentifiedData9[1];

public:
	// <int32_t sndFileHandle, offset 0x20>
	int32_t sndFileHandle;

	// <struct HRCHARAVOICE* pVoice, offset 0x24>
	struct HRCHARAVOICE* pVoice;

	// <char FileName[0x9], offset 0x28>
	char FileName[9];

	// <Unidentified data segment, offset 0x31>
private:
	char _UnidentifiedData12[3];

public:
	// <class TGan** pGan, offset 0x34>
	class TGan** pGan;

	std::string ToString() const { return "class stCharaFileData(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stCharaFileData>("stCharaFileData")
			.addFunction("__tostring", &stCharaFileData::ToString)
			.addFunction("GetPtrAddr", &stCharaFileData::GetPtrAddr)
			.addProperty("file", &stCharaFileData::file)
			// void type not supported in LuaBridge
			//.addProperty("pData", &stCharaFileData::pData)
			.addProperty("pRsl", &stCharaFileData::pRsl)
			.addProperty("pGmf", &stCharaFileData::pGmf)
			.addProperty("pGmfDead", &stCharaFileData::pGmfDead)
			.addProperty("pGmfWepR", &stCharaFileData::pGmfWepR)
			.addProperty("pGmfWepL", &stCharaFileData::pGmfWepL)
			.addProperty("motionNumMax", &stCharaFileData::motionNumMax)
			.addProperty("readyDelete", &stCharaFileData::readyDelete)
			.addProperty("sndFileHandle", &stCharaFileData::sndFileHandle)
			.addProperty("pVoice", &stCharaFileData::pVoice)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("FileName", &stCharaFileData::FileName)
			// pointer to pointer is not supported in LuaBridge
			//.addProperty("pGan", &stCharaFileData::pGan)
		.endClass();
	}
#endif
};
static_assert(sizeof(stCharaFileData::file) == 4, "expected file to be size 4");
static_assert(sizeof(stCharaFileData::pData) == 4, "expected pData to be size 4");
static_assert(sizeof(stCharaFileData::pRsl) == 4, "expected pRsl to be size 4");
static_assert(sizeof(stCharaFileData::pGmf) == 4, "expected pGmf to be size 4");
static_assert(sizeof(stCharaFileData::pGmfDead) == 4, "expected pGmfDead to be size 4");
static_assert(sizeof(stCharaFileData::pGmfWepR) == 4, "expected pGmfWepR to be size 4");
static_assert(sizeof(stCharaFileData::pGmfWepL) == 4, "expected pGmfWepL to be size 4");
static_assert(sizeof(stCharaFileData::motionNumMax) == 2, "expected motionNumMax to be size 2");
static_assert(sizeof(stCharaFileData::readyDelete) == 1, "expected readyDelete to be size 1");
static_assert(sizeof(stCharaFileData::sndFileHandle) == 4, "expected sndFileHandle to be size 4");
static_assert(sizeof(stCharaFileData::pVoice) == 4, "expected pVoice to be size 4");
static_assert(sizeof(stCharaFileData::FileName) == 9, "expected FileName to be size 9");
static_assert(sizeof(stCharaFileData::pGan) == 4, "expected pGan to be size 4");
static_assert(sizeof(stCharaFileData) == 56, "expected class stCharaFileData to be size 56");

// [Structure] class ghmSegment
class ghmSegment
{
public:
	/// Struct member variables

	// <struct Vec mCenter, offset 0x0>
	struct Vec mCenter;

	// <struct Vec mDir, offset 0xc>
	struct Vec mDir;

	// <float mExtent, offset 0x18>
	float mExtent;

	std::string ToString() const { return "class ghmSegment(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmSegment>("ghmSegment")
			.addFunction("__tostring", &ghmSegment::ToString)
			.addFunction("GetPtrAddr", &ghmSegment::GetPtrAddr)
			.addProperty("mCenter", &ghmSegment::mCenter)
			.addProperty("mDir", &ghmSegment::mDir)
			.addProperty("mExtent", &ghmSegment::mExtent)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmSegment::mCenter) == 12, "expected mCenter to be size 12");
static_assert(sizeof(ghmSegment::mDir) == 12, "expected mDir to be size 12");
static_assert(sizeof(ghmSegment::mExtent) == 4, "expected mExtent to be size 4");
static_assert(sizeof(ghmSegment) == 28, "expected class ghmSegment to be size 28");

// [Structure] class ghmCapsule
class ghmCapsule
{
public:
	/// Struct member variables

	// <class ghmSegment mAxis, offset 0x0>
	class ghmSegment mAxis;

	// <float mRadius, offset 0x1c>
	float mRadius;

	std::string ToString() const { return "class ghmCapsule(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmCapsule>("ghmCapsule")
			.addFunction("__tostring", &ghmCapsule::ToString)
			.addFunction("GetPtrAddr", &ghmCapsule::GetPtrAddr)
			.addProperty("mAxis", &ghmCapsule::mAxis)
			.addProperty("mRadius", &ghmCapsule::mRadius)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmCapsule::mAxis) == 28, "expected mAxis to be size 28");
static_assert(sizeof(ghmCapsule::mRadius) == 4, "expected mRadius to be size 4");
static_assert(sizeof(ghmCapsule) == 32, "expected class ghmCapsule to be size 32");

// [Structure] class ghmGcOctTreeNodeObj
class ghmGcOctTreeNodeObj
{
public:
	/// Struct member variables

	// <void* (* field_0)[0x2], offset 0x0>
	void* (* field_0)[0x2];

	// <class ghmGcOctTreeNode* mpContainer, offset 0x4>
	class ghmGcOctTreeNode* mpContainer;

	// <ghmGcOctTreeNodeObj* mpNext, offset 0x8>
	ghmGcOctTreeNodeObj* mpNext;

	// <ghmGcOctTreeNodeObj* mpPrev, offset 0xc>
	ghmGcOctTreeNodeObj* mpPrev;

	// <uint32_t mUserData, offset 0x10>
	uint32_t mUserData;

	std::string ToString() const { return "class ghmGcOctTreeNodeObj(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcOctTreeNodeObj>("ghmGcOctTreeNodeObj")
			.addFunction("__tostring", &ghmGcOctTreeNodeObj::ToString)
			.addFunction("GetPtrAddr", &ghmGcOctTreeNodeObj::GetPtrAddr)
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &ghmGcOctTreeNodeObj::field_0)
			.addProperty("mpContainer", &ghmGcOctTreeNodeObj::mpContainer)
			.addProperty("mpNext", &ghmGcOctTreeNodeObj::mpNext)
			.addProperty("mpPrev", &ghmGcOctTreeNodeObj::mpPrev)
			.addProperty("mUserData", &ghmGcOctTreeNodeObj::mUserData)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcOctTreeNodeObj::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mpContainer) == 4, "expected mpContainer to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mUserData) == 4, "expected mUserData to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj) == 20, "expected class ghmGcOctTreeNodeObj to be size 20");

// [Structure] class ghmGcCollObj
class ghmGcCollObj : public ghmGcOctTreeNodeObj
{
public:
	// enum ghmGcCollObj::Type
	enum Type : uint32_t
	{
		// <TYPE_TRIANGLE = 0x0>
		TYPE_TRIANGLE = 0,

		// <TYPE_SPHERE = 0x1>
		TYPE_SPHERE = 1,

		// <TYPE_AABB = 0x2>
		TYPE_AABB = 2,

		// <TYPE_OBB = 0x3>
		TYPE_OBB = 3,

		// <TYPE_CAPSULE = 0x4>
		TYPE_CAPSULE = 4,

		// <TYPE_USER = 0x5>
		TYPE_USER = 5,

		// <TYPE_INVALID = 0xffffffffffffffff>
		TYPE_INVALID = UINT32_MAX

	};

	/// Struct member variables

	// <class ghmGcOctTreeNodeObj field_0, offset 0x0>
	// class ghmGcOctTreeNodeObj Super;

	// <enum ghmGcCollObj::Type mObjType, offset 0x14>
	enum ghmGcCollObj::Type mObjType;

	// <uint32_t mGroup, offset 0x18>
	uint32_t mGroup;

	// <uint32_t mIgnoreGroup, offset 0x1c>
	uint32_t mIgnoreGroup;

	// <int32_t (* mpHitTestCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*), offset 0x20>
	int32_t (* mpHitTestCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*);

	// <int32_t (* mpHitCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*), offset 0x24>
	int32_t (* mpHitCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*);

	// <struct Vec mVelocity, offset 0x28>
	struct Vec mVelocity;

	// <uint32_t mFlag, offset 0x34>
	uint32_t mFlag;

	// <uint32_t mParam[0x2], offset 0x38>
	uint32_t mParam[2];

	std::string ToString() const { return "class ghmGcCollObj(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<ghmGcCollObj, ghmGcOctTreeNodeObj>("ghmGcCollObj")
			.addFunction("__tostring", &ghmGcCollObj::ToString)
			.addFunction("GetPtrAddr", &ghmGcCollObj::GetPtrAddr)
			.addProperty("mObjType", &ghmGcCollObj::mObjType)
			.addProperty("mGroup", &ghmGcCollObj::mGroup)
			.addProperty("mIgnoreGroup", &ghmGcCollObj::mIgnoreGroup)
			// delegates are not supported in LuaBridge
			//.addProperty("mpHitTestCallback", &ghmGcCollObj::mpHitTestCallback)
			// delegates are not supported in LuaBridge
			//.addProperty("mpHitCallback", &ghmGcCollObj::mpHitCallback)
			.addProperty("mVelocity", &ghmGcCollObj::mVelocity)
			.addProperty("mFlag", &ghmGcCollObj::mFlag)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mParam", &ghmGcCollObj::mParam)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcCollObj::mObjType) == 4, "expected mObjType to be size 4");
static_assert(sizeof(ghmGcCollObj::mGroup) == 4, "expected mGroup to be size 4");
static_assert(sizeof(ghmGcCollObj::mIgnoreGroup) == 4, "expected mIgnoreGroup to be size 4");
static_assert(sizeof(ghmGcCollObj::mpHitTestCallback) == 4, "expected mpHitTestCallback to be size 4");
static_assert(sizeof(ghmGcCollObj::mpHitCallback) == 4, "expected mpHitCallback to be size 4");
static_assert(sizeof(ghmGcCollObj::mVelocity) == 12, "expected mVelocity to be size 12");
static_assert(sizeof(ghmGcCollObj::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(ghmGcCollObj::mParam) == 8, "expected mParam to be size 8");
static_assert(sizeof(ghmGcCollObj) == 64, "expected class ghmGcCollObj to be size 64");

// [Structure] class ghmGcCollObjCapsule
class ghmGcCollObjCapsule : public ghmGcCollObj
{
public:
	/// Struct member variables

	// <class ghmGcCollObj field_0, offset 0x0>
	// class ghmGcCollObj Super;

	// <class ghmCapsule mShape, offset 0x40>
	class ghmCapsule mShape;

	std::string ToString() const { return "class ghmGcCollObjCapsule(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<ghmGcCollObjCapsule, ghmGcCollObj>("ghmGcCollObjCapsule")
			.addFunction("__tostring", &ghmGcCollObjCapsule::ToString)
			.addFunction("GetPtrAddr", &ghmGcCollObjCapsule::GetPtrAddr)
			.addProperty("mShape", &ghmGcCollObjCapsule::mShape)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcCollObjCapsule::mShape) == 32, "expected mShape to be size 32");
static_assert(sizeof(ghmGcCollObjCapsule) == 96, "expected class ghmGcCollObjCapsule to be size 96");

// [Structure] class WAnim
class WAnim
{
public:
	/// Struct member variables

	// <void* (* field_0)[0x1], offset 0x0>
	void* (* field_0)[0x1];

	std::string ToString() const { return "class WAnim(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WAnim>("WAnim")
			.addFunction("__tostring", &WAnim::ToString)
			.addFunction("GetPtrAddr", &WAnim::GetPtrAddr)
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &WAnim::field_0)
		.endClass();
	}
#endif
};
static_assert(sizeof(WAnim::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(WAnim) == 4, "expected class WAnim to be size 4");

// [Structure] class WAnimF
class WAnimF : public WAnim
{
public:
	/// Struct member variables

	// <class WAnim field_0, offset 0x0>
	// class WAnim Super;

	// <float mCurValue, offset 0x4>
	float mCurValue;

	// <float mDstValue, offset 0x8>
	float mDstValue;

	// <float mSrcValue, offset 0xc>
	float mSrcValue;

	// <uint32_t mCount, offset 0x10>
	uint32_t mCount;

	// <uint32_t mTime, offset 0x14>
	uint32_t mTime;

	// <int32_t mIpType, offset 0x18>
	int32_t mIpType;

	// <float mMotionRate, offset 0x1c>
	float mMotionRate;

	std::string ToString() const { return "class WAnimF(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<WAnimF, WAnim>("WAnimF")
			.addFunction("__tostring", &WAnimF::ToString)
			.addFunction("GetPtrAddr", &WAnimF::GetPtrAddr)
			.addProperty("mCurValue", &WAnimF::mCurValue)
			.addProperty("mDstValue", &WAnimF::mDstValue)
			.addProperty("mSrcValue", &WAnimF::mSrcValue)
			.addProperty("mCount", &WAnimF::mCount)
			.addProperty("mTime", &WAnimF::mTime)
			.addProperty("mIpType", &WAnimF::mIpType)
			.addProperty("mMotionRate", &WAnimF::mMotionRate)
		.endClass();
	}
#endif
};
static_assert(sizeof(WAnimF::mCurValue) == 4, "expected mCurValue to be size 4");
static_assert(sizeof(WAnimF::mDstValue) == 4, "expected mDstValue to be size 4");
static_assert(sizeof(WAnimF::mSrcValue) == 4, "expected mSrcValue to be size 4");
static_assert(sizeof(WAnimF::mCount) == 4, "expected mCount to be size 4");
static_assert(sizeof(WAnimF::mTime) == 4, "expected mTime to be size 4");
static_assert(sizeof(WAnimF::mIpType) == 4, "expected mIpType to be size 4");
static_assert(sizeof(WAnimF::mMotionRate) == 4, "expected mMotionRate to be size 4");
static_assert(sizeof(WAnimF) == 32, "expected class WAnimF to be size 32");

// [Structure] struct stDamageInfo
struct stDamageInfo
{
public:
	/// Struct member variables

	// <float dmg, offset 0x0>
	float dmg;

	// <int32_t dmgMot, offset 0x4>
	int32_t dmgMot;

	// <int32_t grdMot, offset 0x8>
	int32_t grdMot;

	// <int32_t atkMot, offset 0xc>
	int32_t atkMot;

	// <int32_t atkKind, offset 0x10>
	int32_t atkKind;

	// <float dmgDirec, offset 0x14>
	float dmgDirec;

	// <float nockBackSpd, offset 0x18>
	float nockBackSpd;

	// <float nockBackDst, offset 0x1c>
	float nockBackDst;

	// <struct Vec nockBackDir, offset 0x20>
	struct Vec nockBackDir;

	// <float nockBackMasatu, offset 0x2c>
	float nockBackMasatu;

	// <float upperPow, offset 0x30>
	float upperPow;

	// <float upperPowLast, offset 0x34>
	float upperPowLast;

	// <float upperPosY, offset 0x38>
	float upperPosY;

	// <float grav, offset 0x3c>
	float grav;

	// <uint8_t upper, offset 0x40>
	uint8_t upper;

	// <Unidentified data segment, offset 0x41>
private:
	char _UnidentifiedData15[3];

public:
	// <int32_t tick, offset 0x44>
	int32_t tick;

	// <class WAnimF fade, offset 0x48>
	class WAnimF fade;

	// <uint8_t m_PiyoRequest, offset 0x68>
	uint8_t m_PiyoRequest;

	// <uint8_t m_BikeDeadRequest, offset 0x69>
	uint8_t m_BikeDeadRequest;

	// <Unidentified data segment, offset 0x6a>
private:
	char _UnidentifiedData[2];
public:

	std::string ToString() const { return "struct stDamageInfo(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stDamageInfo>("stDamageInfo")
			.addFunction("__tostring", &stDamageInfo::ToString)
			.addFunction("GetPtrAddr", &stDamageInfo::GetPtrAddr)
			.addProperty("dmg", &stDamageInfo::dmg)
			.addProperty("dmgMot", &stDamageInfo::dmgMot)
			.addProperty("grdMot", &stDamageInfo::grdMot)
			.addProperty("atkMot", &stDamageInfo::atkMot)
			.addProperty("atkKind", &stDamageInfo::atkKind)
			.addProperty("dmgDirec", &stDamageInfo::dmgDirec)
			.addProperty("nockBackSpd", &stDamageInfo::nockBackSpd)
			.addProperty("nockBackDst", &stDamageInfo::nockBackDst)
			.addProperty("nockBackDir", &stDamageInfo::nockBackDir)
			.addProperty("nockBackMasatu", &stDamageInfo::nockBackMasatu)
			.addProperty("upperPow", &stDamageInfo::upperPow)
			.addProperty("upperPowLast", &stDamageInfo::upperPowLast)
			.addProperty("upperPosY", &stDamageInfo::upperPosY)
			.addProperty("grav", &stDamageInfo::grav)
			.addProperty("upper", &stDamageInfo::upper)
			.addProperty("tick", &stDamageInfo::tick)
			.addProperty("fade", &stDamageInfo::fade)
			.addProperty("m_PiyoRequest", &stDamageInfo::m_PiyoRequest)
			.addProperty("m_BikeDeadRequest", &stDamageInfo::m_BikeDeadRequest)
		.endClass();
	}
#endif
};
static_assert(sizeof(stDamageInfo::dmg) == 4, "expected dmg to be size 4");
static_assert(sizeof(stDamageInfo::dmgMot) == 4, "expected dmgMot to be size 4");
static_assert(sizeof(stDamageInfo::grdMot) == 4, "expected grdMot to be size 4");
static_assert(sizeof(stDamageInfo::atkMot) == 4, "expected atkMot to be size 4");
static_assert(sizeof(stDamageInfo::atkKind) == 4, "expected atkKind to be size 4");
static_assert(sizeof(stDamageInfo::dmgDirec) == 4, "expected dmgDirec to be size 4");
static_assert(sizeof(stDamageInfo::nockBackSpd) == 4, "expected nockBackSpd to be size 4");
static_assert(sizeof(stDamageInfo::nockBackDst) == 4, "expected nockBackDst to be size 4");
static_assert(sizeof(stDamageInfo::nockBackDir) == 12, "expected nockBackDir to be size 12");
static_assert(sizeof(stDamageInfo::nockBackMasatu) == 4, "expected nockBackMasatu to be size 4");
static_assert(sizeof(stDamageInfo::upperPow) == 4, "expected upperPow to be size 4");
static_assert(sizeof(stDamageInfo::upperPowLast) == 4, "expected upperPowLast to be size 4");
static_assert(sizeof(stDamageInfo::upperPosY) == 4, "expected upperPosY to be size 4");
static_assert(sizeof(stDamageInfo::grav) == 4, "expected grav to be size 4");
static_assert(sizeof(stDamageInfo::upper) == 1, "expected upper to be size 1");
static_assert(sizeof(stDamageInfo::tick) == 4, "expected tick to be size 4");
static_assert(sizeof(stDamageInfo::fade) == 32, "expected fade to be size 32");
static_assert(sizeof(stDamageInfo::m_PiyoRequest) == 1, "expected m_PiyoRequest to be size 1");
static_assert(sizeof(stDamageInfo::m_BikeDeadRequest) == 1, "expected m_BikeDeadRequest to be size 1");
static_assert(sizeof(stDamageInfo) == 108, "expected struct stDamageInfo to be size 108");

// [Structure] class ghmTriangle
class ghmTriangle
{
public:
	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData[36];
public:

	std::string ToString() const { return "class ghmTriangle(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmTriangle>("ghmTriangle")
			.addFunction("__tostring", &ghmTriangle::ToString)
			.addFunction("GetPtrAddr", &ghmTriangle::GetPtrAddr)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmTriangle) == 36, "expected class ghmTriangle to be size 36");

// [Structure] class ghmPlane
class ghmPlane
{
public:
	/// Struct member variables

	// <struct Vec mNormal, offset 0x0>
	struct Vec mNormal;

	// <float mDist, offset 0xc>
	float mDist;

	std::string ToString() const { return "class ghmPlane(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmPlane>("ghmPlane")
			.addFunction("__tostring", &ghmPlane::ToString)
			.addFunction("GetPtrAddr", &ghmPlane::GetPtrAddr)
			.addProperty("mNormal", &ghmPlane::mNormal)
			.addProperty("mDist", &ghmPlane::mDist)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmPlane::mNormal) == 12, "expected mNormal to be size 12");
static_assert(sizeof(ghmPlane::mDist) == 4, "expected mDist to be size 4");
static_assert(sizeof(ghmPlane) == 16, "expected class ghmPlane to be size 16");

// [Structure] class ghmGcCollObjHitResultObj
class ghmGcCollObjHitResultObj
{
public:
	/// Struct member variables

	// <class ghmPlane mPlane, offset 0x0>
	class ghmPlane mPlane;

	// <class ghmTriangle mTriangle, offset 0x10>
	class ghmTriangle mTriangle;

	// <struct Vec mPoint, offset 0x34>
	struct Vec mPoint;

	// <float mRate, offset 0x40>
	float mRate;

	// <uint32_t mAttr, offset 0x44>
	uint32_t mAttr;

	// <class ghmGcCollObj* mpObj, offset 0x48>
	class ghmGcCollObj* mpObj;

	std::string ToString() const { return "class ghmGcCollObjHitResultObj(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcCollObjHitResultObj>("ghmGcCollObjHitResultObj")
			.addFunction("__tostring", &ghmGcCollObjHitResultObj::ToString)
			.addFunction("GetPtrAddr", &ghmGcCollObjHitResultObj::GetPtrAddr)
			.addProperty("mPlane", &ghmGcCollObjHitResultObj::mPlane)
			.addProperty("mTriangle", &ghmGcCollObjHitResultObj::mTriangle)
			.addProperty("mPoint", &ghmGcCollObjHitResultObj::mPoint)
			.addProperty("mRate", &ghmGcCollObjHitResultObj::mRate)
			.addProperty("mAttr", &ghmGcCollObjHitResultObj::mAttr)
			.addProperty("mpObj", &ghmGcCollObjHitResultObj::mpObj)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcCollObjHitResultObj::mPlane) == 16, "expected mPlane to be size 16");
static_assert(sizeof(ghmGcCollObjHitResultObj::mTriangle) == 36, "expected mTriangle to be size 36");
static_assert(sizeof(ghmGcCollObjHitResultObj::mPoint) == 12, "expected mPoint to be size 12");
static_assert(sizeof(ghmGcCollObjHitResultObj::mRate) == 4, "expected mRate to be size 4");
static_assert(sizeof(ghmGcCollObjHitResultObj::mAttr) == 4, "expected mAttr to be size 4");
static_assert(sizeof(ghmGcCollObjHitResultObj::mpObj) == 4, "expected mpObj to be size 4");
static_assert(sizeof(ghmGcCollObjHitResultObj) == 76, "expected class ghmGcCollObjHitResultObj to be size 76");

// enum enCharaCondition
enum enCharaCondition : uint32_t
{
	// <eGood = 0x0>
	eGood = 0,

	// <eDamaging = 0x1>
	eDamaging = 1,

	// <eDying = 0x2>
	eDying = 2,

	// <eDead = 0x3>
	eDead = 3,

	// <eBossDead = 0x4>
	eBossDead = 4,

	// <eConditionInit = 0x5>
	eConditionInit = 5,

	// <eConditionMax = 0x6>
	eConditionMax = 6

};

// [Structure] struct stVec
struct stVec
{
public:
	/// Struct member variables

	// <class WAnimF x, offset 0x0>
	class WAnimF x;

	// <class WAnimF y, offset 0x20>
	class WAnimF y;

	// <class WAnimF z, offset 0x40>
	class WAnimF z;

	std::string ToString() const { return "struct stVec(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stVec>("stVec")
			.addFunction("__tostring", &stVec::ToString)
			.addFunction("GetPtrAddr", &stVec::GetPtrAddr)
			.addProperty("x", &stVec::x)
			.addProperty("y", &stVec::y)
			.addProperty("z", &stVec::z)
		.endClass();
	}
#endif
};
static_assert(sizeof(stVec::x) == 32, "expected x to be size 32");
static_assert(sizeof(stVec::y) == 32, "expected y to be size 32");
static_assert(sizeof(stVec::z) == 32, "expected z to be size 32");
static_assert(sizeof(stVec) == 96, "expected struct stVec to be size 96");

// [Structure] struct Quaternion
struct Quaternion
{
public:
	/// Struct member variables

	// <float x, offset 0x0>
	float x;

	// <float y, offset 0x4>
	float y;

	// <float z, offset 0x8>
	float z;

	// <float w, offset 0xc>
	float w;

	std::string ToString() const { return "struct Quaternion(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Quaternion>("Quaternion")
			.addFunction("__tostring", &Quaternion::ToString)
			.addFunction("GetPtrAddr", &Quaternion::GetPtrAddr)
			.addProperty("x", &Quaternion::x)
			.addProperty("y", &Quaternion::y)
			.addProperty("z", &Quaternion::z)
			.addProperty("w", &Quaternion::w)
		.endClass();
	}
#endif
};
static_assert(sizeof(Quaternion::x) == 4, "expected x to be size 4");
static_assert(sizeof(Quaternion::y) == 4, "expected y to be size 4");
static_assert(sizeof(Quaternion::z) == 4, "expected z to be size 4");
static_assert(sizeof(Quaternion::w) == 4, "expected w to be size 4");
static_assert(sizeof(Quaternion) == 16, "expected struct Quaternion to be size 16");

// [Structure] struct stCharaStatus
/// <summary>
/// Contains position, rotation, hp, flags, etc
/// </summary>
struct stCharaStatus
{
public:
	/// Struct member variables

	// <int32_t resNo, offset 0x0>
	int32_t resNo;

	// <int32_t datNo, offset 0x4>
	int32_t datNo;

	// <enum enCharaType charaType, offset 0x8>
	enum enCharaType charaType;

	// <int16_t zakoWepType, offset 0xc>
	int16_t zakoWepType;

	// <Unidentified data segment, offset 0xe>
private:
	char _UnidentifiedData4[2];

public:
	// <float maxHp, offset 0x10>
	float maxHp;

	// <float hp, offset 0x14>
	float hp;

	// <int16_t money, offset 0x18>
	int16_t money;

	// <int16_t dropMoney, offset 0x1a>
	int16_t dropMoney;

	// <float tension, offset 0x1c>
	float tension;

	// <float hajikiCount, offset 0x20>
	float hajikiCount;

	// <uint8_t alwaysCheckHitColl, offset 0x24>
	uint8_t alwaysCheckHitColl;

	// <Unidentified data segment, offset 0x25>
private:
	char _UnidentifiedData11[3];

public:
	// <struct Vec pos, offset 0x28>
	struct Vec pos;

	// <struct Vec beforePos, offset 0x34>
	struct Vec beforePos;

	// <struct Vec oldPos, offset 0x40>
	struct Vec oldPos;

	// <struct Vec navelPos, offset 0x4c>
	struct Vec navelPos;

	// <struct Vec brainPos, offset 0x58>
	struct Vec brainPos;

	// <struct Vec rot, offset 0x64>
	struct Vec rot;

	// <struct Vec scale, offset 0x70>
	struct Vec scale;

	// <struct Quaternion qRot, offset 0x7c>
	struct Quaternion qRot;

	// <float movSpd, offset 0x8c>
	float movSpd;

	// <float hitSize, offset 0x90>
	float hitSize;

	// <float height, offset 0x94>
	float height;

	// <struct stVec aPos, offset 0x98>
	struct stVec aPos;

	// <struct stVec aRot, offset 0xf8>
	struct stVec aRot;

	// <int32_t enterPattern, offset 0x158>
	int32_t enterPattern;

	// <float reactionDist, offset 0x15c>
	float reactionDist;

	// <int32_t itemNo, offset 0x160>
	int32_t itemNo;

	// <int32_t mAiDefBasic, offset 0x164>
	int32_t mAiDefBasic;

	// <int32_t mAiDefCurrent, offset 0x168>
	int32_t mAiDefCurrent;

	// <int32_t mAiDefTick, offset 0x16c>
	int32_t mAiDefTick;

	// <int32_t mAiDefBaseTick, offset 0x170>
	int32_t mAiDefBaseTick;

	// <float mAiDamageCount, offset 0x174>
	float mAiDamageCount;

	// <char* pScriptProc, offset 0x178>
	char* pScriptProc;

	// <int32_t tsubazeriNum, offset 0x17c>
	int32_t tsubazeriNum;

	// <int32_t DamageAcceptFrame, offset 0x180>
	int32_t DamageAcceptFrame;

	// <int32_t motionNo, offset 0x184>
	int32_t motionNo;

	// <char motionBrendNum, offset 0x188>
	char motionBrendNum;

	// <Unidentified data segment, offset 0x189>
private:
	char _UnidentifiedData37[3];

public:
	// <float motSpd, offset 0x18c>
	float motSpd;

	// <float subMotSpd, offset 0x190>
	float subMotSpd;

	// <enum enCharaCondition condition, offset 0x194>
	enum enCharaCondition condition;

	// <class ghmGcCollObj* footHitResultObj, offset 0x198>
	class ghmGcCollObj* footHitResultObj;

	// <class ghmGcCollObjHitResult* footHitResult, offset 0x19c>
	class ghmGcCollObjHitResult* footHitResult;

	// <class ghmGcCollObjHitResultObj footHitResultObj2, offset 0x1a0>
	class ghmGcCollObjHitResultObj footHitResultObj2;

	// <class ghmGcCollObjHitResultObj HitWallObj, offset 0x1ec>
	class ghmGcCollObjHitResultObj HitWallObj;

	// <struct WGclMaterialSpec* hitWallMaterial, offset 0x238>
	struct WGclMaterialSpec* hitWallMaterial;

	// <struct Vec HitWallNormal, offset 0x23c>
	struct Vec HitWallNormal;

	// <struct stDamageInfo dmgInfo, offset 0x248>
	struct stDamageInfo dmgInfo;

	// <struct Vec mYukaNormal, offset 0x2b4>
	struct Vec mYukaNormal;

	// <int32_t mFootNumber, offset 0x2c0>
	int32_t mFootNumber;

	// <int32_t movTick, offset 0x2c4>
	int32_t movTick;

	// <int16_t hitNum, offset 0x2c8>
	int16_t hitNum;

	// <Unidentified data segment, offset 0x2ca>
private:
	char _UnidentifiedData51[2];

public:
	// <class ghmGcCollObjCapsule hitColl, offset 0x2cc>
	class ghmGcCollObjCapsule hitColl;

	// <int32_t mAiAtkLv, offset 0x32c>
	int32_t mAiAtkLv;

	// <int32_t mAiAtkClass, offset 0x330>
	int32_t mAiAtkClass;

	// <int16_t AtkAi[0xa], offset 0x334>
	int16_t AtkAi[10];

	// <int32_t renderSkipCounter, offset 0x348>
	int32_t renderSkipCounter;

	// <float renderSkipMotSpd, offset 0x34c>
	float renderSkipMotSpd;

	// <int32_t frameStop, offset 0x350>
	int32_t frameStop;

	// <float lockOnDistance, offset 0x354>
	float lockOnDistance;

	// <float lockOnDistanceHi, offset 0x358>
	float lockOnDistanceHi;

	// <float lockOnDistanceLow, offset 0x35c>
	float lockOnDistanceLow;

	// <float DrawYAdjust, offset 0x360>
	float DrawYAdjust;

	// <uint8_t bBloom, offset 0x364>
	uint8_t bBloom;

	// <uint8_t JumpBlockHit, offset 0x365>
	uint8_t JumpBlockHit;

	// <Unidentified data segment, offset 0x366>
private:
	char _UnidentifiedData64[2];

public:
	// <float AtkDisAdjust, offset 0x368>
	float AtkDisAdjust;

	// <float TubaFrmOffset, offset 0x36c>
	float TubaFrmOffset;

	// <int32_t motionNoNpc, offset 0x370>
	int32_t motionNoNpc;

	// <class WAnimF semiTransRate, offset 0x374>
	class WAnimF semiTransRate;

	// <uint32_t flag[0x2], offset 0x394>
	uint32_t flag[2];

	std::string ToString() const { return "struct stCharaStatus(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stCharaStatus>("stCharaStatus")
			.addFunction("__tostring", &stCharaStatus::ToString)
			.addFunction("GetPtrAddr", &stCharaStatus::GetPtrAddr)
			.addProperty("resNo", &stCharaStatus::resNo)
			.addProperty("datNo", &stCharaStatus::datNo)
			.addProperty("charaType", &stCharaStatus::charaType)
			.addProperty("zakoWepType", &stCharaStatus::zakoWepType)
			.addProperty("maxHp", &stCharaStatus::maxHp)
			.addProperty("hp", &stCharaStatus::hp)
			.addProperty("money", &stCharaStatus::money)
			.addProperty("dropMoney", &stCharaStatus::dropMoney)
			.addProperty("tension", &stCharaStatus::tension)
			.addProperty("hajikiCount", &stCharaStatus::hajikiCount)
			.addProperty("alwaysCheckHitColl", &stCharaStatus::alwaysCheckHitColl)
			.addProperty("pos", &stCharaStatus::pos)
			.addProperty("beforePos", &stCharaStatus::beforePos)
			.addProperty("oldPos", &stCharaStatus::oldPos)
			.addProperty("navelPos", &stCharaStatus::navelPos)
			.addProperty("brainPos", &stCharaStatus::brainPos)
			.addProperty("rot", &stCharaStatus::rot)
			.addProperty("scale", &stCharaStatus::scale)
			.addProperty("qRot", &stCharaStatus::qRot)
			.addProperty("movSpd", &stCharaStatus::movSpd)
			.addProperty("hitSize", &stCharaStatus::hitSize)
			.addProperty("height", &stCharaStatus::height)
			.addProperty("aPos", &stCharaStatus::aPos)
			.addProperty("aRot", &stCharaStatus::aRot)
			.addProperty("enterPattern", &stCharaStatus::enterPattern)
			.addProperty("reactionDist", &stCharaStatus::reactionDist)
			.addProperty("itemNo", &stCharaStatus::itemNo)
			.addProperty("mAiDefBasic", &stCharaStatus::mAiDefBasic)
			.addProperty("mAiDefCurrent", &stCharaStatus::mAiDefCurrent)
			.addProperty("mAiDefTick", &stCharaStatus::mAiDefTick)
			.addProperty("mAiDefBaseTick", &stCharaStatus::mAiDefBaseTick)
			.addProperty("mAiDamageCount", &stCharaStatus::mAiDamageCount)
			// char* type not supported in LuaBridge
			//.addProperty("pScriptProc", &stCharaStatus::pScriptProc)
			.addProperty("tsubazeriNum", &stCharaStatus::tsubazeriNum)
			.addProperty("DamageAcceptFrame", &stCharaStatus::DamageAcceptFrame)
			.addProperty("motionNo", &stCharaStatus::motionNo)
			.addProperty("motionBrendNum", &stCharaStatus::motionBrendNum)
			.addProperty("motSpd", &stCharaStatus::motSpd)
			.addProperty("subMotSpd", &stCharaStatus::subMotSpd)
			.addProperty("condition", &stCharaStatus::condition)
			.addProperty("footHitResultObj", &stCharaStatus::footHitResultObj)
			.addProperty("footHitResult", &stCharaStatus::footHitResult)
			.addProperty("footHitResultObj2", &stCharaStatus::footHitResultObj2)
			.addProperty("HitWallObj", &stCharaStatus::HitWallObj)
			.addProperty("hitWallMaterial", &stCharaStatus::hitWallMaterial)
			.addProperty("HitWallNormal", &stCharaStatus::HitWallNormal)
			.addProperty("dmgInfo", &stCharaStatus::dmgInfo)
			.addProperty("mYukaNormal", &stCharaStatus::mYukaNormal)
			.addProperty("mFootNumber", &stCharaStatus::mFootNumber)
			.addProperty("movTick", &stCharaStatus::movTick)
			.addProperty("hitNum", &stCharaStatus::hitNum)
			.addProperty("hitColl", &stCharaStatus::hitColl)
			.addProperty("mAiAtkLv", &stCharaStatus::mAiAtkLv)
			.addProperty("mAiAtkClass", &stCharaStatus::mAiAtkClass)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("AtkAi", &stCharaStatus::AtkAi)
			.addProperty("renderSkipCounter", &stCharaStatus::renderSkipCounter)
			.addProperty("renderSkipMotSpd", &stCharaStatus::renderSkipMotSpd)
			.addProperty("frameStop", &stCharaStatus::frameStop)
			.addProperty("lockOnDistance", &stCharaStatus::lockOnDistance)
			.addProperty("lockOnDistanceHi", &stCharaStatus::lockOnDistanceHi)
			.addProperty("lockOnDistanceLow", &stCharaStatus::lockOnDistanceLow)
			.addProperty("DrawYAdjust", &stCharaStatus::DrawYAdjust)
			.addProperty("bBloom", &stCharaStatus::bBloom)
			.addProperty("JumpBlockHit", &stCharaStatus::JumpBlockHit)
			.addProperty("AtkDisAdjust", &stCharaStatus::AtkDisAdjust)
			.addProperty("TubaFrmOffset", &stCharaStatus::TubaFrmOffset)
			.addProperty("motionNoNpc", &stCharaStatus::motionNoNpc)
			.addProperty("semiTransRate", &stCharaStatus::semiTransRate)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("flag", &stCharaStatus::flag)
		.endClass();
	}
#endif
};
static_assert(sizeof(stCharaStatus::resNo) == 4, "expected resNo to be size 4");
static_assert(sizeof(stCharaStatus::datNo) == 4, "expected datNo to be size 4");
static_assert(sizeof(stCharaStatus::charaType) == 4, "expected charaType to be size 4");
static_assert(sizeof(stCharaStatus::zakoWepType) == 2, "expected zakoWepType to be size 2");
static_assert(sizeof(stCharaStatus::maxHp) == 4, "expected maxHp to be size 4");
static_assert(sizeof(stCharaStatus::hp) == 4, "expected hp to be size 4");
static_assert(sizeof(stCharaStatus::money) == 2, "expected money to be size 2");
static_assert(sizeof(stCharaStatus::dropMoney) == 2, "expected dropMoney to be size 2");
static_assert(sizeof(stCharaStatus::tension) == 4, "expected tension to be size 4");
static_assert(sizeof(stCharaStatus::hajikiCount) == 4, "expected hajikiCount to be size 4");
static_assert(sizeof(stCharaStatus::alwaysCheckHitColl) == 1, "expected alwaysCheckHitColl to be size 1");
static_assert(sizeof(stCharaStatus::pos) == 12, "expected pos to be size 12");
static_assert(sizeof(stCharaStatus::beforePos) == 12, "expected beforePos to be size 12");
static_assert(sizeof(stCharaStatus::oldPos) == 12, "expected oldPos to be size 12");
static_assert(sizeof(stCharaStatus::navelPos) == 12, "expected navelPos to be size 12");
static_assert(sizeof(stCharaStatus::brainPos) == 12, "expected brainPos to be size 12");
static_assert(sizeof(stCharaStatus::rot) == 12, "expected rot to be size 12");
static_assert(sizeof(stCharaStatus::scale) == 12, "expected scale to be size 12");
static_assert(sizeof(stCharaStatus::qRot) == 16, "expected qRot to be size 16");
static_assert(sizeof(stCharaStatus::movSpd) == 4, "expected movSpd to be size 4");
static_assert(sizeof(stCharaStatus::hitSize) == 4, "expected hitSize to be size 4");
static_assert(sizeof(stCharaStatus::height) == 4, "expected height to be size 4");
static_assert(sizeof(stCharaStatus::aPos) == 96, "expected aPos to be size 96");
static_assert(sizeof(stCharaStatus::aRot) == 96, "expected aRot to be size 96");
static_assert(sizeof(stCharaStatus::enterPattern) == 4, "expected enterPattern to be size 4");
static_assert(sizeof(stCharaStatus::reactionDist) == 4, "expected reactionDist to be size 4");
static_assert(sizeof(stCharaStatus::itemNo) == 4, "expected itemNo to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefBasic) == 4, "expected mAiDefBasic to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefCurrent) == 4, "expected mAiDefCurrent to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefTick) == 4, "expected mAiDefTick to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefBaseTick) == 4, "expected mAiDefBaseTick to be size 4");
static_assert(sizeof(stCharaStatus::mAiDamageCount) == 4, "expected mAiDamageCount to be size 4");
static_assert(sizeof(stCharaStatus::pScriptProc) == 4, "expected pScriptProc to be size 4");
static_assert(sizeof(stCharaStatus::tsubazeriNum) == 4, "expected tsubazeriNum to be size 4");
static_assert(sizeof(stCharaStatus::DamageAcceptFrame) == 4, "expected DamageAcceptFrame to be size 4");
static_assert(sizeof(stCharaStatus::motionNo) == 4, "expected motionNo to be size 4");
static_assert(sizeof(stCharaStatus::motionBrendNum) == 1, "expected motionBrendNum to be size 1");
static_assert(sizeof(stCharaStatus::motSpd) == 4, "expected motSpd to be size 4");
static_assert(sizeof(stCharaStatus::subMotSpd) == 4, "expected subMotSpd to be size 4");
static_assert(sizeof(stCharaStatus::condition) == 4, "expected condition to be size 4");
static_assert(sizeof(stCharaStatus::footHitResultObj) == 4, "expected footHitResultObj to be size 4");
static_assert(sizeof(stCharaStatus::footHitResult) == 4, "expected footHitResult to be size 4");
static_assert(sizeof(stCharaStatus::footHitResultObj2) == 76, "expected footHitResultObj2 to be size 76");
static_assert(sizeof(stCharaStatus::HitWallObj) == 76, "expected HitWallObj to be size 76");
static_assert(sizeof(stCharaStatus::hitWallMaterial) == 4, "expected hitWallMaterial to be size 4");
static_assert(sizeof(stCharaStatus::HitWallNormal) == 12, "expected HitWallNormal to be size 12");
static_assert(sizeof(stCharaStatus::dmgInfo) == 108, "expected dmgInfo to be size 108");
static_assert(sizeof(stCharaStatus::mYukaNormal) == 12, "expected mYukaNormal to be size 12");
static_assert(sizeof(stCharaStatus::mFootNumber) == 4, "expected mFootNumber to be size 4");
static_assert(sizeof(stCharaStatus::movTick) == 4, "expected movTick to be size 4");
static_assert(sizeof(stCharaStatus::hitNum) == 2, "expected hitNum to be size 2");
static_assert(sizeof(stCharaStatus::hitColl) == 96, "expected hitColl to be size 96");
static_assert(sizeof(stCharaStatus::mAiAtkLv) == 4, "expected mAiAtkLv to be size 4");
static_assert(sizeof(stCharaStatus::mAiAtkClass) == 4, "expected mAiAtkClass to be size 4");
static_assert(sizeof(stCharaStatus::AtkAi) == 20, "expected AtkAi to be size 20");
static_assert(sizeof(stCharaStatus::renderSkipCounter) == 4, "expected renderSkipCounter to be size 4");
static_assert(sizeof(stCharaStatus::renderSkipMotSpd) == 4, "expected renderSkipMotSpd to be size 4");
static_assert(sizeof(stCharaStatus::frameStop) == 4, "expected frameStop to be size 4");
static_assert(sizeof(stCharaStatus::lockOnDistance) == 4, "expected lockOnDistance to be size 4");
static_assert(sizeof(stCharaStatus::lockOnDistanceHi) == 4, "expected lockOnDistanceHi to be size 4");
static_assert(sizeof(stCharaStatus::lockOnDistanceLow) == 4, "expected lockOnDistanceLow to be size 4");
static_assert(sizeof(stCharaStatus::DrawYAdjust) == 4, "expected DrawYAdjust to be size 4");
static_assert(sizeof(stCharaStatus::bBloom) == 1, "expected bBloom to be size 1");
static_assert(sizeof(stCharaStatus::JumpBlockHit) == 1, "expected JumpBlockHit to be size 1");
static_assert(sizeof(stCharaStatus::AtkDisAdjust) == 4, "expected AtkDisAdjust to be size 4");
static_assert(sizeof(stCharaStatus::TubaFrmOffset) == 4, "expected TubaFrmOffset to be size 4");
static_assert(sizeof(stCharaStatus::motionNoNpc) == 4, "expected motionNoNpc to be size 4");
static_assert(sizeof(stCharaStatus::semiTransRate) == 32, "expected semiTransRate to be size 32");
static_assert(sizeof(stCharaStatus::flag) == 8, "expected flag to be size 8");
static_assert(sizeof(stCharaStatus) == 924, "expected struct stCharaStatus to be size 924");

// [Structure] class ghmListObj
/// <summary>
/// Linked list object (mpPrev and mpNext).
/// </summary>
class ghmListObj
{
public:
	/// Struct member variables

	// <void* (* field_0)[0x6], offset 0x0>
	void* (* field_0)[0x6];

	// <ghmListObj* mpPrev, offset 0x4>
	ghmListObj* mpPrev;

	// <ghmListObj* mpNext, offset 0x8>
	ghmListObj* mpNext;

	// <int32_t mPriority, offset 0xc>
	int32_t mPriority;

	mHRChara* AsHRChara() const { return (mHRChara*)this; }
	std::string ToString() const { return "class ghmListObj(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmListObj>("ghmListObj")
			.addFunction("__tostring", &ghmListObj::ToString)
			.addFunction("GetPtrAddr", &ghmListObj::GetPtrAddr)
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &ghmListObj::field_0)
			.addProperty("mpPrev", &ghmListObj::mpPrev)
			.addProperty("mpNext", &ghmListObj::mpNext)
			.addProperty("mPriority", &ghmListObj::mPriority)
			.addFunction("AsHRChara", &ghmListObj::AsHRChara)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmListObj::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(ghmListObj::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(ghmListObj::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(ghmListObj::mPriority) == 4, "expected mPriority to be size 4");
static_assert(sizeof(ghmListObj) == 16, "expected class ghmListObj to be size 16");

// enum eUDLR
enum eUDLR : uint32_t
{
	// <eUp = 0x0>
	eUp = 0,

	// <eDown = 0x1>
	eDown = 1,

	// <eLeft = 0x2>
	eLeft = 2,

	// <eRight = 0x3>
	eRight = 3,

	// <eUDLRMax = 0x4>
	eUDLRMax = 4

};

// enum enWepLeftRight
enum enWepLeftRight : uint32_t
{
	// <eWepLeft = 0x0>
	eWepLeft = 0,

	// <eWepRight = 0x1>
	eWepRight = 1,

	// <eWepLeftRightMax = 0x2>
	eWepLeftRightMax = 2

};

// enum eDmgCallBackDmgType
enum eDmgCallBackDmgType : uint32_t
{
	// <eDmgCallBackDmgType_Cut = 0x0>
	eDmgCallBackDmgType_Cut = 0,

	// <eDmgCallBackDmgType_Through = 0x1>
	eDmgCallBackDmgType_Through = 1

};

// [Structure] struct CharControlMotID
struct CharControlMotID
{
public:
	/// Struct member variables

	// <int32_t WalkNeutral, offset 0x0>
	int32_t WalkNeutral;

	// <int32_t WalkFront, offset 0x4>
	int32_t WalkFront;

	// <int32_t WalkBack, offset 0x8>
	int32_t WalkBack;

	// <int32_t WalkSideLeft, offset 0xc>
	int32_t WalkSideLeft;

	// <int32_t WalkSideRight, offset 0x10>
	int32_t WalkSideRight;

	// <int32_t Run, offset 0x14>
	int32_t Run;

	// <int32_t EvacuateBack, offset 0x18>
	int32_t EvacuateBack;

	// <int32_t EvacuateLeft, offset 0x1c>
	int32_t EvacuateLeft;

	// <int32_t EvacuateRight, offset 0x20>
	int32_t EvacuateRight;

	std::string ToString() const { return "struct CharControlMotID(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CharControlMotID>("CharControlMotID")
			.addFunction("__tostring", &CharControlMotID::ToString)
			.addFunction("GetPtrAddr", &CharControlMotID::GetPtrAddr)
			.addProperty("WalkNeutral", &CharControlMotID::WalkNeutral)
			.addProperty("WalkFront", &CharControlMotID::WalkFront)
			.addProperty("WalkBack", &CharControlMotID::WalkBack)
			.addProperty("WalkSideLeft", &CharControlMotID::WalkSideLeft)
			.addProperty("WalkSideRight", &CharControlMotID::WalkSideRight)
			.addProperty("Run", &CharControlMotID::Run)
			.addProperty("EvacuateBack", &CharControlMotID::EvacuateBack)
			.addProperty("EvacuateLeft", &CharControlMotID::EvacuateLeft)
			.addProperty("EvacuateRight", &CharControlMotID::EvacuateRight)
		.endClass();
	}
#endif
};
static_assert(sizeof(CharControlMotID::WalkNeutral) == 4, "expected WalkNeutral to be size 4");
static_assert(sizeof(CharControlMotID::WalkFront) == 4, "expected WalkFront to be size 4");
static_assert(sizeof(CharControlMotID::WalkBack) == 4, "expected WalkBack to be size 4");
static_assert(sizeof(CharControlMotID::WalkSideLeft) == 4, "expected WalkSideLeft to be size 4");
static_assert(sizeof(CharControlMotID::WalkSideRight) == 4, "expected WalkSideRight to be size 4");
static_assert(sizeof(CharControlMotID::Run) == 4, "expected Run to be size 4");
static_assert(sizeof(CharControlMotID::EvacuateBack) == 4, "expected EvacuateBack to be size 4");
static_assert(sizeof(CharControlMotID::EvacuateLeft) == 4, "expected EvacuateLeft to be size 4");
static_assert(sizeof(CharControlMotID::EvacuateRight) == 4, "expected EvacuateRight to be size 4");
static_assert(sizeof(CharControlMotID) == 36, "expected struct CharControlMotID to be size 36");

// [Structure] struct GXColor
struct GXColor
{
public:
	/// Struct member variables

	// <uint32_t PackedValue, offset 0x0>
	uint32_t PackedValue;

	std::string ToString() const { return "struct GXColor(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GXColor>("GXColor")
			.addFunction("__tostring", &GXColor::ToString)
			.addFunction("GetPtrAddr", &GXColor::GetPtrAddr)
			.addProperty("PackedValue", &GXColor::PackedValue)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXColor::PackedValue) == 4, "expected PackedValue to be size 4");
static_assert(sizeof(GXColor) == 4, "expected struct GXColor to be size 4");

// [Structure] union __m128
union __m128
{
public:
	/// Struct member variables

	// <float m128_f32[0x4], offset 0x0>
	float m128_f32[4];

	std::string ToString() const { return "union __m128(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<__m128>("__m128")
			.addFunction("__tostring", &__m128::ToString)
			.addFunction("GetPtrAddr", &__m128::GetPtrAddr)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m128_f32", &__m128::m128_f32)
		.endClass();
	}
#endif
};
static_assert(sizeof(__m128::m128_f32) == 16, "expected m128_f32 to be size 16");
static_assert(sizeof(__m128) == 16, "expected union __m128 to be size 16");

// [Structure] class vector4f
class vector4f
{
public:
	/// Struct member variables

	// <uint32_t u[0x4], offset 0x0>
	uint32_t u[4];

	std::string ToString() const { return "class vector4f(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<vector4f>("vector4f")
			.addFunction("__tostring", &vector4f::ToString)
			.addFunction("GetPtrAddr", &vector4f::GetPtrAddr)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("u", &vector4f::u)
		.endClass();
	}
#endif
};
static_assert(sizeof(vector4f::u) == 16, "expected u to be size 16");
static_assert(sizeof(vector4f) == 16, "expected class vector4f to be size 16");

// [Structure] class vector4x
class vector4x
{
public:
	/// Struct member variables

	// <double sd[0x2], offset 0x0>
	double sd[2];

	std::string ToString() const { return "class vector4x(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<vector4x>("vector4x")
			.addFunction("__tostring", &vector4x::ToString)
			.addFunction("GetPtrAddr", &vector4x::GetPtrAddr)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("sd", &vector4x::sd)
		.endClass();
	}
#endif
};
static_assert(sizeof(vector4x::sd) == 16, "expected sd to be size 16");
static_assert(sizeof(vector4x) == 16, "expected class vector4x to be size 16");

// [Structure] class tiVector
class tiVector
{
public:
	/// Struct member variables

	// <float x, offset 0x0>
	float x;

	// <float y, offset 0x4>
	float y;

	// <float z, offset 0x8>
	float z;

	// <float w, offset 0xc>
	float w;

	std::string ToString() const { return "class tiVector(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<tiVector>("tiVector")
			.addFunction("__tostring", &tiVector::ToString)
			.addFunction("GetPtrAddr", &tiVector::GetPtrAddr)
			.addProperty("x", &tiVector::x)
			.addProperty("y", &tiVector::y)
			.addProperty("z", &tiVector::z)
			.addProperty("w", &tiVector::w)
		.endClass();
	}
#endif
};
static_assert(sizeof(tiVector::x) == 4, "expected x to be size 4");
static_assert(sizeof(tiVector::y) == 4, "expected y to be size 4");
static_assert(sizeof(tiVector::z) == 4, "expected z to be size 4");
static_assert(sizeof(tiVector::w) == 4, "expected w to be size 4");
static_assert(sizeof(tiVector) == 16, "expected class tiVector to be size 16");

// [Structure] class mot::IBoneEffectModel
namespace mot
{
	class IBoneEffectModel
	{
	public:
		/// Struct member variables

		// <void* (* field_0)[0x1f], offset 0x0>
		void* (* field_0)[0x1f];

		std::string ToString() const { return "class IBoneEffectModel(" + std::to_string(GetPtrAddr()) + ")"; }
		int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<mot::IBoneEffectModel>("mot_IBoneEffectModel")
				.addFunction("__tostring", &mot::IBoneEffectModel::ToString)
				.addFunction("GetPtrAddr", &mot::IBoneEffectModel::GetPtrAddr)
				// delegates are not supported in LuaBridge
				//.addProperty("field_0", &mot::IBoneEffectModel::field_0)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(mot::IBoneEffectModel::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(mot::IBoneEffectModel) == 4, "expected class mot::IBoneEffectModel to be size 4");

// [Structure] class mot::IBoneEffectModelPJ
namespace mot
{
	class IBoneEffectModelPJ : public mot::IBoneEffectModel
	{
	public:
		/// Struct member variables

		// <class mot::IBoneEffectModel field_0, offset 0x0>
		// class IBoneEffectModel Super;

		// <Unidentified data segment, offset 0x4>
	private:
		char _UnidentifiedData1[12];

	public:
		// <class tiVector m_inYureBonePosiOfst, offset 0x10>
		class tiVector m_inYureBonePosiOfst;

		std::string ToString() const { return "class IBoneEffectModelPJ(" + std::to_string(GetPtrAddr()) + ")"; }
		int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.deriveClass<mot::IBoneEffectModelPJ, mot::IBoneEffectModel>("mot_IBoneEffectModelPJ")
				.addFunction("__tostring", &mot::IBoneEffectModelPJ::ToString)
				.addFunction("GetPtrAddr", &mot::IBoneEffectModelPJ::GetPtrAddr)
				.addProperty("m_inYureBonePosiOfst", &mot::IBoneEffectModelPJ::m_inYureBonePosiOfst)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(mot::IBoneEffectModelPJ::m_inYureBonePosiOfst) == 16, "expected m_inYureBonePosiOfst to be size 16");
static_assert(sizeof(mot::IBoneEffectModelPJ) == 32, "expected class mot::IBoneEffectModelPJ to be size 32");

// [Structure] class TGmf
class TGmf : public mot::IBoneEffectModelPJ
{
public:
	// [Structure] struct TGmf::tagMAIN
	struct tagMAIN
	{
	public:
		/// Struct member variables

		// <Unidentified data segment, offset 0x0>
	private:
		char _UnidentifiedData[2284];
	public:

		std::string ToString() const { return "struct tagMAIN(" + std::to_string(GetPtrAddr()) + ")"; }
		int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TGmf::tagMAIN>("TGmf_tagMAIN")
				.addFunction("__tostring", &TGmf::tagMAIN::ToString)
				.addFunction("GetPtrAddr", &TGmf::tagMAIN::GetPtrAddr)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TGmf::tagMAIN) == 2284, "expected struct TGmf::tagMAIN to be size 2284");

	/// Struct member variables

	// <class mot::IBoneEffectModelPJ field_0, offset 0x0>
	// class mot::IBoneEffectModelPJ Super;

	// <struct TGmf::tagMAIN dat, offset 0x20>
	struct TGmf::tagMAIN dat;

	// <uint8_t mUseLight, offset 0x90c>
	uint8_t mUseLight;

	// <Unidentified data segment, offset 0x90d>
private:
	char _UnidentifiedData3[3];

public:
	// <class TGanPlay* mpFrameInfoPlay, offset 0x910>
	class TGanPlay* mpFrameInfoPlay;

	// <class TGanPlayNode* mpFrameInfoNode, offset 0x914>
	class TGanPlayNode* mpFrameInfoNode;

	// <class TGanPlay* mpEffectInfoPlay, offset 0x918>
	class TGanPlay* mpEffectInfoPlay;

	// <class TGanPlayNode* mpSmokeParam1Node, offset 0x91c>
	class TGanPlayNode* mpSmokeParam1Node;

	// <class TGanPlayNode* mpSmokeParam2Node, offset 0x920>
	class TGanPlayNode* mpSmokeParam2Node;

	// <int32_t mHitFrameNum, offset 0x924>
	int32_t mHitFrameNum;

	// <int32_t mDmgMotNum, offset 0x928>
	int32_t mDmgMotNum;

	// <int32_t mGrdMotNum, offset 0x92c>
	int32_t mGrdMotNum;

	// <int32_t mNextGrdMotNum, offset 0x930>
	int32_t mNextGrdMotNum;

	// <int32_t mAtkDirec, offset 0x934>
	int32_t mAtkDirec;

	// <int32_t mEffectNum, offset 0x938>
	int32_t mEffectNum;

	// <float mIKBlendRate, offset 0x93c>
	float mIKBlendRate;

	// <float mSlowRate, offset 0x940>
	float mSlowRate;

	// <uint8_t mbDrawMirror, offset 0x944>
	uint8_t mbDrawMirror;

	// <uint8_t mbObj, offset 0x945>
	uint8_t mbObj;

	// <Unidentified data segment, offset 0x946>
private:
	char _UnidentifiedData18[2];

public:
	// <float m_fFadeAlpha, offset 0x948>
	float m_fFadeAlpha;

	// <class TGmfNode* m_pLocatorNode, offset 0x94c>
	class TGmfNode* m_pLocatorNode;

	// <int32_t m_nTotalModel, offset 0x950>
	int32_t m_nTotalModel;

	// <int32_t m_nCurModelIndex, offset 0x954>
	int32_t m_nCurModelIndex;

	// <class TGmfNode* m_pCurModelTopNode, offset 0x958>
	class TGmfNode* m_pCurModelTopNode;

	// <class TGmfNode* m_pBoneEffectTopNode, offset 0x95c>
	class TGmfNode* m_pBoneEffectTopNode;

	// <uint32_t m_bActedSetupRefMesh, offset 0x960>
	uint32_t m_bActedSetupRefMesh;

	// <uint32_t m_bActedRefreshRefMesh, offset 0x964>
	uint32_t m_bActedRefreshRefMesh;

	// <class mot::IBoneEffectPJ* m_pBoneEffect, offset 0x968>
	class mot::IBoneEffectPJ* m_pBoneEffect;

	// <uint8_t m_bActedBoneEffectInit, offset 0x96c>
	uint8_t m_bActedBoneEffectInit;

	// <uint8_t m_bActBoneEffectOnUpdate, offset 0x96d>
	uint8_t m_bActBoneEffectOnUpdate;

	// <Unidentified data segment, offset 0x96e>
private:
	char _UnidentifiedData29[2];

public:
	// <char const* m_sIDName, offset 0x970>
	char const* m_sIDName;

	// <int32_t m_nIDNum, offset 0x974>
	int32_t m_nIDNum;

	// <char const* m_sMotName, offset 0x978>
	char const* m_sMotName;

	// <int32_t m_nTotalCamVibTiming, offset 0x97c>
	int32_t m_nTotalCamVibTiming;

	// <class CCameraVibTiming* m_ainCamVibTiming, offset 0x980>
	class CCameraVibTiming* m_ainCamVibTiming;

	// <uint8_t m_bIsBootCamVib, offset 0x984>
	uint8_t m_bIsBootCamVib;

	// <Unidentified data segment, offset 0x985>
private:
	char _UnidentifiedData[11];
public:

	std::string ToString() const { return "class TGmf(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<TGmf, mot::IBoneEffectModelPJ>("TGmf")
			.addFunction("__tostring", &TGmf::ToString)
			.addFunction("GetPtrAddr", &TGmf::GetPtrAddr)
			.addProperty("dat", &TGmf::dat)
			.addProperty("mUseLight", &TGmf::mUseLight)
			.addProperty("mpFrameInfoPlay", &TGmf::mpFrameInfoPlay)
			.addProperty("mpFrameInfoNode", &TGmf::mpFrameInfoNode)
			.addProperty("mpEffectInfoPlay", &TGmf::mpEffectInfoPlay)
			.addProperty("mpSmokeParam1Node", &TGmf::mpSmokeParam1Node)
			.addProperty("mpSmokeParam2Node", &TGmf::mpSmokeParam2Node)
			.addProperty("mHitFrameNum", &TGmf::mHitFrameNum)
			.addProperty("mDmgMotNum", &TGmf::mDmgMotNum)
			.addProperty("mGrdMotNum", &TGmf::mGrdMotNum)
			.addProperty("mNextGrdMotNum", &TGmf::mNextGrdMotNum)
			.addProperty("mAtkDirec", &TGmf::mAtkDirec)
			.addProperty("mEffectNum", &TGmf::mEffectNum)
			.addProperty("mIKBlendRate", &TGmf::mIKBlendRate)
			.addProperty("mSlowRate", &TGmf::mSlowRate)
			.addProperty("mbDrawMirror", &TGmf::mbDrawMirror)
			.addProperty("mbObj", &TGmf::mbObj)
			.addProperty("m_fFadeAlpha", &TGmf::m_fFadeAlpha)
			.addProperty("m_pLocatorNode", &TGmf::m_pLocatorNode)
			.addProperty("m_nTotalModel", &TGmf::m_nTotalModel)
			.addProperty("m_nCurModelIndex", &TGmf::m_nCurModelIndex)
			.addProperty("m_pCurModelTopNode", &TGmf::m_pCurModelTopNode)
			.addProperty("m_pBoneEffectTopNode", &TGmf::m_pBoneEffectTopNode)
			.addProperty("m_bActedSetupRefMesh", &TGmf::m_bActedSetupRefMesh)
			.addProperty("m_bActedRefreshRefMesh", &TGmf::m_bActedRefreshRefMesh)
			.addProperty("m_pBoneEffect", &TGmf::m_pBoneEffect)
			.addProperty("m_bActedBoneEffectInit", &TGmf::m_bActedBoneEffectInit)
			.addProperty("m_bActBoneEffectOnUpdate", &TGmf::m_bActBoneEffectOnUpdate)
			// pointer to const not supported in LuaBridge and needs a getter
			//.addProperty("m_sIDName", &TGmf::m_sIDName)
			.addProperty("m_nIDNum", &TGmf::m_nIDNum)
			// pointer to const not supported in LuaBridge and needs a getter
			//.addProperty("m_sMotName", &TGmf::m_sMotName)
			.addProperty("m_nTotalCamVibTiming", &TGmf::m_nTotalCamVibTiming)
			.addProperty("m_ainCamVibTiming", &TGmf::m_ainCamVibTiming)
			.addProperty("m_bIsBootCamVib", &TGmf::m_bIsBootCamVib)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGmf::dat) == 2284, "expected dat to be size 2284");
static_assert(sizeof(TGmf::mUseLight) == 1, "expected mUseLight to be size 1");
static_assert(sizeof(TGmf::mpFrameInfoPlay) == 4, "expected mpFrameInfoPlay to be size 4");
static_assert(sizeof(TGmf::mpFrameInfoNode) == 4, "expected mpFrameInfoNode to be size 4");
static_assert(sizeof(TGmf::mpEffectInfoPlay) == 4, "expected mpEffectInfoPlay to be size 4");
static_assert(sizeof(TGmf::mpSmokeParam1Node) == 4, "expected mpSmokeParam1Node to be size 4");
static_assert(sizeof(TGmf::mpSmokeParam2Node) == 4, "expected mpSmokeParam2Node to be size 4");
static_assert(sizeof(TGmf::mHitFrameNum) == 4, "expected mHitFrameNum to be size 4");
static_assert(sizeof(TGmf::mDmgMotNum) == 4, "expected mDmgMotNum to be size 4");
static_assert(sizeof(TGmf::mGrdMotNum) == 4, "expected mGrdMotNum to be size 4");
static_assert(sizeof(TGmf::mNextGrdMotNum) == 4, "expected mNextGrdMotNum to be size 4");
static_assert(sizeof(TGmf::mAtkDirec) == 4, "expected mAtkDirec to be size 4");
static_assert(sizeof(TGmf::mEffectNum) == 4, "expected mEffectNum to be size 4");
static_assert(sizeof(TGmf::mIKBlendRate) == 4, "expected mIKBlendRate to be size 4");
static_assert(sizeof(TGmf::mSlowRate) == 4, "expected mSlowRate to be size 4");
static_assert(sizeof(TGmf::mbDrawMirror) == 1, "expected mbDrawMirror to be size 1");
static_assert(sizeof(TGmf::mbObj) == 1, "expected mbObj to be size 1");
static_assert(sizeof(TGmf::m_fFadeAlpha) == 4, "expected m_fFadeAlpha to be size 4");
static_assert(sizeof(TGmf::m_pLocatorNode) == 4, "expected m_pLocatorNode to be size 4");
static_assert(sizeof(TGmf::m_nTotalModel) == 4, "expected m_nTotalModel to be size 4");
static_assert(sizeof(TGmf::m_nCurModelIndex) == 4, "expected m_nCurModelIndex to be size 4");
static_assert(sizeof(TGmf::m_pCurModelTopNode) == 4, "expected m_pCurModelTopNode to be size 4");
static_assert(sizeof(TGmf::m_pBoneEffectTopNode) == 4, "expected m_pBoneEffectTopNode to be size 4");
static_assert(sizeof(TGmf::m_bActedSetupRefMesh) == 4, "expected m_bActedSetupRefMesh to be size 4");
static_assert(sizeof(TGmf::m_bActedRefreshRefMesh) == 4, "expected m_bActedRefreshRefMesh to be size 4");
static_assert(sizeof(TGmf::m_pBoneEffect) == 4, "expected m_pBoneEffect to be size 4");
static_assert(sizeof(TGmf::m_bActedBoneEffectInit) == 1, "expected m_bActedBoneEffectInit to be size 1");
static_assert(sizeof(TGmf::m_bActBoneEffectOnUpdate) == 1, "expected m_bActBoneEffectOnUpdate to be size 1");
static_assert(sizeof(TGmf::m_sIDName) == 4, "expected m_sIDName to be size 4");
static_assert(sizeof(TGmf::m_nIDNum) == 4, "expected m_nIDNum to be size 4");
static_assert(sizeof(TGmf::m_sMotName) == 4, "expected m_sMotName to be size 4");
static_assert(sizeof(TGmf::m_nTotalCamVibTiming) == 4, "expected m_nTotalCamVibTiming to be size 4");
static_assert(sizeof(TGmf::m_ainCamVibTiming) == 4, "expected m_ainCamVibTiming to be size 4");
static_assert(sizeof(TGmf::m_bIsBootCamVib) == 1, "expected m_bIsBootCamVib to be size 1");
static_assert(sizeof(TGmf) == 2448, "expected class TGmf to be size 2448");

// [Structure] class NYPhase
class NYPhase
{
public:
	/// Struct member variables

	// <int32_t m_phase, offset 0x0>
	int32_t m_phase;

	// <float m_frame, offset 0x4>
	float m_frame;

	// <float m_frameMax, offset 0x8>
	float m_frameMax;

	// <uint8_t m_useNext, offset 0xc>
	uint8_t m_useNext;

	// <Unidentified data segment, offset 0xd>
private:
	char _UnidentifiedData4[3];

public:
	// <int32_t m_nextPhase, offset 0x10>
	int32_t m_nextPhase;

	// <float m_nextFrame, offset 0x14>
	float m_nextFrame;

	// <float m_nextFrameMax, offset 0x18>
	float m_nextFrameMax;

	std::string ToString() const { return "class NYPhase(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<NYPhase>("NYPhase")
			.addFunction("__tostring", &NYPhase::ToString)
			.addFunction("GetPtrAddr", &NYPhase::GetPtrAddr)
			.addProperty("m_phase", &NYPhase::m_phase)
			.addProperty("m_frame", &NYPhase::m_frame)
			.addProperty("m_frameMax", &NYPhase::m_frameMax)
			.addProperty("m_useNext", &NYPhase::m_useNext)
			.addProperty("m_nextPhase", &NYPhase::m_nextPhase)
			.addProperty("m_nextFrame", &NYPhase::m_nextFrame)
			.addProperty("m_nextFrameMax", &NYPhase::m_nextFrameMax)
		.endClass();
	}
#endif
};
static_assert(sizeof(NYPhase::m_phase) == 4, "expected m_phase to be size 4");
static_assert(sizeof(NYPhase::m_frame) == 4, "expected m_frame to be size 4");
static_assert(sizeof(NYPhase::m_frameMax) == 4, "expected m_frameMax to be size 4");
static_assert(sizeof(NYPhase::m_useNext) == 1, "expected m_useNext to be size 1");
static_assert(sizeof(NYPhase::m_nextPhase) == 4, "expected m_nextPhase to be size 4");
static_assert(sizeof(NYPhase::m_nextFrame) == 4, "expected m_nextFrame to be size 4");
static_assert(sizeof(NYPhase::m_nextFrameMax) == 4, "expected m_nextFrameMax to be size 4");
static_assert(sizeof(NYPhase) == 28, "expected class NYPhase to be size 28");

// [Structure] class NYApproachToTargetVal
class NYApproachToTargetVal
{
public:
	// enum NYApproachToTargetVal::CHANGE_TYPE
	enum CHANGE_TYPE : uint32_t
	{
		// <CHANGE_TYPE_INCREASED = 0x0>
		CHANGE_TYPE_INCREASED = 0,

		// <CHANGE_TYPE_DECREASED = 0x1>
		CHANGE_TYPE_DECREASED = 1,

		// <CHANGE_TYPE_APPROACHED = 0x2>
		CHANGE_TYPE_APPROACHED = 2,

		// <CHANGE_TYPE_NO_CHANGED = 0x3>
		CHANGE_TYPE_NO_CHANGED = 3

	};

	/// Struct member variables

	// <float m_val, offset 0x0>
	float m_val;

	// <float m_targetVal, offset 0x4>
	float m_targetVal;

	// <enum NYApproachToTargetVal::CHANGE_TYPE m_lastChangeType, offset 0x8>
	enum NYApproachToTargetVal::CHANGE_TYPE m_lastChangeType;

	std::string ToString() const { return "class NYApproachToTargetVal(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<NYApproachToTargetVal>("NYApproachToTargetVal")
			.addFunction("__tostring", &NYApproachToTargetVal::ToString)
			.addFunction("GetPtrAddr", &NYApproachToTargetVal::GetPtrAddr)
			.addProperty("m_val", &NYApproachToTargetVal::m_val)
			.addProperty("m_targetVal", &NYApproachToTargetVal::m_targetVal)
			.addProperty("m_lastChangeType", &NYApproachToTargetVal::m_lastChangeType)
		.endClass();
	}
#endif
};
static_assert(sizeof(NYApproachToTargetVal::m_val) == 4, "expected m_val to be size 4");
static_assert(sizeof(NYApproachToTargetVal::m_targetVal) == 4, "expected m_targetVal to be size 4");
static_assert(sizeof(NYApproachToTargetVal::m_lastChangeType) == 4, "expected m_lastChangeType to be size 4");
static_assert(sizeof(NYApproachToTargetVal) == 12, "expected class NYApproachToTargetVal to be size 12");

// [Structure] class HrTask
class HrTask
{
public:
	/// Struct member variables

	// <Unidentified data segment, offset 0x0>
private:
	char _UnidentifiedData[80];
public:

	std::string ToString() const { return "class HrTask(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrTask>("HrTask")
			.addFunction("__tostring", &HrTask::ToString)
			.addFunction("GetPtrAddr", &HrTask::GetPtrAddr)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrTask) == 80, "expected class HrTask to be size 80");

// enum
enum : uint32_t
{
	// <E_CON_ACT_NONE = 0xffffffffffffffff>
	E_CON_ACT_NONE = UINT32_MAX,

	// <E_CON_ACT_FURIAGE = 0x0>
	E_CON_ACT_FURIAGE = 0,

	// <E_CON_ACT_UP = 0x1>
	E_CON_ACT_UP = 1,

	// <E_CON_ACT_DOWN = 0x2>
	E_CON_ACT_DOWN = 2,

	// <E_CON_ACT_PUSH = 0x3>
	E_CON_ACT_PUSH = 3,

	// <E_CON_ACT_PULL = 0x4>
	E_CON_ACT_PULL = 4,

	// <E_CON_ACT_RBLOW = 0x5>
	E_CON_ACT_RBLOW = 5,

	// <E_CON_ACT_LBLOW = 0x6>
	E_CON_ACT_LBLOW = 6,

	// <E_CON_ACT_ROTATE = 0x7>
	E_CON_ACT_ROTATE = 7,

	// <E_COM_ACT_CROSS = 0x8>
	E_COM_ACT_CROSS = 8

};

// [Structure] class HrBattleIcon
class HrBattleIcon : public HrTask
{
public:
	// enum HrBattleIcon::E_CON_ACT_ID
	enum E_CON_ACT_ID : uint32_t
	{
		// <E_CON_ACT_NONE = 0xffffffffffffffff>
		E_CON_ACT_NONE = UINT32_MAX,

		// <E_CON_ACT_FURIAGE = 0x0>
		E_CON_ACT_FURIAGE = 0,

		// <E_CON_ACT_UP = 0x1>
		E_CON_ACT_UP = 1,

		// <E_CON_ACT_DOWN = 0x2>
		E_CON_ACT_DOWN = 2,

		// <E_CON_ACT_PUSH = 0x3>
		E_CON_ACT_PUSH = 3,

		// <E_CON_ACT_PULL = 0x4>
		E_CON_ACT_PULL = 4,

		// <E_CON_ACT_RBLOW = 0x5>
		E_CON_ACT_RBLOW = 5,

		// <E_CON_ACT_LBLOW = 0x6>
		E_CON_ACT_LBLOW = 6,

		// <E_CON_ACT_ROTATE = 0x7>
		E_CON_ACT_ROTATE = 7,

		// <E_COM_ACT_CROSS = 0x8>
		E_COM_ACT_CROSS = 8

	};

	// enum HrBattleIcon::D_BICON_STAT
	enum D_BICON_STAT : uint32_t
	{
		// <D_BICON_NONE = 0x0>
		D_BICON_NONE = 0,

		// <D_BICON_MINI = 0x1>
		D_BICON_MINI = 1,

		// <D_BICON_MINI_TO_SKULL = 0x2>
		D_BICON_MINI_TO_SKULL = 2,

		// <D_BICON_SKULL_TO_MINI = 0x3>
		D_BICON_SKULL_TO_MINI = 3,

		// <D_BICON_SKULL = 0x4>
		D_BICON_SKULL = 4,

		// <D_BICON_TODOME_DO = 0x5>
		D_BICON_TODOME_DO = 5,

		// <D_BICON_TODOME_ED = 0x6>
		D_BICON_TODOME_ED = 6,

		// <D_BICON_CONTROLLER_ACT = 0x7>
		D_BICON_CONTROLLER_ACT = 7,

		// <D_BICON_TUBAZERI = 0x8>
		D_BICON_TUBAZERI = 8

	};

	// enum HrBattleIcon::D_TODOME_DIRECT
	enum D_TODOME_DIRECT : uint32_t
	{
		// <D_TODOME_RIGHT = 0x0>
		D_TODOME_RIGHT = 0,

		// <D_TODOME_DOWN = 0x1>
		D_TODOME_DOWN = 1,

		// <D_TODOME_LEFT = 0x2>
		D_TODOME_LEFT = 2,

		// <D_TODOME_UP = 0x3>
		D_TODOME_UP = 3,

		// <D_TODOME_360 = 0x4>
		D_TODOME_360 = 4,

		// <D_TODOME_2RIGHTDOWN = 0x5>
		D_TODOME_2RIGHTDOWN = 5,

		// <D_TODOME_2LEFTDOWN = 0x6>
		D_TODOME_2LEFTDOWN = 6

	};

	// [Structure] class HrBattleIcon::CHrHpGauge
	class CHrHpGauge
	{
	public:
		// [Function] void __convention("thiscall") HrBattleIcon::CHrHpGauge::Initialize(class HrBattleIcon::CHrHpGauge* const this, class mHRChara* arg2) [?Initialize@CHrHpGauge@HrBattleIcon@@QAEXPAVmHRChara@@@Z]
		void Initialize(class mHRChara* arg2)
		{
			typedef void(__thiscall* _Func)(class HrBattleIcon::CHrHpGauge* const thisPtr, class mHRChara* arg2);
			_Func mFunc = (_Func)(GameModule + 0x4ca550);
			return mFunc(this, arg2);
		}
		/// Struct member variables

		// <class NYPhase m_Phase, offset 0x0>
		class NYPhase m_Phase;

		// <void (* m_pPhaseProc[0x7][0x2])(HrBattleIcon::CHrHpGauge* const this), offset 0x1c>
		void (* m_pPhaseProc[0x7][0x2])(HrBattleIcon::CHrHpGauge* const ThisPtr);

		// <class mHRChara* m_pTargetChara, offset 0x54>
		class mHRChara* m_pTargetChara;

		// <int16_t const mc_Height, offset 0x58>
		int16_t mc_Height;

		// <int16_t const mc_FrameEdge_Width, offset 0x5a>
		int16_t mc_FrameEdge_Width;

		// <int16_t const mc_DrawOffsetY, offset 0x5c>
		int16_t mc_DrawOffsetY;

		// <Unidentified data segment, offset 0x5e>
	private:
		char _UnidentifiedData6[2];

	public:
		// <float m_DrawWidth, offset 0x60>
		float m_DrawWidth;

		// <float m_DrawHeight, offset 0x64>
		float m_DrawHeight;

		// <float m_DrawAlpha, offset 0x68>
		float m_DrawAlpha;

		// <float m_HpRate, offset 0x6c>
		float m_HpRate;

		// <int16_t m_SlashFadeCounter, offset 0x70>
		int16_t m_SlashFadeCounter;

		// <Unidentified data segment, offset 0x72>
	private:
		char _UnidentifiedData[2];
	public:

		std::string ToString() const { return "class CHrHpGauge(" + std::to_string(GetPtrAddr()) + ")"; }
		int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<HrBattleIcon::CHrHpGauge>("HrBattleIcon_CHrHpGauge")
				.addFunction("__tostring", &HrBattleIcon::CHrHpGauge::ToString)
				.addFunction("GetPtrAddr", &HrBattleIcon::CHrHpGauge::GetPtrAddr)
				.addProperty("m_Phase", &HrBattleIcon::CHrHpGauge::m_Phase)
				// void type not supported in LuaBridge
				//.addProperty("m_pPhaseProc", &HrBattleIcon::CHrHpGauge::m_pPhaseProc)
				.addProperty("m_pTargetChara", &HrBattleIcon::CHrHpGauge::m_pTargetChara)
				// const not supported in LuaBridge and needs a getter
				//.addProperty("mc_Height", &HrBattleIcon::CHrHpGauge::mc_Height)
				// const not supported in LuaBridge and needs a getter
				//.addProperty("mc_FrameEdge_Width", &HrBattleIcon::CHrHpGauge::mc_FrameEdge_Width)
				// const not supported in LuaBridge and needs a getter
				//.addProperty("mc_DrawOffsetY", &HrBattleIcon::CHrHpGauge::mc_DrawOffsetY)
				.addProperty("m_DrawWidth", &HrBattleIcon::CHrHpGauge::m_DrawWidth)
				.addProperty("m_DrawHeight", &HrBattleIcon::CHrHpGauge::m_DrawHeight)
				.addProperty("m_DrawAlpha", &HrBattleIcon::CHrHpGauge::m_DrawAlpha)
				.addProperty("m_HpRate", &HrBattleIcon::CHrHpGauge::m_HpRate)
				.addProperty("m_SlashFadeCounter", &HrBattleIcon::CHrHpGauge::m_SlashFadeCounter)
				.addFunction("Initialize", &HrBattleIcon::CHrHpGauge::Initialize)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_Phase) == 28, "expected m_Phase to be size 28");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_pPhaseProc) == 56, "expected m_pPhaseProc to be size 56");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_pTargetChara) == 4, "expected m_pTargetChara to be size 4");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::mc_Height) == 2, "expected mc_Height to be size 2");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::mc_FrameEdge_Width) == 2, "expected mc_FrameEdge_Width to be size 2");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::mc_DrawOffsetY) == 2, "expected mc_DrawOffsetY to be size 2");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_DrawWidth) == 4, "expected m_DrawWidth to be size 4");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_DrawHeight) == 4, "expected m_DrawHeight to be size 4");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_DrawAlpha) == 4, "expected m_DrawAlpha to be size 4");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_HpRate) == 4, "expected m_HpRate to be size 4");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge::m_SlashFadeCounter) == 2, "expected m_SlashFadeCounter to be size 2");
	static_assert(sizeof(HrBattleIcon::CHrHpGauge) == 116, "expected class HrBattleIcon::CHrHpGauge to be size 116");

	// [Function] void __convention("thiscall") HrBattleIcon::OnCharacterTerminate(class HrBattleIcon* const this, class mHRChara* arg2) [?OnCharacterTerminate@HrBattleIcon@@QAEXPAVmHRChara@@@Z]
	void OnCharacterTerminate(class mHRChara* arg2)
	{
		typedef void(__thiscall* _Func)(class HrBattleIcon* const thisPtr, class mHRChara* arg2);
		_Func mFunc = (_Func)(GameModule + 0x4cdbf0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") HrBattleIcon::Initialize(class HrBattleIcon* const this, class mHRChara* arg2, uint8_t arg3) [?Initialize@HrBattleIcon@@QAEXPAVmHRChara@@_N@Z]
	void Initialize(class mHRChara* arg2, uint8_t arg3)
	{
		typedef void(__thiscall* _Func)(class HrBattleIcon* const thisPtr, class mHRChara* arg2, uint8_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x4ce4b0);
		return mFunc(this, arg2, arg3);
	}
	/// Struct member variables

	// <class HrTask field_0, offset 0x0>
	// class HrTask Super;

	// <class NYApproachToTargetVal m_HPVal, offset 0x50>
	class NYApproachToTargetVal m_HPVal;

	// <float m_damagedCounter, offset 0x5c>
	float m_damagedCounter;

	// <enum HrBattleIcon::D_BICON_STAT m_IconStat, offset 0x60>
	enum HrBattleIcon::D_BICON_STAT m_IconStat;

	// <enum HrBattleIcon::D_BICON_STAT m_YoyakuIcon, offset 0x64>
	enum HrBattleIcon::D_BICON_STAT m_YoyakuIcon;

	// <float m_LockOnDist, offset 0x68>
	float m_LockOnDist;

	// <float m_LockOnCircleSize, offset 0x6c>
	float m_LockOnCircleSize;

	// <float m_BIcon_Block_Size, offset 0x70>
	float m_BIcon_Block_Size;

	// <uint8_t m_blockcolor[0x3], offset 0x74>
	uint8_t m_blockcolor[3];

	// <uint8_t m_ColorType, offset 0x77>
	uint8_t m_ColorType;

	// <enum m_ConActID[0x2], offset 0x78>
	uint32_t m_ConActID[2];

	// <int16_t m_ConActCount[0x2], offset 0x80>
	int16_t m_ConActCount[2];

	// <int16_t m_Counter, offset 0x84>
	int16_t m_Counter;

	// <int16_t m_DelCounter, offset 0x86>
	int16_t m_DelCounter;

	// <uint32_t m_Rotate_AnimCnt, offset 0x88>
	uint32_t m_Rotate_AnimCnt;

	// <struct Vec m_TmpJstVec, offset 0x8c>
	struct Vec m_TmpJstVec;

	// <int16_t m_PyokoCnt, offset 0x98>
	int16_t m_PyokoCnt;

	// <int16_t m_PyokoFlag, offset 0x9a>
	int16_t m_PyokoFlag;

	// <float m_PyokoRatio, offset 0x9c>
	float m_PyokoRatio;

	// <uint8_t m_PyokoAlpha, offset 0xa0>
	uint8_t m_PyokoAlpha;

	// <uint8_t m_DrawHitCmbFlag, offset 0xa1>
	uint8_t m_DrawHitCmbFlag;

	// <Unidentified data segment, offset 0xa2>
private:
	char _UnidentifiedData21[2];

public:
	// <float m_TsubaRatio[0x24], offset 0xa4>
	float m_TsubaRatio[36];

	// <struct Vec* m_pPosition[0x2], offset 0x134>
	struct Vec* m_pPosition[2];

	// <class mHRChara* m_pTargetChara, offset 0x13c>
	class mHRChara* m_pTargetChara;

	// <int16_t m_HpBerCounter, offset 0x140>
	int16_t m_HpBerCounter;

	// <int16_t m_LineCounter, offset 0x142>
	int16_t m_LineCounter;

	// <char m_MeterCounter, offset 0x144>
	char m_MeterCounter;

	// <Unidentified data segment, offset 0x145>
private:
	char _UnidentifiedData27[3];

public:
	// <float m_Tension[0x2], offset 0x148>
	float m_Tension[2];

	// <float m_TMeterRevPos[0x2], offset 0x150>
	float m_TMeterRevPos[2];

	// <int16_t m_GetMoney[0x2], offset 0x158>
	int16_t m_GetMoney[2];

	// <int16_t m_HitNum[0x2], offset 0x15c>
	int16_t m_HitNum[2];

	// <float m_HP[0x3], offset 0x160>
	float m_HP[3];

	// <int16_t m_SlashFadeCounter, offset 0x16c>
	int16_t m_SlashFadeCounter;

	// <int16_t m_BottanCounter[0x4], offset 0x16e>
	int16_t m_BottanCounter[4];

	// <int16_t m_TergetIconCount, offset 0x176>
	int16_t m_TergetIconCount;

	// <enum HrBattleIcon::D_TODOME_DIRECT m_Direct, offset 0x178>
	enum HrBattleIcon::D_TODOME_DIRECT m_Direct;

	// <int32_t m_Angle, offset 0x17c>
	int32_t m_Angle;

	// <int32_t m_Soundid, offset 0x180>
	int32_t m_Soundid;

	// <uint16_t flag, offset 0x184>
	uint16_t flag;

	// <uint8_t m_bDemo, offset 0x186>
	uint8_t m_bDemo;

	// <Unidentified data segment, offset 0x187>
private:
	char _UnidentifiedData40[1];

public:
	// <class HrBattleIcon::CHrHpGauge m_HpGauge, offset 0x188>
	class HrBattleIcon::CHrHpGauge m_HpGauge;

	// <int32_t m_SlashSEStatus, offset 0x1fc>
	int32_t m_SlashSEStatus;

	std::string ToString() const { return "class HrBattleIcon(" + std::to_string(GetPtrAddr()) + ")"; }
	int GetPtrAddr() const { return (int)this; }
#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.deriveClass<HrBattleIcon, HrTask>("HrBattleIcon")
			.addFunction("__tostring", &HrBattleIcon::ToString)
			.addFunction("GetPtrAddr", &HrBattleIcon::GetPtrAddr)
			.addProperty("m_HPVal", &HrBattleIcon::m_HPVal)
			.addProperty("m_damagedCounter", &HrBattleIcon::m_damagedCounter)
			.addProperty("m_IconStat", &HrBattleIcon::m_IconStat)
			.addProperty("m_YoyakuIcon", &HrBattleIcon::m_YoyakuIcon)
			.addProperty("m_LockOnDist", &HrBattleIcon::m_LockOnDist)
			.addProperty("m_LockOnCircleSize", &HrBattleIcon::m_LockOnCircleSize)
			.addProperty("m_BIcon_Block_Size", &HrBattleIcon::m_BIcon_Block_Size)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_blockcolor", &HrBattleIcon::m_blockcolor)
			.addProperty("m_ColorType", &HrBattleIcon::m_ColorType)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_ConActID", &HrBattleIcon::m_ConActID)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_ConActCount", &HrBattleIcon::m_ConActCount)
			.addProperty("m_Counter", &HrBattleIcon::m_Counter)
			.addProperty("m_DelCounter", &HrBattleIcon::m_DelCounter)
			.addProperty("m_Rotate_AnimCnt", &HrBattleIcon::m_Rotate_AnimCnt)
			.addProperty("m_TmpJstVec", &HrBattleIcon::m_TmpJstVec)
			.addProperty("m_PyokoCnt", &HrBattleIcon::m_PyokoCnt)
			.addProperty("m_PyokoFlag", &HrBattleIcon::m_PyokoFlag)
			.addProperty("m_PyokoRatio", &HrBattleIcon::m_PyokoRatio)
			.addProperty("m_PyokoAlpha", &HrBattleIcon::m_PyokoAlpha)
			.addProperty("m_DrawHitCmbFlag", &HrBattleIcon::m_DrawHitCmbFlag)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_TsubaRatio", &HrBattleIcon::m_TsubaRatio)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_pPosition", &HrBattleIcon::m_pPosition)
			.addProperty("m_pTargetChara", &HrBattleIcon::m_pTargetChara)
			.addProperty("m_HpBerCounter", &HrBattleIcon::m_HpBerCounter)
			.addProperty("m_LineCounter", &HrBattleIcon::m_LineCounter)
			.addProperty("m_MeterCounter", &HrBattleIcon::m_MeterCounter)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_Tension", &HrBattleIcon::m_Tension)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_TMeterRevPos", &HrBattleIcon::m_TMeterRevPos)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_GetMoney", &HrBattleIcon::m_GetMoney)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_HitNum", &HrBattleIcon::m_HitNum)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_HP", &HrBattleIcon::m_HP)
			.addProperty("m_SlashFadeCounter", &HrBattleIcon::m_SlashFadeCounter)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_BottanCounter", &HrBattleIcon::m_BottanCounter)
			.addProperty("m_TergetIconCount", &HrBattleIcon::m_TergetIconCount)
			.addProperty("m_Direct", &HrBattleIcon::m_Direct)
			.addProperty("m_Angle", &HrBattleIcon::m_Angle)
			.addProperty("m_Soundid", &HrBattleIcon::m_Soundid)
			.addProperty("flag", &HrBattleIcon::flag)
			.addProperty("m_bDemo", &HrBattleIcon::m_bDemo)
			.addProperty("m_HpGauge", &HrBattleIcon::m_HpGauge)
			.addProperty("m_SlashSEStatus", &HrBattleIcon::m_SlashSEStatus)
			.addFunction("OnCharacterTerminate", &HrBattleIcon::OnCharacterTerminate)
			.addFunction("Initialize", &HrBattleIcon::Initialize)
		.endClass();
	}
#endif
};
static_assert(sizeof(HrBattleIcon::m_HPVal) == 12, "expected m_HPVal to be size 12");
static_assert(sizeof(HrBattleIcon::m_damagedCounter) == 4, "expected m_damagedCounter to be size 4");
static_assert(sizeof(HrBattleIcon::m_IconStat) == 4, "expected m_IconStat to be size 4");
static_assert(sizeof(HrBattleIcon::m_YoyakuIcon) == 4, "expected m_YoyakuIcon to be size 4");
static_assert(sizeof(HrBattleIcon::m_LockOnDist) == 4, "expected m_LockOnDist to be size 4");
static_assert(sizeof(HrBattleIcon::m_LockOnCircleSize) == 4, "expected m_LockOnCircleSize to be size 4");
static_assert(sizeof(HrBattleIcon::m_BIcon_Block_Size) == 4, "expected m_BIcon_Block_Size to be size 4");
static_assert(sizeof(HrBattleIcon::m_blockcolor) == 3, "expected m_blockcolor to be size 3");
static_assert(sizeof(HrBattleIcon::m_ColorType) == 1, "expected m_ColorType to be size 1");
static_assert(sizeof(HrBattleIcon::m_ConActID) == 8, "expected m_ConActID to be size 8");
static_assert(sizeof(HrBattleIcon::m_ConActCount) == 4, "expected m_ConActCount to be size 4");
static_assert(sizeof(HrBattleIcon::m_Counter) == 2, "expected m_Counter to be size 2");
static_assert(sizeof(HrBattleIcon::m_DelCounter) == 2, "expected m_DelCounter to be size 2");
static_assert(sizeof(HrBattleIcon::m_Rotate_AnimCnt) == 4, "expected m_Rotate_AnimCnt to be size 4");
static_assert(sizeof(HrBattleIcon::m_TmpJstVec) == 12, "expected m_TmpJstVec to be size 12");
static_assert(sizeof(HrBattleIcon::m_PyokoCnt) == 2, "expected m_PyokoCnt to be size 2");
static_assert(sizeof(HrBattleIcon::m_PyokoFlag) == 2, "expected m_PyokoFlag to be size 2");
static_assert(sizeof(HrBattleIcon::m_PyokoRatio) == 4, "expected m_PyokoRatio to be size 4");
static_assert(sizeof(HrBattleIcon::m_PyokoAlpha) == 1, "expected m_PyokoAlpha to be size 1");
static_assert(sizeof(HrBattleIcon::m_DrawHitCmbFlag) == 1, "expected m_DrawHitCmbFlag to be size 1");
static_assert(sizeof(HrBattleIcon::m_TsubaRatio) == 144, "expected m_TsubaRatio to be size 144");
static_assert(sizeof(HrBattleIcon::m_pPosition) == 8, "expected m_pPosition to be size 8");
static_assert(sizeof(HrBattleIcon::m_pTargetChara) == 4, "expected m_pTargetChara to be size 4");
static_assert(sizeof(HrBattleIcon::m_HpBerCounter) == 2, "expected m_HpBerCounter to be size 2");
static_assert(sizeof(HrBattleIcon::m_LineCounter) == 2, "expected m_LineCounter to be size 2");
static_assert(sizeof(HrBattleIcon::m_MeterCounter) == 1, "expected m_MeterCounter to be size 1");
static_assert(sizeof(HrBattleIcon::m_Tension) == 8, "expected m_Tension to be size 8");
static_assert(sizeof(HrBattleIcon::m_TMeterRevPos) == 8, "expected m_TMeterRevPos to be size 8");
static_assert(sizeof(HrBattleIcon::m_GetMoney) == 4, "expected m_GetMoney to be size 4");
static_assert(sizeof(HrBattleIcon::m_HitNum) == 4, "expected m_HitNum to be size 4");
static_assert(sizeof(HrBattleIcon::m_HP) == 12, "expected m_HP to be size 12");
static_assert(sizeof(HrBattleIcon::m_SlashFadeCounter) == 2, "expected m_SlashFadeCounter to be size 2");
static_assert(sizeof(HrBattleIcon::m_BottanCounter) == 8, "expected m_BottanCounter to be size 8");
static_assert(sizeof(HrBattleIcon::m_TergetIconCount) == 2, "expected m_TergetIconCount to be size 2");
static_assert(sizeof(HrBattleIcon::m_Direct) == 4, "expected m_Direct to be size 4");
static_assert(sizeof(HrBattleIcon::m_Angle) == 4, "expected m_Angle to be size 4");
static_assert(sizeof(HrBattleIcon::m_Soundid) == 4, "expected m_Soundid to be size 4");
static_assert(sizeof(HrBattleIcon::flag) == 2, "expected flag to be size 2");
static_assert(sizeof(HrBattleIcon::m_bDemo) == 1, "expected m_bDemo to be size 1");
static_assert(sizeof(HrBattleIcon::m_HpGauge) == 116, "expected m_HpGauge to be size 116");
static_assert(sizeof(HrBattleIcon::m_SlashSEStatus) == 4, "expected m_SlashSEStatus to be size 4");
static_assert(sizeof(HrBattleIcon) == 512, "expected class HrBattleIcon to be size 512");

// [Structure] class mHRChara
/// <summary>
/// Base character (Travis, enemies, etc)
/// </summary>
class mHRChara : public ghmListObj
{
public:
	// [Function] enum enCharaType __convention("thiscall") mHRChara::mGetCharaType(class mHRChara* const this) [?mGetCharaType@mHRChara@@QBE?AW4enCharaType@@XZ]
	enum enCharaType mGetCharaType()
	{
		typedef enum enCharaType(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x9f060);
		return mFunc(this);
	}
	// [Function] uint8_t mHRChara::isCharacterTypeZako(enum enCharaType arg1) [?isCharacterTypeZako@mHRChara@@SA_NW4enCharaType@@@Z]
	static uint8_t isCharacterTypeZako(enum enCharaType arg1)
	{
		typedef uint8_t(__fastcall* _Func)(enum enCharaType arg1);
		_Func mFunc = (_Func)(GameModule + 0xa2c60);
		return mFunc(arg1);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestZako(class mHRChara* const this) [?mTestZako@mHRChara@@QBE_NXZ]
	uint8_t mTestZako()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2c70);
		return mFunc(this);
	}
	// [Function] uint8_t mHRChara::isCharacterTypeBoss(enum enCharaType arg1) [?isCharacterTypeBoss@mHRChara@@SA_NW4enCharaType@@@Z]
	static uint8_t isCharacterTypeBoss(enum enCharaType arg1)
	{
		typedef uint8_t(__fastcall* _Func)(enum enCharaType arg1);
		_Func mFunc = (_Func)(GameModule + 0xa2c80);
		return mFunc(arg1);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestBoss(class mHRChara* const this) [?mTestBoss@mHRChara@@QBE_NXZ]
	uint8_t mTestBoss()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2c90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestEnemy(class mHRChara* const this) [?mTestEnemy@mHRChara@@QBE_NXZ]
	uint8_t mTestEnemy()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2ca0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetItemNo(class mHRChara* const this, int32_t arg2) [?mSetItemNo@mHRChara@@QAEXH@Z]
	void mSetItemNo(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2cc0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetLockOnNoCheckColl(class mHRChara* const this, uint8_t arg2) [?mSetLockOnNoCheckColl@mHRChara@@QAEX_N@Z]
	void mSetLockOnNoCheckColl(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2cd0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetLockOnDistanceLow(class mHRChara* const this, float arg2) [?mSetLockOnDistanceLow@mHRChara@@QAEXM@Z]
	void mSetLockOnDistanceLow(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2ce0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetLockOnDistanceHi(class mHRChara* const this, float arg2) [?mSetLockOnDistanceHi@mHRChara@@QAEXM@Z]
	void mSetLockOnDistanceHi(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2cf0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetLockOnDistance(class mHRChara* const this, float arg2) [?mSetLockOnDistance@mHRChara@@QAEXM@Z]
	void mSetLockOnDistance(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2d00);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetCanLockOn(class mHRChara* const this, uint8_t arg2) [?mSetCanLockOn@mHRChara@@QAEX_N@Z]
	void mSetCanLockOn(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2d10);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDisableDameged(class mHRChara* const this, uint8_t arg2) [?mSetDisableDameged@mHRChara@@QAEX_N@Z]
	void mSetDisableDameged(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2d30);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetDisableDameged(class mHRChara* const this) [?mGetDisableDameged@mHRChara@@QAE_NXZ]
	uint8_t mGetDisableDameged()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2d50);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetMaxHp(class mHRChara* const this) [?mGetMaxHp@mHRChara@@QAEMXZ]
	float mGetMaxHp()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2d60);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mUndispTgtIcn(class mHRChara* const this) [?mUndispTgtIcn@mHRChara@@QAE_NXZ]
	uint8_t mUndispTgtIcn()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2d70);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mDispTgtIcn(class mHRChara* const this) [?mDispTgtIcn@mHRChara@@QAE_NXZ]
	uint8_t mDispTgtIcn()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2df0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetHp(class mHRChara* const this) [?mGetHp@mHRChara@@QAEMXZ]
	float mGetHp()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2e30);
		return mFunc(this);
	}
	// [Function] enum enCharaCondition __convention("thiscall") mHRChara::mGetCondition(class mHRChara* const this) [?mGetCondition@mHRChara@@QBE?AW4enCharaCondition@@XZ]
	enum enCharaCondition mGetCondition()
	{
		typedef enum enCharaCondition(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2fd0);
		return mFunc(this);
	}
	// [Function] class mHRChara* __convention("thiscall") mHRChara::mGetNext(class mHRChara* const this) [?mGetNext@mHRChara@@QAEPAV1@XZ]
	class mHRChara* mGetNext()
	{
		typedef class mHRChara*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa2fe0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetHp(class mHRChara* const this, float arg2) [?mSetHp@mHRChara@@QAEXM@Z]
	void mSetHp(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa2ff0);
		return mFunc(this, arg2);
	}
	// [Function] class mHRChara* mHRChara::mGetTop() [?mGetTop@mHRChara@@SAPAV1@XZ]
	static class mHRChara* mGetTop()
	{
		typedef class mHRChara*(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0xa3020);
		return mFunc();
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetRot(class mHRChara* const this) [?mGetRot@mHRChara@@QAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetRot()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3030);
		mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetCharaPause(class mHRChara* const this, uint8_t arg2) [?mSetCharaPause@mHRChara@@QAEX_N@Z]
	void mSetCharaPause(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa3150);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetRotY(class mHRChara* const this) [?mGetRotY@mHRChara@@QAEMXZ]
	float mGetRotY()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3180);
		return mFunc(this);
	}
	// [Function] struct WGclMaterialSpec* __convention("thiscall") mHRChara::GetGroundTouchMaterial(class mHRChara* const this) [?GetGroundTouchMaterial@mHRChara@@QBEPAUWGclMaterialSpec@@XZ]
	struct WGclMaterialSpec* GetGroundTouchMaterial()
	{
		typedef struct WGclMaterialSpec*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3190);
		return mFunc(this);
	}
	// [Function] struct stCharaStatus* __convention("thiscall") mHRChara::mGetStatusPtr(class mHRChara* const this) [?mGetStatusPtr@mHRChara@@QAEPAUstCharaStatus@@XZ]
	struct stCharaStatus* mGetStatusPtr()
	{
		typedef struct stCharaStatus*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3260);
		return mFunc(this);
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetPos(class mHRChara* const this) [?mGetPos@mHRChara@@QAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetPos()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3280);
		mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetMotionNo(class mHRChara* const this) [?mGetMotionNo@mHRChara@@QBEHXZ]
	int32_t mGetMotionNo()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3290);
		return mFunc(this);
	}
	// [Function] char* __convention("thiscall") mHRChara::mGetFileName(class mHRChara* const this) [?mGetFileName@mHRChara@@QAEPADXZ]
	// Can't export pointer to native type 'char*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetFileName()
	{
		typedef char*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa3ac0);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsTubaAngleCorrect(class mHRChara* const this) [?IsTubaAngleCorrect@mHRChara@@UAE_NXZ]
	uint8_t IsTubaAngleCorrect()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa48f0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::getMiraretaiPosition(class mHRChara* const this, struct Vec* arg2) [?getMiraretaiPosition@mHRChara@@UBE_NPAUVec@@@Z]
	uint8_t getMiraretaiPosition(struct Vec* arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec* arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4900);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::isHopeInterestMe(class mHRChara* const this) [?isHopeInterestMe@mHRChara@@UBE_NXZ]
	uint8_t isHopeInterestMe()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4910);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsWatchPc(class mHRChara* const this) [?IsWatchPc@mHRChara@@UAE_NXZ]
	uint8_t IsWatchPc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4920);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsUseRotMov(class mHRChara* const this) [?IsUseRotMov@mHRChara@@UAE_NXZ]
	uint8_t IsUseRotMov()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4930);
		return mFunc(this);
	}
	// [Function] char const* __convention("thiscall") mHRChara::getCurMotionName(class mHRChara* const this) [?getCurMotionName@mHRChara@@UBEPBDXZ]
	// Can't export pointer to native type 'char const*' [TypeClass.PointerTypeClass] in LuaBridge
	void getCurMotionName()
	{
		typedef char const*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4940);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestRunMotion(class mHRChara* const this) [?mTestRunMotion@mHRChara@@UAE_NXZ]
	uint8_t mTestRunMotion()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4970);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mZakoDieOut(class mHRChara* const this) [?mZakoDieOut@mHRChara@@UAE_NXZ]
	uint8_t mZakoDieOut()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4980);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCreateLoseSight(class mHRChara* const this) [?mCreateLoseSight@mHRChara@@UAE_NXZ]
	uint8_t mCreateLoseSight()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4990);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckDamageMotion(class mHRChara* const this) [?mCheckDamageMotion@mHRChara@@UAE_NXZ]
	uint8_t mCheckDamageMotion()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa49a0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckEnterMotion(class mHRChara* const this) [?mCheckEnterMotion@mHRChara@@UAE_NXZ]
	uint8_t mCheckEnterMotion()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa49b0);
		return mFunc(this);
	}
	// [Function] class TGan* __convention("thiscall") mHRChara::mpGetGan(class mHRChara* const this, int32_t arg2) [?mpGetGan@mHRChara@@UBEPBVTGan@@H@Z]
	class TGan* mpGetGan(int32_t arg2)
	{
		typedef class TGan*(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa49c0);
		return mFunc(this, arg2);
	}
	// [Function] class TGmf* __convention("thiscall") mHRChara::mGetCurResourceGmfPtr(class mHRChara* const this) [?mGetCurResourceGmfPtr@mHRChara@@UAEPAVTGmf@@XZ]
	class TGmf* mGetCurResourceGmfPtr()
	{
		typedef class TGmf*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa49d0);
		return mFunc(this);
	}
	// [Function] class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfWepLPtr(class mHRChara* const this) [?mGetResourceGmfWepLPtr@mHRChara@@UAEPAVTGmf@@XZ]
	class TGmf* mGetResourceGmfWepLPtr()
	{
		typedef class TGmf*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4a00);
		return mFunc(this);
	}
	// [Function] class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfWepRPtr(class mHRChara* const this) [?mGetResourceGmfWepRPtr@mHRChara@@UAEPAVTGmf@@XZ]
	class TGmf* mGetResourceGmfWepRPtr()
	{
		typedef class TGmf*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4a10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetResourceGmfPtr(class mHRChara* const this, class TGmf* arg2, char* arg3) [?mSetResourceGmfPtr@mHRChara@@UAEXPAVTGmf@@PAD@Z]
	void mSetResourceGmfPtr(class TGmf* arg2, char* arg3)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class TGmf* arg2, char* arg3);
		_Func mFunc = (_Func)(GameModule + 0xa4a20);
		return mFunc(this, arg2, arg3);
	}
	// [Function] class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfDeadPtr(class mHRChara* const this) [?mGetResourceGmfDeadPtr@mHRChara@@UBEPBVTGmf@@XZ]
	class TGmf* mGetResourceGmfDeadPtr()
	{
		typedef class TGmf*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4a60);
		return mFunc(this);
	}
	// [Function] class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfPtr(class mHRChara* const this) [?mGetResourceGmfPtr@mHRChara@@UBEPBVTGmf@@XZ]
	class TGmf* mGetResourceGmfPtr()
	{
		typedef class TGmf*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4a80);
		return mFunc(this);
	}
	// [Function] class ghmGcCollObjCapsule* __convention("thiscall") mHRChara::mGetCollPtr(class mHRChara* const this) [?mGetCollPtr@mHRChara@@UAEPAVghmGcCollObjCapsule@@XZ]
	class ghmGcCollObjCapsule* mGetCollPtr()
	{
		typedef class ghmGcCollObjCapsule*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4aa0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSethitOidashiDisEnable(class mHRChara* const this, uint8_t arg2) [?mSethitOidashiDisEnable@mHRChara@@UAEX_N@Z]
	void mSethitOidashiDisEnable(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4ab0);
		return mFunc(this, arg2);
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetBrainPos(class mHRChara* const this) [?mGetBrainPos@mHRChara@@UAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetBrainPos()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4ae0);
		mFunc(this);
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetHitPos(class mHRChara* const this) [?mGetHitPos@mHRChara@@UAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetHitPos()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4af0);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetMirrorModel(class mHRChara* const this) [?mGetMirrorModel@mHRChara@@UAE_NXZ]
	uint8_t mGetMirrorModel()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4b00);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetVisibleDist(class mHRChara* const this) [?mGetVisibleDist@mHRChara@@UAE_NXZ]
	uint8_t mGetVisibleDist()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4b10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetCondition(class mHRChara* const this, enum enCharaCondition arg2) [?mSetCondition@mHRChara@@UAEXW4enCharaCondition@@@Z]
	void mSetCondition(enum enCharaCondition arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, enum enCharaCondition arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4b20);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetSubMotionSpd(class mHRChara* const this, float arg2) [?mSetSubMotionSpd@mHRChara@@UAEXM@Z]
	void mSetSubMotionSpd(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4b30);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheck4tsunbai(class mHRChara* const this) [?mCheck4tsunbai@mHRChara@@UAE_NXZ]
	uint8_t mCheck4tsunbai()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4b50);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckSquat(class mHRChara* const this) [?mCheckSquat@mHRChara@@UAE_NXZ]
	uint8_t mCheckSquat()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4b60);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mGetThrowMotNo(class mHRChara* const this, int32_t* arg2, int32_t* arg3) [?mGetThrowMotNo@mHRChara@@UAEXPAH0@Z]
	void mGetThrowMotNo(int32_t* arg2, int32_t* arg3)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t* arg2, int32_t* arg3);
		_Func mFunc = (_Func)(GameModule + 0xa4b70);
		return mFunc(this, arg2, arg3);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetTsubazeriMotionID(class mHRChara* const this) [?mGetTsubazeriMotionID@mHRChara@@UAEHXZ]
	int32_t mGetTsubazeriMotionID()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4b90);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mTsubazeriDifficultyClear(class mHRChara* const this) [?mTsubazeriDifficultyClear@mHRChara@@UAEXXZ]
	void mTsubazeriDifficultyClear()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4ba0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mTsubazeriDifficultyUp(class mHRChara* const this) [?mTsubazeriDifficultyUp@mHRChara@@UAEXXZ]
	void mTsubazeriDifficultyUp()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4bb0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsTubaPosAdjust(class mHRChara* const this) [?IsTubaPosAdjust@mHRChara@@UAE_NXZ]
	uint8_t IsTubaPosAdjust()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4bc0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckGuard(class mHRChara* const this) [?mCheckGuard@mHRChara@@UAE_NXZ]
	uint8_t mCheckGuard()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4bd0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckAttack(class mHRChara* const this) [?mCheckAttack@mHRChara@@UBE_NXZ]
	uint8_t mCheckAttack()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4be0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSubTension(class mHRChara* const this, float arg2) [?mSubTension@mHRChara@@UAEXM@Z]
	void mSubTension(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4bf0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mAddTension(class mHRChara* const this, float arg2) [?mAddTension@mHRChara@@UAEXM@Z]
	void mAddTension(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4c30);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetTension(class mHRChara* const this, float arg2) [?mSetTension@mHRChara@@UAEXM@Z]
	void mSetTension(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4c70);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mResetTension(class mHRChara* const this) [?mResetTension@mHRChara@@UAEXXZ]
	void mResetTension()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4cb0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMovSpd(class mHRChara* const this, float arg2) [?mSetMovSpd@mHRChara@@UAEXM@Z]
	void mSetMovSpd(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4cc0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::UnderControllAttack_A(class mHRChara* const this) [?UnderControllAttack_A@mHRChara@@UAE_NXZ]
	uint8_t UnderControllAttack_A()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4ce0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::UnderControllComboAttack(class mHRChara* const this) [?UnderControllComboAttack@mHRChara@@UAE_NXZ]
	uint8_t UnderControllComboAttack()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4cf0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::ExitUnderControl(class mHRChara* const this) [?ExitUnderControl@mHRChara@@UAEXXZ]
	void ExitUnderControl()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::EnterUnderControl(class mHRChara* const this) [?EnterUnderControl@mHRChara@@UAEXXZ]
	void EnterUnderControl()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d10);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPostRenderProc(class mHRChara* const this) [?mPostRenderProc@mHRChara@@UAE_NXZ]
	uint8_t mPostRenderProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d20);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::getViewClipBoxPositionOffsetY(class mHRChara* const this) [?getViewClipBoxPositionOffsetY@mHRChara@@MBEMXZ]
	float getViewClipBoxPositionOffsetY()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d30);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::getViewClipBoxHalfLengthXYZ(class mHRChara* const this, struct Vec* arg2) [?getViewClipBoxHalfLengthXYZ@mHRChara@@MBEXPAUVec@@@Z]
	void getViewClipBoxHalfLengthXYZ(struct Vec* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec* arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4d40);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetResNo(class mHRChara* const this) [?mGetResNo@mHRChara@@QBEHXZ]
	int32_t mGetResNo()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d60);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetDropMoney(class mHRChara* const this) [?mGetDropMoney@mHRChara@@QBEHXZ]
	int32_t mGetDropMoney()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d70);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetItemNo(class mHRChara* const this) [?mGetItemNo@mHRChara@@QBEHXZ]
	int32_t mGetItemNo()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4d80);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::setLocatorNode(class mHRChara* const this, class TGmfNode* arg2) [?setLocatorNode@mHRChara@@UAEXPBVTGmfNode@@@Z]
	void setLocatorNode(class TGmfNode* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class TGmfNode* arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4da0);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetHpRate(class mHRChara* const this) [?mGetHpRate@mHRChara@@QBEMXZ]
	float mGetHpRate()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4f00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSubHp(class mHRChara* const this, float arg2) [?mSubHp@mHRChara@@QAEXM@Z]
	void mSubHp(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa4f10);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetHitSize(class mHRChara* const this) [?mGetHitSize@mHRChara@@QAEMXZ]
	float mGetHitSize()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4f60);
		return mFunc(this);
	}
	// [Function] enum enCharaInitProc __convention("thiscall") mHRChara::mGetInitProc(class mHRChara* const this) [?mGetInitProc@mHRChara@@QAE?AW4enCharaInitProc@@XZ]
	enum enCharaInitProc mGetInitProc()
	{
		typedef enum enCharaInitProc(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4f70);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::isCrashBreak(class mHRChara* const this) [?isCrashBreak@mHRChara@@UBE_NXZ]
	uint8_t isCrashBreak()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa4fd0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetCharaHit(class mHRChara* const this, uint8_t arg2) [?mSetCharaHit@mHRChara@@QAEX_N@Z]
	void mSetCharaHit(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5120);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetDmgAtkMot(class mHRChara* const this) [?mGetDmgAtkMot@mHRChara@@QAEHXZ]
	int32_t mGetDmgAtkMot()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5a80);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMotionProcessDisEnable(class mHRChara* const this, uint8_t arg2) [?mSetMotionProcessDisEnable@mHRChara@@QAEX_N@Z]
	void mSetMotionProcessDisEnable(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5a90);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetMotionSpd(class mHRChara* const this) [?mGetMotionSpd@mHRChara@@QAEMXZ]
	float mGetMotionSpd()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5ae0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetStageHitDisEnable(class mHRChara* const this, uint8_t arg2) [?mSetStageHitDisEnable@mHRChara@@QAEX_N@Z]
	void mSetStageHitDisEnable(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5af0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsFootShadowDraw(class mHRChara* const this) [?IsFootShadowDraw@mHRChara@@QBE_NXZ]
	uint8_t IsFootShadowDraw()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5b30);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::SetFootShadowDraw(class mHRChara* const this, uint8_t arg2) [?SetFootShadowDraw@mHRChara@@QAEX_N@Z]
	void SetFootShadowDraw(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5b40);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMotionNoNpc(class mHRChara* const this, int32_t arg2) [?mSetMotionNoNpc@mHRChara@@QAEXH@Z]
	void mSetMotionNoNpc(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5b50);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetCallScriptProc(class mHRChara* const this, char* arg2) [?mSetCallScriptProc@mHRChara@@QAEXPAD@Z]
	void mSetCallScriptProc(char* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, char* arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5b60);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDropMoney(class mHRChara* const this, int32_t arg2) [?mSetDropMoney@mHRChara@@QAEXH@Z]
	void mSetDropMoney(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5b70);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetReactionDist(class mHRChara* const this, float arg2) [?mSetReactionDist@mHRChara@@QAEXM@Z]
	void mSetReactionDist(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5b80);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetEnterPattern(class mHRChara* const this, int32_t arg2) [?mSetEnterPattern@mHRChara@@QAEXH@Z]
	void mSetEnterPattern(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5b90);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDatNo(class mHRChara* const this, int32_t arg2) [?mSetDatNo@mHRChara@@QAEXH@Z]
	void mSetDatNo(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5ba0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetResNo(class mHRChara* const this, int32_t arg2) [?mSetResNo@mHRChara@@QAEXH@Z]
	void mSetResNo(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5bb0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetCharaType(class mHRChara* const this, enum enCharaType arg2) [?mSetCharaType@mHRChara@@QAEXW4enCharaType@@@Z]
	void mSetCharaType(enum enCharaType arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, enum enCharaType arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5bc0);
		return mFunc(this, arg2);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetDatNo(class mHRChara* const this) [?mGetDatNo@mHRChara@@QBEHXZ]
	int32_t mGetDatNo()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5bd0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetResourceDeleteFlag(class mHRChara* const this) [?mGetResourceDeleteFlag@mHRChara@@QAE_NXZ]
	uint8_t mGetResourceDeleteFlag()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5be0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetDmgUpperPosY(class mHRChara* const this) [?mGetDmgUpperPosY@mHRChara@@QAEMXZ]
	float mGetDmgUpperPosY()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5c00);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetDmgUpper(class mHRChara* const this) [?mGetDmgUpper@mHRChara@@QAE_NXZ]
	uint8_t mGetDmgUpper()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa5c10);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetResourceDeleteFlag(class mHRChara* const this, uint8_t arg2) [?mSetResourceDeleteFlag@mHRChara@@QAEX_N@Z]
	void mSetResourceDeleteFlag(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa5c50);
		return mFunc(this, arg2);
	}
	// [Function] class ghmPlane& __convention("thiscall") mHRChara::getLatestGroundTouchPlane(class mHRChara* const this) [?getLatestGroundTouchPlane@mHRChara@@QBEABVghmPlane@@XZ]
	// Can't export & pointer 'class ghmPlane&' [TypeClass.PointerTypeClass] in LuaBridge
	void getLatestGroundTouchPlane()
	{
		typedef class ghmPlane&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa89d0);
		mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mUndispBtlIcn(class mHRChara* const this) [?mUndispBtlIcn@mHRChara@@QAEXXZ]
	void mUndispBtlIcn()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa94a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mChgBtlIcnFinishDemo(class mHRChara* const this, enum HrBattleIcon::E_CON_ACT_ID arg2, enum HrBattleIcon::E_CON_ACT_ID arg3, uint8_t arg4) [?mChgBtlIcnFinishDemo@mHRChara@@QAEXW4E_CON_ACT_ID@HrBattleIcon@@0_N@Z]
	void mChgBtlIcnFinishDemo(enum HrBattleIcon::E_CON_ACT_ID arg2, enum HrBattleIcon::E_CON_ACT_ID arg3, uint8_t arg4)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, enum HrBattleIcon::E_CON_ACT_ID arg2, enum HrBattleIcon::E_CON_ACT_ID arg3, uint8_t arg4);
		_Func mFunc = (_Func)(GameModule + 0xa94d0);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRChara::mChgBtlIcnTb(class mHRChara* const this) [?mChgBtlIcnTb@mHRChara@@QAEXXZ]
	void mChgBtlIcnTb()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa9510);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::SetDrawYAdjust(class mHRChara* const this, float arg2) [?SetDrawYAdjust@mHRChara@@QAEXM@Z]
	void SetDrawYAdjust(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xa9af0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDemoCtrl(class mHRChara* const this, uint8_t arg2) [?mSetDemoCtrl@mHRChara@@QAEX_N@Z]
	void mSetDemoCtrl(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xa9b10);
		return mFunc(this, arg2);
	}
	// [Function] uint64_t __convention("thiscall") mHRChara::mGetDemoCtrl(class mHRChara* const this) [?mGetDemoCtrl@mHRChara@@QAE_KXZ]
	uint64_t mGetDemoCtrl()
	{
		typedef uint64_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xa9b90);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::isAcceptDistanceDelete(class mHRChara* const this) [?isAcceptDistanceDelete@mHRChara@@UAE_NXZ]
	uint8_t isAcceptDistanceDelete()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xab940);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetStageHitDisEnableReq(class mHRChara* const this, uint8_t arg2) [?mSetStageHitDisEnableReq@mHRChara@@QAEX_N@Z]
	void mSetStageHitDisEnableReq(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xab950);
		return mFunc(this, arg2);
	}
	// [Function] struct stCharaEffect* __convention("thiscall") mHRChara::mGetEffectStPtr(class mHRChara* const this) [?mGetEffectStPtr@mHRChara@@QAEPAUstCharaEffect@@XZ]
	struct stCharaEffect* mGetEffectStPtr()
	{
		typedef struct stCharaEffect*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xab960);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::setBlackBodyEffect(class mHRChara* const this, class EffectEnemyDamage* arg2) [?setBlackBodyEffect@mHRChara@@QAEXPAVEffectEnemyDamage@@@Z]
	void setBlackBodyEffect(class EffectEnemyDamage* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class EffectEnemyDamage* arg2);
		_Func mFunc = (_Func)(GameModule + 0xab970);
		return mFunc(this, arg2);
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetNavelPos(class mHRChara* const this) [?mGetNavelPos@mHRChara@@UAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetNavelPos()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xab980);
		mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDamageAcceptFrame(class mHRChara* const this, int32_t arg2) [?mSetDamageAcceptFrame@mHRChara@@QAEXH@Z]
	void mSetDamageAcceptFrame(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xab990);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetAlwaysCheckHitColl(class mHRChara* const this, uint8_t arg2) [?mSetAlwaysCheckHitColl@mHRChara@@QAEX_N@Z]
	void mSetAlwaysCheckHitColl(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xab9a0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetLockOnNoCheckColl(class mHRChara* const this) [?mGetLockOnNoCheckColl@mHRChara@@QAE_NXZ]
	uint8_t mGetLockOnNoCheckColl()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaba30);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetLockOnDistanceLow(class mHRChara* const this) [?mGetLockOnDistanceLow@mHRChara@@QAEMXZ]
	float mGetLockOnDistanceLow()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaba40);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetLockOnDistanceHi(class mHRChara* const this) [?mGetLockOnDistanceHi@mHRChara@@QAEMXZ]
	float mGetLockOnDistanceHi()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaba50);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetLockOnDistance(class mHRChara* const this) [?mGetLockOnDistance@mHRChara@@QAEMXZ]
	float mGetLockOnDistance()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaba60);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetAliveBtlIcn(class mHRChara* const this) [?mGetAliveBtlIcn@mHRChara@@QAE_NXZ]
	uint8_t mGetAliveBtlIcn()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xaba70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mChgBtlIcnFinish(class mHRChara* const this, enum HrBattleIcon::D_TODOME_DIRECT arg2) [?mChgBtlIcnFinish@mHRChara@@QAEXW4D_TODOME_DIRECT@HrBattleIcon@@@Z]
	void mChgBtlIcnFinish(enum HrBattleIcon::D_TODOME_DIRECT arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, enum HrBattleIcon::D_TODOME_DIRECT arg2);
		_Func mFunc = (_Func)(GameModule + 0xaba80);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetSlowBlow(class mHRChara* const this, uint8_t arg2) [?mSetSlowBlow@mHRChara@@QAEX_N@Z]
	void mSetSlowBlow(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabac0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetInputFinishReq(class mHRChara* const this, uint8_t arg2) [?mSetInputFinishReq@mHRChara@@QAEX_N@Z]
	void mSetInputFinishReq(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabad0);
		return mFunc(this, arg2);
	}
	// [Function] class TGan* __convention("thiscall") mHRChara::mGetResourceGanPtr(class mHRChara* const this, int32_t arg2) [?mGetResourceGanPtr@mHRChara@@QAEPAVTGan@@H@Z]
	class TGan* mGetResourceGanPtr(int32_t arg2)
	{
		typedef class TGan*(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabaf0);
		return mFunc(this, arg2);
	}
	// [Function] int16_t __convention("thiscall") mHRChara::mGetMoney(class mHRChara* const this) [?mGetMoney@mHRChara@@QAEFXZ]
	int16_t mGetMoney()
	{
		typedef int16_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabb00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMoney(class mHRChara* const this, int16_t arg2) [?mSetMoney@mHRChara@@QAEXF@Z]
	void mSetMoney(int16_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int16_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabb10);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetInputFinishReq(class mHRChara* const this) [?mGetInputFinishReq@mHRChara@@QAE_NXZ]
	uint8_t mGetInputFinishReq()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabb20);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mAddMoney(class mHRChara* const this, int16_t arg2) [?mAddMoney@mHRChara@@QAEXF@Z]
	void mAddMoney(int16_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int16_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabb30);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetInvincibleMotion(class mHRChara* const this, int32_t arg2, int32_t arg3) [?mSetInvincibleMotion@mHRChara@@QAEXHH@Z]
	void mSetInvincibleMotion(int32_t arg2, int32_t arg3)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, int32_t arg3);
		_Func mFunc = (_Func)(GameModule + 0xabb40);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRChara::mResetInvincibleMotion(class mHRChara* const this) [?mResetInvincibleMotion@mHRChara@@QAEXXZ]
	void mResetInvincibleMotion()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabb60);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCanGetHitByMotion(class mHRChara* const this, int32_t arg2) [?mCanGetHitByMotion@mHRChara@@QBE_NH@Z]
	uint8_t mCanGetHitByMotion(int32_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabb80);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mDispAtkHitIcn(class mHRChara* const this) [?mDispAtkHitIcn@mHRChara@@QAE_NXZ]
	uint8_t mDispAtkHitIcn()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabbb0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetDontStandUp(class mHRChara* const this) [?mGetDontStandUp@mHRChara@@QAE_NXZ]
	uint8_t mGetDontStandUp()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabbd0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::GetTubaFrmOffset(class mHRChara* const this) [?GetTubaFrmOffset@mHRChara@@QAEMXZ]
	float GetTubaFrmOffset()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabbe0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::GetAtkDisAdjust(class mHRChara* const this) [?GetAtkDisAdjust@mHRChara@@QAEMXZ]
	float GetAtkDisAdjust()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabbf0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetLoseTsubazeriFlag(class mHRChara* const this) [?mGetLoseTsubazeriFlag@mHRChara@@QAE_NXZ]
	uint8_t mGetLoseTsubazeriFlag()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabc00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetSuccessThrow(class mHRChara* const this, uint8_t arg2) [?mSetSuccessThrow@mHRChara@@QAEX_N@Z]
	void mSetSuccessThrow(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabc10);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetRotYA(class mHRChara* const this, float arg2) [?mSetRotYA@mHRChara@@QAEXM@Z]
	void mSetRotYA(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xabc40);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDontStandUp(class mHRChara* const this, uint8_t arg2) [?mSetDontStandUp@mHRChara@@QAEX_N@Z]
	void mSetDontStandUp(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabc50);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDmgGrav(class mHRChara* const this, float arg2) [?mSetDmgGrav@mHRChara@@QAEXM@Z]
	void mSetDmgGrav(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xabc80);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mChgBtlIcnSml(class mHRChara* const this, uint8_t arg2) [?mChgBtlIcnSml@mHRChara@@QAEX_N@Z]
	void mChgBtlIcnSml(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xabc90);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mChgBtlIcnBig(class mHRChara* const this) [?mChgBtlIcnBig@mHRChara@@QAEXXZ]
	void mChgBtlIcnBig()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabe10);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetCharaHit(class mHRChara* const this) [?mGetCharaHit@mHRChara@@QAE_NXZ]
	uint8_t mGetCharaHit()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabf20);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetCanLockOn(class mHRChara* const this) [?mGetCanLockOn@mHRChara@@QAE_NXZ]
	uint8_t mGetCanLockOn()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabf30);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGethitOidashiDisEnable(class mHRChara* const this) [?mGethitOidashiDisEnable@mHRChara@@QAE_NXZ]
	uint8_t mGethitOidashiDisEnable()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabf40);
		return mFunc(this);
	}
	// [Function] enum HrBattleIcon::D_BICON_STAT __convention("thiscall") mHRChara::mGetBtlIcnStatus(class mHRChara* const this) [?mGetBtlIcnStatus@mHRChara@@QAE?AW4D_BICON_STAT@HrBattleIcon@@XZ]
	enum HrBattleIcon::D_BICON_STAT mGetBtlIcnStatus()
	{
		typedef enum HrBattleIcon::D_BICON_STAT(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabf60);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetWepVisible(class mHRChara* const this) [?mGetWepVisible@mHRChara@@QAE_NXZ]
	uint8_t mGetWepVisible()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xabf90);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetMotionBrendNum(class mHRChara* const this) [?mGetMotionBrendNum@mHRChara@@QAEHXZ]
	int32_t mGetMotionBrendNum()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac020);
		return mFunc(this);
	}
	// [Function] int16_t __convention("thiscall") mHRChara::mGetAiValue(class mHRChara* const this, int32_t arg2) [?mGetAiValue@mHRChara@@QAEFH@Z]
	int16_t mGetAiValue(int32_t arg2)
	{
		typedef int16_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xac030);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mResetPosA(class mHRChara* const this) [?mResetPosA@mHRChara@@QAEXXZ]
	void mResetPosA()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac040);
		return mFunc(this);
	}
	// [Function] class ghmPlane& __convention("thiscall") mHRChara::getEasyShadowProjectionPlane(class mHRChara* const this) [?getEasyShadowProjectionPlane@mHRChara@@QBEABVghmPlane@@XZ]
	// Can't export & pointer 'class ghmPlane&' [TypeClass.PointerTypeClass] in LuaBridge
	void getEasyShadowProjectionPlane()
	{
		typedef class ghmPlane&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac0d0);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::isInterestTarget(class mHRChara* const this) [?isInterestTarget@mHRChara@@QBE_NXZ]
	uint8_t isInterestTarget()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac100);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMotionSpd(class mHRChara* const this, float arg2) [?mSetMotionSpd@mHRChara@@QAEXM@Z]
	void mSetMotionSpd(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xac140);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetWepEffectVisible(class mHRChara* const this) [?mGetWepEffectVisible@mHRChara@@QAE_NXZ]
	uint8_t mGetWepEffectVisible()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac150);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetVisible(class mHRChara* const this) [?mGetVisible@mHRChara@@QAE_NXZ]
	uint8_t mGetVisible()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac1a0);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetTension(class mHRChara* const this) [?mGetTension@mHRChara@@QAEMXZ]
	float mGetTension()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xac270);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetMiniMapRender(class mHRChara* const this) [?mGetMiniMapRender@mHRChara@@QBE_NXZ]
	uint8_t mGetMiniMapRender()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xacfb0);
		return mFunc(this);
	}
	// [Function] class ghmResGroup* __convention("thiscall") mHRChara::mGetResourceRslPtr(class mHRChara* const this) [?mGetResourceRslPtr@mHRChara@@QAEPAVghmResGroup@@XZ]
	class ghmResGroup* mGetResourceRslPtr()
	{
		typedef class ghmResGroup*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xad5f0);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::getFootNumber(class mHRChara* const this) [?getFootNumber@mHRChara@@QBEHXZ]
	int32_t getFootNumber()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xada50);
		return mFunc(this);
	}
	// [Function] char* __convention("thiscall") mHRChara::mGetCallScriptProc(class mHRChara* const this) [?mGetCallScriptProc@mHRChara@@QAEPADXZ]
	// Can't export pointer to native type 'char*' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetCallScriptProc()
	{
		typedef char*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb03a0);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetMotionProcessDisEnable(class mHRChara* const this) [?mGetMotionProcessDisEnable@mHRChara@@QBE_NXZ]
	uint8_t mGetMotionProcessDisEnable()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb03b0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsBloom(class mHRChara* const this) [?IsBloom@mHRChara@@QAE_NXZ]
	uint8_t IsBloom()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb03c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::SetTermAll(class mHRChara* const this, uint8_t arg2) [?SetTermAll@mHRChara@@QAEX_N@Z]
	void SetTermAll(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xb03d0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::SetKnockBackSpd(class mHRChara* const this, float arg2) [?SetKnockBackSpd@mHRChara@@QAEXM@Z]
	void SetKnockBackSpd(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xb0430);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::GetKnockBackSpd(class mHRChara* const this) [?GetKnockBackSpd@mHRChara@@QAEMXZ]
	float GetKnockBackSpd()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb0440);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetStageHitDisEnable(class mHRChara* const this) [?mGetStageHitDisEnable@mHRChara@@QAE_NXZ]
	uint8_t mGetStageHitDisEnable()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb0450);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetStartSplitFlameFlag(class mHRChara* const this) [?mGetStartSplitFlameFlag@mHRChara@@QBE_NXZ]
	uint8_t mGetStartSplitFlameFlag()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb04b0);
		return mFunc(this);
	}
	// [Function] class TGmf* __convention("thiscall") mHRChara::getBoneEffectGmf(class mHRChara* const this) [?getBoneEffectGmf@mHRChara@@AAEPAVTGmf@@XZ]
	class TGmf* getBoneEffectGmf()
	{
		typedef class TGmf*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb04c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetStartSplitFlameFlag(class mHRChara* const this, uint8_t arg2) [?mSetStartSplitFlameFlag@mHRChara@@QAEX_N@Z]
	void mSetStartSplitFlameFlag(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xb04e0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetCharaPause(class mHRChara* const this) [?mGetCharaPause@mHRChara@@QBE_NXZ]
	uint8_t mGetCharaPause()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb05a0);
		return mFunc(this);
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetBeforePos(class mHRChara* const this) [?mGetBeforePos@mHRChara@@QAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetBeforePos()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb9640);
		mFunc(this);
	}
	// [Function] int16_t __convention("thiscall") mHRChara::mGetZakoWepType(class mHRChara* const this) [?mGetZakoWepType@mHRChara@@QBEFXZ]
	int16_t mGetZakoWepType()
	{
		typedef int16_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xb9900);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetFootHitResultObj2(class mHRChara* const this, class ghmGcCollObjHitResultObj& arg2) [?mSetFootHitResultObj2@mHRChara@@QAEXABVghmGcCollObjHitResultObj@@@Z]
	void mSetFootHitResultObj2(class ghmGcCollObjHitResultObj& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class ghmGcCollObjHitResultObj& arg2);
		_Func mFunc = (_Func)(GameModule + 0xba010);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDmgUpperPow(class mHRChara* const this, float arg2) [?mSetDmgUpperPow@mHRChara@@QAEXM@Z]
	void mSetDmgUpperPow(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xba060);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mAddHp(class mHRChara* const this, float arg2) [?mAddHp@mHRChara@@QAEXM@Z]
	void mAddHp(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xba980);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetSubMotionSpd(class mHRChara* const this) [?mGetSubMotionSpd@mHRChara@@QAEMXZ]
	float mGetSubMotionSpd()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xbd0b0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetZakoWepType(class mHRChara* const this, int16_t arg2) [?mSetZakoWepType@mHRChara@@QAEXF@Z]
	void mSetZakoWepType(int16_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int16_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xbd120);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetHitSize(class mHRChara* const this, float arg2) [?mSetHitSize@mHRChara@@QAEXM@Z]
	void mSetHitSize(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0xbd4a0);
		return mFunc(this, arg2);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetReactionDist(class mHRChara* const this) [?mGetReactionDist@mHRChara@@QBEMXZ]
	float mGetReactionDist()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xc0260);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMiniMapRender(class mHRChara* const this, uint8_t arg2) [?mSetMiniMapRender@mHRChara@@QAEX_N@Z]
	void mSetMiniMapRender(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xc0270);
		return mFunc(this, arg2);
	}
	// [Function] struct Vec __convention("thiscall") mHRChara::GetKnockBackDir(class mHRChara* const this) [?GetKnockBackDir@mHRChara@@QAE?AUVec@@XZ]
	struct Vec GetKnockBackDir()
	{
		typedef struct Vec(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xc7970);
		return mFunc(this);
	}
	// [Function] int32_t __convention("thiscall") mHRChara::mGetMotionNoNpc(class mHRChara* const this) [?mGetMotionNoNpc@mHRChara@@QAEHXZ]
	int32_t mGetMotionNoNpc()
	{
		typedef int32_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xc97e0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::SetNormalClip(class mHRChara* const this, uint8_t arg2) [?SetNormalClip@mHRChara@@QAEX_N@Z]
	void SetNormalClip(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0xce050);
		return mFunc(this, arg2);
	}
	// [Function] struct Vec& __convention("thiscall") mHRChara::mGetOldPos(class mHRChara* const this) [?mGetOldPos@mHRChara@@QAEAAUVec@@XZ]
	// Can't export & pointer 'struct Vec&' [TypeClass.PointerTypeClass] in LuaBridge
	void mGetOldPos()
	{
		typedef struct Vec&(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xd4ae0);
		mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetSuccessThrow(class mHRChara* const this) [?mGetSuccessThrow@mHRChara@@QAE_NXZ]
	uint8_t mGetSuccessThrow()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0xd8b90);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDmgUpperPosY(class mHRChara* const this, float const arg2) [?mSetDmgUpperPosY@mHRChara@@QAEXM@Z]
	void mSetDmgUpperPosY(float const arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float const arg2);
		_Func mFunc = (_Func)(GameModule + 0xe34c0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::SetDeleteReq(class mHRChara* const this) [?SetDeleteReq@mHRChara@@QAEXXZ]
	void SetDeleteReq()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46dcf0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::getShootPosiAndYaw(class mHRChara* const this, struct Vec* arg2, float* arg3, class TGmf& arg4, char const* arg5) [?getShootPosiAndYaw@mHRChara@@QBEXPAUVec@@PAMABVTGmf@@PBD@Z]
	void getShootPosiAndYaw(struct Vec* arg2, float* arg3, class TGmf& arg4, std::string arg5)
	{
		char const* arg5_c_str = arg5.c_str();
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec* arg2, float* arg3, class TGmf& arg4, char const* arg5);
		_Func mFunc = (_Func)(GameModule + 0x46dd10);
		return mFunc(this, arg2, arg3, arg4, arg5_c_str);
	}
	// [Function] void __convention("thiscall") mHRChara::setHomingPositionFromAI(class mHRChara* const this, struct Vec& arg2) [?setHomingPositionFromAI@mHRChara@@QAEXABUVec@@@Z]
	void setHomingPositionFromAI(struct Vec& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2);
		_Func mFunc = (_Func)(GameModule + 0x46de70);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::setHomingActFlagFromAI(class mHRChara* const this, uint8_t const arg2) [?setHomingActFlagFromAI@mHRChara@@QAEX_N@Z]
	void setHomingActFlagFromAI(uint8_t const arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t const arg2);
		_Func mFunc = (_Func)(GameModule + 0x46dea0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::isHoming(class mHRChara* const this) [?isHoming@mHRChara@@QBE_NXZ]
	uint8_t isHoming()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ded0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::setInterestUseBoneNumFromAI(class mHRChara* const this, int32_t const arg2) [?setInterestUseBoneNumFromAI@mHRChara@@QAEXH@Z]
	void setInterestUseBoneNumFromAI(int32_t const arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t const arg2);
		_Func mFunc = (_Func)(GameModule + 0x46def0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::isInteresting(class mHRChara* const this) [?isInteresting@mHRChara@@QBE_NXZ]
	uint8_t isInteresting()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46df20);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::addDamageToYuremono(class mHRChara* const this, float const arg2, struct Vec& arg3) [?addDamageToYuremono@mHRChara@@QAEXMABUVec@@@Z]
	void addDamageToYuremono(float const arg2, struct Vec& arg3)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float const arg2, struct Vec& arg3);
		_Func mFunc = (_Func)(GameModule + 0x46df40);
		return mFunc(this, arg2, arg3);
	}
	// [Function] class mot::IBoneEffectPJ* __convention("thiscall") mHRChara::getBoneEffect(class mHRChara* const this) [?getBoneEffect@mHRChara@@IAEPAVIBoneEffectPJ@mot@@XZ]
	class mot::IBoneEffectPJ* getBoneEffect()
	{
		typedef class mot::IBoneEffectPJ*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46df80);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mSetHajikiCheck(class mHRChara* const this, float arg2) [?mSetHajikiCheck@mHRChara@@QAE_NM@Z]
	uint8_t mSetHajikiCheck(float arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0x46dfa0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckDamageAccept(class mHRChara* const this) [?mCheckDamageAccept@mHRChara@@QAE_NXZ]
	uint8_t mCheckDamageAccept()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46dfc0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestZakoDown(class mHRChara* const this) [?mTestZakoDown@mHRChara@@QAE_NXZ]
	uint8_t mTestZakoDown()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46dfd0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestPiyoRequest(class mHRChara* const this) [?mTestPiyoRequest@mHRChara@@QAE_NXZ]
	uint8_t mTestPiyoRequest()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e000);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::mGetPiyoriHeight(class mHRChara* const this) [?mGetPiyoriHeight@mHRChara@@QAEMXZ]
	float mGetPiyoriHeight()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e010);
		return mFunc(this);
	}
	// [Function] class mHRChara* mHRChara::mGetCharaPtr(int32_t arg1) [?mGetCharaPtr@mHRChara@@SAPAV1@H@Z]
	static class mHRChara* mGetCharaPtr(int32_t arg1)
	{
		typedef class mHRChara*(__fastcall* _Func)(int32_t arg1);
		_Func mFunc = (_Func)(GameModule + 0x46e100);
		return mFunc(arg1);
	}
	// [Function] void mHRChara::mRenderGmf(void* arg1) [?mRenderGmf@mHRChara@@SAXPAX@Z]
	static void mRenderGmf(void* arg1)
	{
		typedef void(__fastcall* _Func)(void* arg1);
		_Func mFunc = (_Func)(GameModule + 0x46e120);
		return mFunc(arg1);
	}
	// [Function] int32_t mHRChara::debugDispCharaInfo() [?debugDispCharaInfo@mHRChara@@SAXXZ]
	static int32_t debugDispCharaInfo()
	{
		typedef int32_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x46e140);
		return mFunc();
	}
	// [Function] uint8_t mHRChara::mTermAllZakoMotion() [?mTermAllZakoMotion@mHRChara@@SA_NXZ]
	static uint8_t mTermAllZakoMotion()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x46e150);
		return mFunc();
	}
	// [Function] uint8_t mHRChara::mInitAllNpc() [?mInitAllNpc@mHRChara@@SA_NXZ]
	static uint8_t mInitAllNpc()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x46e3a0);
		return mFunc();
	}
	// [Function] void __convention("thiscall") mHRChara::mCreateBloodSplash(class mHRChara* const this, class TGmfNode* arg2, float arg3, struct tagHRTASKCHECK* arg4) [?mCreateBloodSplash@mHRChara@@QAEXPAVTGmfNode@@MPAUtagHRTASKCHECK@@@Z]
	void mCreateBloodSplash(class TGmfNode* arg2, float arg3, struct tagHRTASKCHECK* arg4)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class TGmfNode* arg2, float arg3, struct tagHRTASKCHECK* arg4);
		_Func mFunc = (_Func)(GameModule + 0x46e3e0);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRChara::mBloodSplashProc(class mHRChara* const this) [?mBloodSplashProc@mHRChara@@QAEXXZ]
	void mBloodSplashProc()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e440);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::AddBoneElectPtrToList(class mHRChara* const this, class EffectBoneElect* arg2) [?AddBoneElectPtrToList@mHRChara@@QAEXPAVEffectBoneElect@@@Z]
	void AddBoneElectPtrToList(class EffectBoneElect* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class EffectBoneElect* arg2);
		_Func mFunc = (_Func)(GameModule + 0x46e4e0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::ReleaseBoneElect(class mHRChara* const this) [?ReleaseBoneElect@mHRChara@@QAE_NXZ]
	uint8_t ReleaseBoneElect()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e520);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsEmtpyBoneElectList(class mHRChara* const this) [?IsEmtpyBoneElectList@mHRChara@@QAE_NXZ]
	uint8_t IsEmtpyBoneElectList()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e600);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::DeleteBoneElectFromList(class mHRChara* const this, class EffectBoneElect* arg2) [?DeleteBoneElectFromList@mHRChara@@QAEXPAVEffectBoneElect@@@Z]
	void DeleteBoneElectFromList(class EffectBoneElect* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class EffectBoneElect* arg2);
		_Func mFunc = (_Func)(GameModule + 0x46e620);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::AddCutmarkPtrToList(class mHRChara* const this, class EffectCutMark* arg2) [?AddCutmarkPtrToList@mHRChara@@QAEXPAVEffectCutMark@@@Z]
	void AddCutmarkPtrToList(class EffectCutMark* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class EffectCutMark* arg2);
		_Func mFunc = (_Func)(GameModule + 0x46e660);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsEmtpyCutmarkList(class mHRChara* const this) [?IsEmtpyCutmarkList@mHRChara@@QAE_NXZ]
	uint8_t IsEmtpyCutmarkList()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e6a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::DeleteCutmarkFromList(class mHRChara* const this, class EffectCutMark* arg2) [?DeleteCutmarkFromList@mHRChara@@QAEXPAVEffectCutMark@@@Z]
	void DeleteCutmarkFromList(class EffectCutMark* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, class EffectCutMark* arg2);
		_Func mFunc = (_Func)(GameModule + 0x46e6c0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::SetPowerFlash(class mHRChara* const this, int32_t arg2, struct GXColor arg3) [?SetPowerFlash@mHRChara@@QAE_NHUGXColor@@@Z]
	uint8_t SetPowerFlash(int32_t arg2, struct GXColor arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, struct GXColor arg3);
		_Func mFunc = (_Func)(GameModule + 0x46e700);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::SetNoGuardEffect(class mHRChara* const this) [?SetNoGuardEffect@mHRChara@@QAE_NXZ]
	uint8_t SetNoGuardEffect()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e820);
		return mFunc(this);
	}
	// [Function] uint8_t mHRChara::mCheckAtkAllNpc() [?mCheckAtkAllNpc@mHRChara@@SA_NXZ]
	static uint8_t mCheckAtkAllNpc()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x46e840);
		return mFunc();
	}
	// [Function] uint8_t mHRChara::mCheckCanAtk() [?mCheckCanAtk@mHRChara@@SA_NXZ]
	static uint8_t mCheckCanAtk()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x46e870);
		return mFunc();
	}
	// [Function] void __convention("thiscall") mHRChara::mCallBeforeRenderProc(class mHRChara* const this) [?mCallBeforeRenderProc@mHRChara@@QAEXXZ]
	void mCallBeforeRenderProc()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e8a0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckCanHit(class mHRChara* const this, int32_t arg2, uint8_t arg3, uint8_t arg4) [?mCheckCanHit@mHRChara@@UAE_NH_N0@Z]
	uint8_t mCheckCanHit(int32_t arg2, uint8_t arg3, uint8_t arg4)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, uint8_t arg3, uint8_t arg4);
		_Func mFunc = (_Func)(GameModule + 0x46e8b0);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRChara::CreateFootSmokeEffect(class mHRChara* const this) [?CreateFootSmokeEffect@mHRChara@@QAEXXZ]
	/// <summary>
	/// Creates a dust effect at character feet.
	/// </summary>
	void CreateFootSmokeEffect()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46e8c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::KnockBackProc(class mHRChara* const this) [?KnockBackProc@mHRChara@@QAEXXZ]
	void KnockBackProc()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ea20);
		return mFunc(this);
	}
	// [Function] float __convention("thiscall") mHRChara::GetKnockBackRatio(class mHRChara* const this) [?GetKnockBackRatio@mHRChara@@QAEMXZ]
	float GetKnockBackRatio()
	{
		typedef float(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46eb30);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mSetDamage(class mHRChara* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10) [?mSetDamage@mHRChara@@UAE_NMHHHMHMMPAV1@@Z]
	uint8_t mSetDamage(float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10);
		_Func mFunc = (_Func)(GameModule + 0x46eba0);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6, arg7, arg8, arg9, arg10);
	}
	// [Function] void __convention("thiscall") mHRChara::mInitDamageMotInfo(class mHRChara* const this) [?mInitDamageMotInfo@mHRChara@@QAEXXZ]
	void mInitDamageMotInfo()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ebb0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mChangeDefAi(class mHRChara* const this, uint8_t arg2, uint8_t arg3) [?mChangeDefAi@mHRChara@@QAE_N_N0@Z]
	uint8_t mChangeDefAi(uint8_t arg2, uint8_t arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2, uint8_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x46ebe0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDefAI(class mHRChara* const this, uint8_t arg2) [?mSetDefAI@mHRChara@@QAEX_N@Z]
	void mSetDefAI(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x46ec60);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckCallFrameProc(class mHRChara* const this) [?mCheckCallFrameProc@mHRChara@@QAE_NXZ]
	uint8_t mCheckCallFrameProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ecb0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::IsNowUnderControl(class mHRChara* const this) [?IsNowUnderControl@mHRChara@@QAE_NXZ]
	uint8_t IsNowUnderControl()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ed60);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::RegistUnderControlAtkFuncPtr(class mHRChara* const this) [?RegistUnderControlAtkFuncPtr@mHRChara@@QAEXXZ]
	void RegistUnderControlAtkFuncPtr()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ed70);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::RegistUnderControlMotID(class mHRChara* const this, struct CharControlMotID& arg2) [?RegistUnderControlMotID@mHRChara@@QAEXABUCharControlMotID@@@Z]
	void RegistUnderControlMotID(struct CharControlMotID& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct CharControlMotID& arg2);
		_Func mFunc = (_Func)(GameModule + 0x46ed80);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::SetUnderControlFlag(class mHRChara* const this, uint8_t arg2) [?SetUnderControlFlag@mHRChara@@QAEX_N@Z]
	void SetUnderControlFlag(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x46edb0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::DrawDebugCollision(class mHRChara* const this) [?DrawDebugCollision@mHRChara@@IAEXXZ]
	void DrawDebugCollision()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46edf0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mRenderProc(class mHRChara* const this) [?mRenderProc@mHRChara@@UAE_NXZ]
	uint8_t mRenderProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ee00);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::postSetupMatrix(class mHRChara* const this) [?postSetupMatrix@mHRChara@@AAEXXZ]
	void postSetupMatrix()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46ef90);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::preSetupMatrix(class mHRChara* const this) [?preSetupMatrix@mHRChara@@AAEXXZ]
	void preSetupMatrix()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46f000);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mFootSmokeEffect(class mHRChara* const this) [?mFootSmokeEffect@mHRChara@@QAEXXZ]
	void mFootSmokeEffect()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46f1f0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mPosAnimationProc(class mHRChara* const this) [?mPosAnimationProc@mHRChara@@QAEXXZ]
	void mPosAnimationProc()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46f590);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPostFrameProc(class mHRChara* const this) [?mPostFrameProc@mHRChara@@UAE_NXZ]
	uint8_t mPostFrameProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46f6b0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mFrameProc(class mHRChara* const this) [?mFrameProc@mHRChara@@UAE_NXZ]
	uint8_t mFrameProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46f860);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mInit(class mHRChara* const this) [?mInit@mHRChara@@UAE_NXZ]
	uint8_t mInit()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46f870);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetRotA(class mHRChara* const this, struct Vec& arg2, uint32_t const arg3) [?mSetRotA@mHRChara@@QAEXABUVec@@I@Z]
	void mSetRotA(struct Vec& arg2, uint32_t const arg3)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2, uint32_t const arg3);
		_Func mFunc = (_Func)(GameModule + 0x46fd30);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetWepEffectVisibleInstant(class mHRChara* const this, uint8_t arg2) [?mSetWepEffectVisibleInstant@mHRChara@@QAEX_N@Z]
	void mSetWepEffectVisibleInstant(uint8_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x46fda0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSubFrameStop(class mHRChara* const this) [?mSubFrameStop@mHRChara@@QAEXXZ]
	void mSubFrameStop()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x46fe70);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPlayMotionMov(class mHRChara* const this, int32_t arg2, float arg3, float arg4, float arg5, uint8_t arg6) [?mPlayMotionMov@mHRChara@@QAE_NHMMM_N@Z]
	uint8_t mPlayMotionMov(int32_t arg2, float arg3, float arg4, float arg5, uint8_t arg6)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, float arg3, float arg4, float arg5, uint8_t arg6);
		_Func mFunc = (_Func)(GameModule + 0x46ff00);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestMotion(class mHRChara* const this, int32_t arg2) [?mTestMotion@mHRChara@@QAE_NH@Z]
	uint8_t mTestMotion(int32_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x470000);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDifficultyMotionSpeed(class mHRChara* const this, float arg2) [?mSetDifficultyMotionSpeed@mHRChara@@QAEXM@Z]
	void mSetDifficultyMotionSpeed(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0x470030);
		return mFunc(this, arg2);
	}
	// [Function] class mHRChara* mHRChara::getCharaByGM2FileName(char const* arg1) [?getCharaByGM2FileName@mHRChara@@SAPAV1@PBD@Z]
	static class mHRChara* getCharaByGM2FileName(std::string arg1)
	{
		char const* arg1_c_str = arg1.c_str();
		typedef class mHRChara*(__fastcall* _Func)(char const* arg1);
		_Func mFunc = (_Func)(GameModule + 0x470040);
		return mFunc(arg1_c_str);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetDeath(class mHRChara* const this) [?mSetDeath@mHRChara@@QAEXXZ]
	void mSetDeath()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x4700a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mDamageCallBackForScript(class mHRChara* const this, int32_t arg2, uint8_t arg3, enum eDmgCallBackDmgType arg4, int32_t arg5) [?mDamageCallBackForScript@mHRChara@@QAEXH_NW4eDmgCallBackDmgType@@H@Z]
	void mDamageCallBackForScript(int32_t arg2, uint8_t arg3, enum eDmgCallBackDmgType arg4, int32_t arg5)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, uint8_t arg3, enum eDmgCallBackDmgType arg4, int32_t arg5);
		_Func mFunc = (_Func)(GameModule + 0x4700c0);
		return mFunc(this, arg2, arg3, arg4, arg5);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetMotionPlay(class mHRChara* const this) [?mGetMotionPlay@mHRChara@@QAE_NXZ]
	uint8_t mGetMotionPlay()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x470140);
		return mFunc(this);
	}
	// [Function] class mHRChara* mHRChara::mGetAliveResourceCharaPtr(enum enCharaType arg1, uint32_t arg2) [?mGetAliveResourceCharaPtr@mHRChara@@SAPAV1@W4enCharaType@@I@Z]
	static class mHRChara* mGetAliveResourceCharaPtr(enum enCharaType arg1, uint32_t arg2)
	{
		typedef class mHRChara*(__fastcall* _Func)(enum enCharaType arg1, uint32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x470150);
		return mFunc(arg1, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::ReleaseCutmark(class mHRChara* const this) [?ReleaseCutmark@mHRChara@@QAE_NXZ]
	uint8_t ReleaseCutmark()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x470180);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTestPiyori(class mHRChara* const this) [?mTestPiyori@mHRChara@@QBE_NXZ]
	uint8_t mTestPiyori()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x470260);
		return mFunc(this);
	}
	// [Function] uint32_t __convention("thiscall") mHRChara::mGetMotionTotalTick(class mHRChara* const this, int32_t arg2) [?mGetMotionTotalTick@mHRChara@@QAEIH@Z]
	uint32_t mGetMotionTotalTick(int32_t arg2)
	{
		typedef uint32_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x470270);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::setInterestPositionFromAI(class mHRChara* const this, struct Vec& arg2) [?setInterestPositionFromAI@mHRChara@@QAEXABUVec@@@Z]
	void setInterestPositionFromAI(struct Vec& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2);
		_Func mFunc = (_Func)(GameModule + 0x4702f0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::setInterestActFlagFromAI(class mHRChara* const this, uint8_t const arg2) [?setInterestActFlagFromAI@mHRChara@@QAEX_N@Z]
	void setInterestActFlagFromAI(uint8_t const arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t const arg2);
		_Func mFunc = (_Func)(GameModule + 0x470320);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mGetWepTopPos(class mHRChara* const this, struct Vec* arg2, enum enWepLeftRight arg3) [?mGetWepTopPos@mHRChara@@QAE_NPAUVec@@W4enWepLeftRight@@@Z]
	uint8_t mGetWepTopPos(struct Vec* arg2, enum enWepLeftRight arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec* arg2, enum enWepLeftRight arg3);
		_Func mFunc = (_Func)(GameModule + 0x470350);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRChara::mInitDamageStatus(class mHRChara* const this) [?mInitDamageStatus@mHRChara@@QAEXXZ]
	void mInitDamageStatus()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x470390);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPostFrameCommonProc1(class mHRChara* const this) [?mPostFrameCommonProc1@mHRChara@@UAE_NXZ]
	uint8_t mPostFrameCommonProc1()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x470450);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPostFrameCommonProc2(class mHRChara* const this) [?mPostFrameCommonProc2@mHRChara@@UAE_NXZ]
	uint8_t mPostFrameCommonProc2()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x470e10);
		return mFunc(this);
	}
	// [Function] class mot::CBoneEffectDamageData* __convention("thiscall") mHRChara::getBoneEffectDamageData(class mHRChara* const this) [?getBoneEffectDamageData@mHRChara@@IAEPAVCBoneEffectDamageData@mot@@XZ]
	class mot::CBoneEffectDamageData* getBoneEffectDamageData()
	{
		typedef class mot::CBoneEffectDamageData*(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x471850);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::SetKnockBack(class mHRChara* const this, float arg2, struct Vec& arg3, float arg4) [?SetKnockBack@mHRChara@@QAEXMABUVec@@M@Z]
	void SetKnockBack(float arg2, struct Vec& arg3, float arg4)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2, struct Vec& arg3, float arg4);
		_Func mFunc = (_Func)(GameModule + 0x471870);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::CheckWallCrashAndDamageProc(class mHRChara* const this, int32_t const arg2, int32_t const arg3) [?CheckWallCrashAndDamageProc@mHRChara@@QAE_NHH@Z]
	uint8_t CheckWallCrashAndDamageProc(int32_t const arg2, int32_t const arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t const arg2, int32_t const arg3);
		_Func mFunc = (_Func)(GameModule + 0x471ae0);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mSetHpBarVisible(class mHRChara* const this, uint8_t arg2) [?mSetHpBarVisible@mHRChara@@QAE_N_N@Z]
	uint8_t mSetHpBarVisible(uint8_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x471db0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetPosA(class mHRChara* const this, struct Vec& arg2, uint32_t const arg3, int32_t const arg4) [?mSetPosA@mHRChara@@QAEXABUVec@@IH@Z]
	void mSetPosA(struct Vec& arg2, uint32_t const arg3, int32_t const arg4)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2, uint32_t const arg3, int32_t const arg4);
		_Func mFunc = (_Func)(GameModule + 0x471e10);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mSetSimpleHpBarVisible(class mHRChara* const this, uint8_t arg2) [?mSetSimpleHpBarVisible@mHRChara@@QAE_N_N@Z]
	uint8_t mSetSimpleHpBarVisible(uint8_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x471f20);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mPlayCamMotFromCharMot(class mHRChara* const this, int32_t arg2, int32_t arg3, uint8_t arg4, uint8_t arg5, uint8_t arg6) [?mPlayCamMotFromCharMot@mHRChara@@QAEXHH_N00@Z]
	void mPlayCamMotFromCharMot(int32_t arg2, int32_t arg3, uint8_t arg4, uint8_t arg5, uint8_t arg6)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, int32_t arg3, uint8_t arg4, uint8_t arg5, uint8_t arg6);
		_Func mFunc = (_Func)(GameModule + 0x471f80);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6);
	}
	// [Function] void __convention("thiscall") mHRChara::checkDeleteBlackBodyEffect(class mHRChara* const this) [?checkDeleteBlackBodyEffect@mHRChara@@QAEXXZ]
	void checkDeleteBlackBodyEffect()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x4722c0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetHitCounter(class mHRChara* const this) [?mSetHitCounter@mHRChara@@QAEXXZ]
	void mSetHitCounter()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x4722e0);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mReleaseBloodSplash(class mHRChara* const this, uint8_t arg2) [?mReleaseBloodSplash@mHRChara@@QAE_N_N@Z]
	uint8_t mReleaseBloodSplash(uint8_t arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x472310);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPreFrameProc(class mHRChara* const this) [?mPreFrameProc@mHRChara@@UAE_NXZ]
	uint8_t mPreFrameProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x472370);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPreRenderProc(class mHRChara* const this) [?mPreRenderProc@mHRChara@@UAE_NXZ]
	uint8_t mPreRenderProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x472510);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mDetouchMotionBrend(class mHRChara* const this) [?mDetouchMotionBrend@mHRChara@@QAEXXZ]
	void mDetouchMotionBrend()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x472540);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mReleaseDemoBtleIcn(class mHRChara* const this) [?mReleaseDemoBtleIcn@mHRChara@@QAEXXZ]
	void mReleaseDemoBtleIcn()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x4725b0);
		return mFunc(this);
	}
	// [Function] uint8_t mHRChara::isThisCharaExist(class mHRChara* arg1) [?isThisCharaExist@mHRChara@@SA_NPBV1@@Z]
	static uint8_t isThisCharaExist(class mHRChara* arg1)
	{
		typedef uint8_t(__fastcall* _Func)(class mHRChara* arg1);
		_Func mFunc = (_Func)(GameModule + 0x4725d0);
		return mFunc(arg1);
	}
	// [Function] uint8_t mHRChara::mTermAllNpc() [?mTermAllNpc@mHRChara@@SA_NXZ]
	static uint8_t mTermAllNpc()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472600);
		return mFunc();
	}
	// [Function] int32_t mHRChara::mGetPopZakoNum() [?mGetPopZakoNum@mHRChara@@SAHXZ]
	static int32_t mGetPopZakoNum()
	{
		typedef int32_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472670);
		return mFunc();
	}
	// [Function] void __convention("thiscall") mHRChara::mDeleteDispChara(class mHRChara* const this) [?mDeleteDispChara@mHRChara@@QAEXXZ]
	void mDeleteDispChara()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x4726a0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetAiDef(class mHRChara* const this, int32_t arg2) [?mSetAiDef@mHRChara@@QAEXH@Z]
	void mSetAiDef(int32_t arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2);
		_Func mFunc = (_Func)(GameModule + 0x4726d0);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::setFootShadowDrawFlag(class mHRChara* const this, uint8_t const arg2) [?setFootShadowDrawFlag@mHRChara@@QAEX_N@Z]
	void setFootShadowDrawFlag(uint8_t const arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, uint8_t const arg2);
		_Func mFunc = (_Func)(GameModule + 0x4726f0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t mHRChara::mFrameProcAll() [?mFrameProcAll@mHRChara@@SA_NXZ]
	static uint8_t mFrameProcAll()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472810);
		return mFunc();
	}
	// [Function] uint8_t mHRChara::mRenderProcAll(uint8_t arg1) [?mRenderProcAll@mHRChara@@SA_N_N@Z]
	static uint8_t mRenderProcAll(uint8_t arg1)
	{
		typedef uint8_t(__fastcall* _Func)(uint8_t arg1);
		_Func mFunc = (_Func)(GameModule + 0x472a40);
		return mFunc(arg1);
	}
	// [Function] uint8_t mHRChara::mPostRenderProcAll() [?mPostRenderProcAll@mHRChara@@SA_NXZ]
	static uint8_t mPostRenderProcAll()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472ba0);
		return mFunc();
	}
	// [Function] uint8_t mHRChara::mTermAllNpcWithoutCmnObj() [?mTermAllNpcWithoutCmnObj@mHRChara@@SA_NXZ]
	static uint8_t mTermAllNpcWithoutCmnObj()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472c10);
		return mFunc();
	}
	// [Function] uint8_t mHRChara::mTermAllEnemyNpc() [?mTermAllEnemyNpc@mHRChara@@SA_NXZ]
	static uint8_t mTermAllEnemyNpc()
	{
		typedef uint8_t(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472c80);
		return mFunc();
	}
	// [Function] class mHRChara* mHRChara::mGetNpcTop() [?mGetNpcTop@mHRChara@@SAPAV1@XZ]
	static class mHRChara* mGetNpcTop()
	{
		typedef class mHRChara*(__fastcall* _Func)();
		_Func mFunc = (_Func)(GameModule + 0x472cf0);
		return mFunc();
	}
	// [Function] void __convention("thiscall") mHRChara::SetFileName(class mHRChara* const this, char const* arg2) [?SetFileName@mHRChara@@QAEXPBD@Z]
	void SetFileName(std::string arg2)
	{
		char const* arg2_c_str = arg2.c_str();
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, char const* arg2);
		_Func mFunc = (_Func)(GameModule + 0x473620);
		return mFunc(this, arg2_c_str);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetMaxHp(class mHRChara* const this, float arg2) [?mSetMaxHp@mHRChara@@QAEXM@Z]
	void mSetMaxHp(float arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2);
		_Func mFunc = (_Func)(GameModule + 0x473640);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mTerm(class mHRChara* const this) [?mTerm@mHRChara@@UAE_NXZ]
	uint8_t mTerm()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x473660);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetPos(class mHRChara* const this, struct Vec& arg2, uint8_t arg3, float arg4) [?mSetPos@mHRChara@@UAEXABUVec@@_NM@Z]
	void mSetPos(struct Vec& arg2, uint8_t arg3, float arg4)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2, uint8_t arg3, float arg4);
		_Func mFunc = (_Func)(GameModule + 0x473940);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetRot(class mHRChara* const this, struct Vec& arg2) [?mSetRot@mHRChara@@UAEXABUVec@@@Z]
	void mSetRot(struct Vec& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2);
		_Func mFunc = (_Func)(GameModule + 0x473a30);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetScale(class mHRChara* const this, struct Vec& arg2) [?mSetScale@mHRChara@@UAEXABUVec@@@Z]
	void mSetScale(struct Vec& arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec& arg2);
		_Func mFunc = (_Func)(GameModule + 0x473ac0);
		return mFunc(this, arg2);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mHitCheck(class mHRChara* const this, class mHRChara* arg2) [?mHitCheck@mHRChara@@UAE_NPAV1@@Z]
	uint8_t mHitCheck(class mHRChara* arg2)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, class mHRChara* arg2);
		_Func mFunc = (_Func)(GameModule + 0x473b20);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mMotionSpeedControl(class mHRChara* const this) [?mMotionSpeedControl@mHRChara@@QAEXXZ]
	void mMotionSpeedControl()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x473f60);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mCallMotionProc(class mHRChara* const this) [?mCallMotionProc@mHRChara@@QAEXXZ]
	void mCallMotionProc()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x474290);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mPlayMotion(class mHRChara* const this, int32_t arg2, uint8_t arg3, int32_t arg4, uint8_t arg5, float arg6) [?mPlayMotion@mHRChara@@UAE_NH_NH0M@Z]
	uint8_t mPlayMotion(int32_t arg2, uint8_t arg3, int32_t arg4, uint8_t arg5, float arg6)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, uint8_t arg3, int32_t arg4, uint8_t arg5, float arg6);
		_Func mFunc = (_Func)(GameModule + 0x474400);
		return mFunc(this, arg2, arg3, arg4, arg5, arg6);
	}
	// [Function] void __convention("thiscall") mHRChara::mCallMoneyDrop(class mHRChara* const this, int32_t arg2, uint8_t arg3, uint8_t arg4) [?mCallMoneyDrop@mHRChara@@QAEXH_N0@Z]
	void mCallMoneyDrop(int32_t arg2, uint8_t arg3, uint8_t arg4)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, uint8_t arg3, uint8_t arg4);
		_Func mFunc = (_Func)(GameModule + 0x474550);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mAttachWep(class mHRChara* const this, class TGmf* arg2, enum eUDLR arg3, char* arg4) [?mAttachWep@mHRChara@@UAE_NPAVTGmf@@W4eUDLR@@PAD@Z]
	uint8_t mAttachWep(class TGmf* arg2, enum eUDLR arg3, char* arg4)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, class TGmf* arg2, enum eUDLR arg3, char* arg4);
		_Func mFunc = (_Func)(GameModule + 0x4745d0);
		return mFunc(this, arg2, arg3, arg4);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mDetachWep(class mHRChara* const this, enum eUDLR arg2, char* arg3) [?mDetachWep@mHRChara@@UAE_NW4eUDLR@@PAD@Z]
	uint8_t mDetachWep(enum eUDLR arg2, char* arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, enum eUDLR arg2, char* arg3);
		_Func mFunc = (_Func)(GameModule + 0x474880);
		return mFunc(this, arg2, arg3);
	}
	// [Function] void __convention("thiscall") mHRChara::mSemitransparentProcess(class mHRChara* const this) [?mSemitransparentProcess@mHRChara@@UAEXXZ]
	void mSemitransparentProcess()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x474980);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mUpdateAtkColl(class mHRChara* const this) [?mUpdateAtkColl@mHRChara@@UAEXXZ]
	void mUpdateAtkColl()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x474c50);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mRenderShadowProc(class mHRChara* const this) [?mRenderShadowProc@mHRChara@@UAEXXZ]
	void mRenderShadowProc()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x474e50);
		return mFunc(this);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mRefreshFloorPosition(class mHRChara* const this, float arg2, uint8_t arg3) [?mRefreshFloorPosition@mHRChara@@UAE_NM_N@Z]
	uint8_t mRefreshFloorPosition(float arg2, uint8_t arg3)
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr, float arg2, uint8_t arg3);
		_Func mFunc = (_Func)(GameModule + 0x474f70);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mDamageProc(class mHRChara* const this) [?mDamageProc@mHRChara@@UAE_NXZ]
	uint8_t mDamageProc()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x475080);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mRestoreDamage(class mHRChara* const this, int32_t arg2, float arg3) [?mRestoreDamage@mHRChara@@UAEXHM@Z]
	void mRestoreDamage(int32_t arg2, float arg3)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, int32_t arg2, float arg3);
		_Func mFunc = (_Func)(GameModule + 0x475090);
		return mFunc(this, arg2, arg3);
	}
	// [Function] uint8_t __convention("thiscall") mHRChara::mCheckCanAttack(class mHRChara* const this) [?mCheckCanAttack@mHRChara@@UAE_NXZ]
	uint8_t mCheckCanAttack()
	{
		typedef uint8_t(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x4750f0);
		return mFunc(this);
	}
	// [Function] void __convention("thiscall") mHRChara::mGetTsubazeriaiPos(class mHRChara* const this, struct Vec* arg2) [?mGetTsubazeriaiPos@mHRChara@@UAEXPAUVec@@@Z]
	void mGetTsubazeriaiPos(struct Vec* arg2)
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr, struct Vec* arg2);
		_Func mFunc = (_Func)(GameModule + 0x475100);
		return mFunc(this, arg2);
	}
	// [Function] void __convention("thiscall") mHRChara::mSetPcTsubaOuterMot(class mHRChara* const this) [?mSetPcTsubaOuterMot@mHRChara@@UAEXXZ]
	void mSetPcTsubaOuterMot()
	{
		typedef void(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x475120);
		return mFunc(this);
	}
	// [Function] struct Vec __convention("thiscall") mHRChara::GetTsubaEffectPos(class mHRChara* const this) [?GetTsubaEffectPos@mHRChara@@UAE?AUVec@@XZ]
	struct Vec GetTsubaEffectPos()
	{
		typedef struct Vec(__thiscall* _Func)(class mHRChara* const thisPtr);
		_Func mFunc = (_Func)(GameModule + 0x475140);
		return mFunc(this);
	}
