// Exporter by @MekuCube

#pragma once

/// Forward Declaration

// TODO: Function 'int32_t `dynamic initializer for 'mHRChara::mCharaAnchor''()'
class CSpringInterpolate;
class CDoubleSpringInterpolate;
class CAmbientShadow;
struct stCharaEffect;
class stCharaFileData;
struct Vec;
class ghmSegment;
class ghmCapsule;
class ghmGcOctTreeNodeObj;
class ghmGcCollObj;
class ghmGcCollObjCapsule;
class WAnim;
class WAnimF;
struct stDamageInfo;
class ghmTriangle;
class ghmPlane;
class ghmGcCollObjHitResultObj;
struct stVec;
struct Quaternion;
struct stCharaStatus;
class ghmListObj;
class mHRChara;
class ghmAABB;
class ghmGcOctTreeNode;
class ghmGcOctTree;
class ghmGcCollObjHitResult;
struct WGclMaterialSpec;
namespace EE
{
	template<typename T>
	class SmartPtr;
}
struct DVDCommandBlock;
struct DVDFileInfo;
class ghmGcFile;
struct DVDDiskID;
namespace EE
{
	class RefObject;
}
namespace EE
{
	class IFile;
}
class ghmResGroup;
class ghmResStrTable;
class vector4f;
class vector4x;
class tiVector;
namespace mot
{
	class IBoneEffectModel;
}
namespace mot
{
	class IBoneEffectModelPJ;
}
class TGmf;
class TGanPlay;
class TGan;
struct WGanSpec;
struct WGanMaterialSpec;
struct WGanFAnmSpec;
struct _WFAnmObjHeader;
struct _WFAnmObjKeyListHeader;
struct WGanMaterialLayerSpec;
struct WGanNodeSpec;
class TGanPlayNode;
class TFAnm;
class TGmfNode;
class CViewClipObjSphere;
class CViewClipObjBox;
class rPrimUnific;
class EfBase;
class HrTask;
class EfDestortion;
struct TGMFMESH;
struct GXTexObj;

class State_Pressure;
class State_ThroughDamage;
class State_Defence;
class State_Evacuate;
class State_ComboAttack;
class State_Damage;
struct CollInfo;
struct tagHRTASKCHECK;
struct ZkGuardParam;
struct ZkEvacuateParam;
class FkCounter;
struct ZkSetDamageInfo;
class State_Scare_Yotunbai;
class State_Scare_Stand;
class State_RandomMove;
class State_PerformIll;
class PJZAKO;
class PJStateMachine;
class EffectDanmenFlash;
class EffectCutMark;
class EffectQuestion;
class PJZakoMotMng;
class PathPlanner;
class FkDynamicParam;
class FkObstacleSensor;
class FkBulletManager;
class EffectFkTobiDoguBase;
class rQuadEx;
class EffectGunTrack;
class pcSNB;
class State_Tojo_Knife_SuddenAttack;
class ZkKnifeState_ThroughKnife;
class PJZAKOBoneB;
class PJZakoKnife;
class bsSKE;
class bsLEZ;
class bsCEW;
class bsAST;
class bsRKT;
template<typename T>
class KrBaseState;
class GLBDeathState;
class GLBWalkState;
class GLBComboState;
class GLBIdleState;
class GLBJampState;
template<typename T1, int T2>
class KrStateMachine;
class rSideScrollCamera;
class GLBDamageState;
class GLBGuardState;
class GLBAirKickState;
class pcGLB;
class EfRoboInterface;
class EffectSpeedBlur;
class CmDeathState;
class SDPDeathState;
class SDPComboState;
class CmDamageState;
class SDPDamageState;
class SDPBeamState;
class CmIdleState;
class SDPIdleState;
class bsBasic;
class SDPMoveState;
class SDPGuardState;
class bsSDP;
class FkTriangleList;
class EffectModelBeam;
struct FkVtx;
class EfGeneralBeam;
class PJOBJ0029;
class PJOBJ0033;
struct EFFECTSIMPLEOBJ3PARAM;
struct EFFECTMODELFIREPARAM;
class EffectModelFire;
class EffectSimpleObj3;
struct tagTLIST;
class PJOBJ0036;
class PJOBJ0037;
class PJOBJ0104;
class PJOBJ0155;
class PJOBJ0190;
class PJPTR;
// TODO: Function 'class EffectCutMark* EffectCutMark::Create(class TGmf* arg1, class mHRChara* arg2, struct Vec* arg3, uint32_t const arg4, enum eEfDmgLevel& arg5, enum EffectCutMark::eCutMarkType& arg6, float const arg7)'
class EffectEnemyDamage;
// TODO: Function 'void mHRCharaVoiceTable_Initialize()'
struct FkDbgInfo_EventArea;
class FkGlobalDBG;
class EffectBloodSplash;
class EffectSimpleObj2;
class EffectSlashHit;
class FkBoss;
class EffectSlashTrack;
class EffectBeamDragon;
class EffectGYNMissile;
class EffectMoeMissile;
class CMotionPlayer;
// TODO: Function 'void `dynamic atexit destructor for 'mHRChara::mCharaAnchor''()'

/// Full Declaration

// TODO: Function 'int32_t `dynamic initializer for 'mHRChara::mCharaAnchor''()'
// enum enCharaInitProc
enum enCharaInitProc : uint32_t
{
	// Enum values

	// <eCharaInitProcPrepareForReadRsl = 0x0>
	eCharaInitProcPrepareForReadRsl = 0,

	// <eCharaInitProcReadRsl = 0x1>
	eCharaInitProcReadRsl = 1,

	// <eCharaInitProcReadRslWait = 0x2>
	eCharaInitProcReadRslWait = 2,

	// <eCharaInitProcPrepareForRsl = 0x3>
	eCharaInitProcPrepareForRsl = 3,

	// <eCharaInitProcFinish = 0x4>
	eCharaInitProcFinish = 4,

	// <eCharaInitProcMax = 0x5>
	eCharaInitProcMax = 5

};

// class CSpringInterpolate
// no dependencies
class CSpringInterpolate
{
public:
	/// No namespace types
	/// Struct member variables

	// <float m_fSpringCoe, offset 0x0>
	float m_fSpringCoe;

	// <float m_fMaxVel, offset 0x4>
	float m_fMaxVel;

	// <float m_fMinVel, offset 0x8>
	float m_fMinVel;

	// <uint8_t m_bIsRadiInterp, offset 0xc>
	uint8_t m_bIsRadiInterp;

	// <Filler, offset 0xd>
	char _Filler4[3];

	// <float m_fEpsilon, offset 0x10>
	float m_fEpsilon;

	// <float m_fValue, offset 0x14>
	float m_fValue;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CSpringInterpolate>("CSpringInterpolate")
			.addProperty("m_fSpringCoe", &CSpringInterpolate::m_fSpringCoe)
			.addProperty("m_fMaxVel", &CSpringInterpolate::m_fMaxVel)
			.addProperty("m_fMinVel", &CSpringInterpolate::m_fMinVel)
			.addProperty("m_bIsRadiInterp", &CSpringInterpolate::m_bIsRadiInterp)
			.addProperty("m_fEpsilon", &CSpringInterpolate::m_fEpsilon)
			.addProperty("m_fValue", &CSpringInterpolate::m_fValue)
		.endClass();
	}
#endif
};
static_assert(sizeof(CSpringInterpolate::m_fSpringCoe) == 4, "expected m_fSpringCoe to be size 4");
static_assert(sizeof(CSpringInterpolate::m_fMaxVel) == 4, "expected m_fMaxVel to be size 4");
static_assert(sizeof(CSpringInterpolate::m_fMinVel) == 4, "expected m_fMinVel to be size 4");
static_assert(sizeof(CSpringInterpolate::m_bIsRadiInterp) == 1, "expected m_bIsRadiInterp to be size 1");
static_assert(sizeof(CSpringInterpolate::m_fEpsilon) == 4, "expected m_fEpsilon to be size 4");
static_assert(sizeof(CSpringInterpolate::m_fValue) == 4, "expected m_fValue to be size 4");
static_assert(sizeof(class CSpringInterpolate) == 24, "expected class CSpringInterpolate to be size 24");

// class CDoubleSpringInterpolate
// 1 dependencies: class CSpringInterpolate
class CDoubleSpringInterpolate
{
public:
	/// No namespace types
	/// Struct member variables

	// <class CSpringInterpolate m_inHopeInterp, offset 0x0>
	class CSpringInterpolate m_inHopeInterp;

	// <class CSpringInterpolate m_inCurInterp, offset 0x18>
	class CSpringInterpolate m_inCurInterp;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CDoubleSpringInterpolate>("CDoubleSpringInterpolate")
			.addProperty("m_inHopeInterp", &CDoubleSpringInterpolate::m_inHopeInterp)
			.addProperty("m_inCurInterp", &CDoubleSpringInterpolate::m_inCurInterp)
		.endClass();
	}
#endif
};
static_assert(sizeof(CDoubleSpringInterpolate::m_inHopeInterp) == 24, "expected m_inHopeInterp to be size 24");
static_assert(sizeof(CDoubleSpringInterpolate::m_inCurInterp) == 24, "expected m_inCurInterp to be size 24");
static_assert(sizeof(class CDoubleSpringInterpolate) == 48, "expected class CDoubleSpringInterpolate to be size 48");

// class CAmbientShadow
// 2 dependencies: class CDoubleSpringInterpolate, class CSpringInterpolate
class CAmbientShadow
{
public:
	/// No namespace types
	/// Struct member variables

	// <class CDoubleSpringInterpolate m_inRatio, offset 0x0>
	class CDoubleSpringInterpolate m_inRatio;

	// <float m_fSetRatio, offset 0x30>
	float m_fSetRatio;

	// <class TGmf* m_pPreGmf, offset 0x34>
	class TGmf* m_pPreGmf;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CAmbientShadow>("CAmbientShadow")
			.addProperty("m_inRatio", &CAmbientShadow::m_inRatio)
			.addProperty("m_fSetRatio", &CAmbientShadow::m_fSetRatio)
			.addProperty("m_pPreGmf", &CAmbientShadow::m_pPreGmf)
		.endClass();
	}
#endif
};
static_assert(sizeof(CAmbientShadow::m_inRatio) == 48, "expected m_inRatio to be size 48");
static_assert(sizeof(CAmbientShadow::m_fSetRatio) == 4, "expected m_fSetRatio to be size 4");
static_assert(sizeof(CAmbientShadow::m_pPreGmf) == 4, "expected m_pPreGmf to be size 4");
static_assert(sizeof(class CAmbientShadow) == 56, "expected class CAmbientShadow to be size 56");

// struct stCharaEffect
// no dependencies
struct stCharaEffect
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[292];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stCharaEffect>("stCharaEffect")
		.endClass();
	}
#endif
};
static_assert(sizeof(struct stCharaEffect) == 292, "expected struct stCharaEffect to be size 292");

// class stCharaFileData
// no dependencies
class stCharaFileData
{
public:
	/// No namespace types
	/// Struct member variables

	// <class ghmGcFile* file, offset 0x0>
	class ghmGcFile* file;

	// <void* pData, offset 0x4>
	void* pData;

	// <class ghmResGroup* pRsl, offset 0x8>
	class ghmResGroup* pRsl;

	// <class TGmf* pGmf, offset 0xc>
	class TGmf* pGmf;

	// <class TGmf* pGmfDead, offset 0x10>
	class TGmf* pGmfDead;

	// <class TGmf* pGmfWepR, offset 0x14>
	class TGmf* pGmfWepR;

	// <class TGmf* pGmfWepL, offset 0x18>
	class TGmf* pGmfWepL;

	// <int16_t motionNumMax, offset 0x1c>
	int16_t motionNumMax;

	// <uint8_t readyDelete, offset 0x1e>
	uint8_t readyDelete;

	// <Filler, offset 0x1f>
	char _Filler9[1];

	// <int32_t sndFileHandle, offset 0x20>
	int32_t sndFileHandle;

	// <struct HRCHARAVOICE* pVoice, offset 0x24>
	struct HRCHARAVOICE* pVoice;

	// <char FileName[0x9], offset 0x28>
	char FileName[9];

	// <Filler, offset 0x31>
	char _Filler12[3];

	// <class TGan** pGan, offset 0x34>
	class TGan** pGan;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stCharaFileData>("stCharaFileData")
			.addProperty("file", &stCharaFileData::file)
			// void type not supported in LuaBridge
			//.addProperty("pData", &stCharaFileData::pData)
			.addProperty("pRsl", &stCharaFileData::pRsl)
			.addProperty("pGmf", &stCharaFileData::pGmf)
			.addProperty("pGmfDead", &stCharaFileData::pGmfDead)
			.addProperty("pGmfWepR", &stCharaFileData::pGmfWepR)
			.addProperty("pGmfWepL", &stCharaFileData::pGmfWepL)
			.addProperty("motionNumMax", &stCharaFileData::motionNumMax)
			.addProperty("readyDelete", &stCharaFileData::readyDelete)
			.addProperty("sndFileHandle", &stCharaFileData::sndFileHandle)
			.addProperty("pVoice", &stCharaFileData::pVoice)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("FileName", &stCharaFileData::FileName)
			// pointer to pointer is not supported in LuaBridge
			//.addProperty("pGan", &stCharaFileData::pGan)
		.endClass();
	}
#endif
};
static_assert(sizeof(stCharaFileData::file) == 4, "expected file to be size 4");
static_assert(sizeof(stCharaFileData::pData) == 4, "expected pData to be size 4");
static_assert(sizeof(stCharaFileData::pRsl) == 4, "expected pRsl to be size 4");
static_assert(sizeof(stCharaFileData::pGmf) == 4, "expected pGmf to be size 4");
static_assert(sizeof(stCharaFileData::pGmfDead) == 4, "expected pGmfDead to be size 4");
static_assert(sizeof(stCharaFileData::pGmfWepR) == 4, "expected pGmfWepR to be size 4");
static_assert(sizeof(stCharaFileData::pGmfWepL) == 4, "expected pGmfWepL to be size 4");
static_assert(sizeof(stCharaFileData::motionNumMax) == 2, "expected motionNumMax to be size 2");
static_assert(sizeof(stCharaFileData::readyDelete) == 1, "expected readyDelete to be size 1");
static_assert(sizeof(stCharaFileData::sndFileHandle) == 4, "expected sndFileHandle to be size 4");
static_assert(sizeof(stCharaFileData::pVoice) == 4, "expected pVoice to be size 4");
static_assert(sizeof(stCharaFileData::FileName) == 9, "expected FileName to be size 9");
static_assert(sizeof(stCharaFileData::pGan) == 4, "expected pGan to be size 4");
static_assert(sizeof(class stCharaFileData) == 56, "expected class stCharaFileData to be size 56");

// struct Vec
// no dependencies
struct Vec
{
public:
	/// No namespace types
	/// Struct member variables

	// <float x, offset 0x0>
	float x;

	// <float y, offset 0x4>
	float y;

	// <float z, offset 0x8>
	float z;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Vec>("Vec")
			.addProperty("x", &Vec::x)
			.addProperty("y", &Vec::y)
			.addProperty("z", &Vec::z)
		.endClass();
	}
#endif
};
static_assert(sizeof(Vec::x) == 4, "expected x to be size 4");
static_assert(sizeof(Vec::y) == 4, "expected y to be size 4");
static_assert(sizeof(Vec::z) == 4, "expected z to be size 4");
static_assert(sizeof(struct Vec) == 12, "expected struct Vec to be size 12");

// class ghmSegment
// 1 dependencies: struct Vec
class ghmSegment
{
public:
	/// No namespace types
	/// Struct member variables

	// <struct Vec mCenter, offset 0x0>
	struct Vec mCenter;

	// <struct Vec mDir, offset 0xc>
	struct Vec mDir;

	// <float mExtent, offset 0x18>
	float mExtent;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmSegment>("ghmSegment")
			.addProperty("mCenter", &ghmSegment::mCenter)
			.addProperty("mDir", &ghmSegment::mDir)
			.addProperty("mExtent", &ghmSegment::mExtent)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmSegment::mCenter) == 12, "expected mCenter to be size 12");
static_assert(sizeof(ghmSegment::mDir) == 12, "expected mDir to be size 12");
static_assert(sizeof(ghmSegment::mExtent) == 4, "expected mExtent to be size 4");
static_assert(sizeof(class ghmSegment) == 28, "expected class ghmSegment to be size 28");

// class ghmCapsule
// 2 dependencies: class ghmSegment, struct Vec
class ghmCapsule
{
public:
	/// No namespace types
	/// Struct member variables

	// <class ghmSegment mAxis, offset 0x0>
	class ghmSegment mAxis;

	// <float mRadius, offset 0x1c>
	float mRadius;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmCapsule>("ghmCapsule")
			.addProperty("mAxis", &ghmCapsule::mAxis)
			.addProperty("mRadius", &ghmCapsule::mRadius)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmCapsule::mAxis) == 28, "expected mAxis to be size 28");
static_assert(sizeof(ghmCapsule::mRadius) == 4, "expected mRadius to be size 4");
static_assert(sizeof(class ghmCapsule) == 32, "expected class ghmCapsule to be size 32");

// class ghmGcOctTreeNodeObj
// no dependencies
class ghmGcOctTreeNodeObj
{
public:
	/// No namespace types
	/// Struct member variables

	// <void* (* field_0)[0x2], offset 0x0>
	void* (* field_0)[0x2];

	// <class ghmGcOctTreeNode* mpContainer, offset 0x4>
	class ghmGcOctTreeNode* mpContainer;

	// <ghmGcOctTreeNodeObj* mpNext, offset 0x8>
	ghmGcOctTreeNodeObj* mpNext;

	// <ghmGcOctTreeNodeObj* mpPrev, offset 0xc>
	ghmGcOctTreeNodeObj* mpPrev;

	// <uint32_t mUserData, offset 0x10>
	uint32_t mUserData;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcOctTreeNodeObj>("ghmGcOctTreeNodeObj")
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &ghmGcOctTreeNodeObj::field_0)
			.addProperty("mpContainer", &ghmGcOctTreeNodeObj::mpContainer)
			.addProperty("mpNext", &ghmGcOctTreeNodeObj::mpNext)
			.addProperty("mpPrev", &ghmGcOctTreeNodeObj::mpPrev)
			.addProperty("mUserData", &ghmGcOctTreeNodeObj::mUserData)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcOctTreeNodeObj::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mpContainer) == 4, "expected mpContainer to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(ghmGcOctTreeNodeObj::mUserData) == 4, "expected mUserData to be size 4");
static_assert(sizeof(class ghmGcOctTreeNodeObj) == 20, "expected class ghmGcOctTreeNodeObj to be size 20");

// class ghmGcCollObj
// 3 dependencies: class ghmGcOctTreeNodeObj, enum ghmGcCollObj::Type, struct Vec
class ghmGcCollObj : ghmGcOctTreeNodeObj
{
public:
	/// 1 namespace types: enum ghmGcCollObj::Type

	// enum ghmGcCollObj::Type
	enum Type : uint32_t
	{
		// Enum values

		// <TYPE_TRIANGLE = 0x0>
		TYPE_TRIANGLE = 0,

		// <TYPE_SPHERE = 0x1>
		TYPE_SPHERE = 1,

		// <TYPE_AABB = 0x2>
		TYPE_AABB = 2,

		// <TYPE_OBB = 0x3>
		TYPE_OBB = 3,

		// <TYPE_CAPSULE = 0x4>
		TYPE_CAPSULE = 4,

		// <TYPE_USER = 0x5>
		TYPE_USER = 5,

		// <TYPE_INVALID = 0xffffffffffffffff>
		TYPE_INVALID = UINT32_MAX

	};


	/// Struct member variables

	// <class ghmGcOctTreeNodeObj field_0, offset 0x0>
	// class ghmGcOctTreeNodeObj Super;

	// <enum ghmGcCollObj::Type mObjType, offset 0x14>
	enum ghmGcCollObj::Type mObjType;

	// <uint32_t mGroup, offset 0x18>
	uint32_t mGroup;

	// <uint32_t mIgnoreGroup, offset 0x1c>
	uint32_t mIgnoreGroup;

	// <int32_t (* mpHitTestCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*), offset 0x20>
	int32_t (* mpHitTestCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*);

	// <int32_t (* mpHitCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*), offset 0x24>
	int32_t (* mpHitCallback)(ghmGcCollObj*, ghmGcCollObj*, class ghmGcCollObjHitResult*);

	// <struct Vec mVelocity, offset 0x28>
	struct Vec mVelocity;

	// <uint32_t mFlag, offset 0x34>
	uint32_t mFlag;

	// <uint32_t mParam[0x2], offset 0x38>
	uint32_t mParam[2];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcCollObj>("ghmGcCollObj")
			.addProperty("mObjType", &ghmGcCollObj::mObjType)
			.addProperty("mGroup", &ghmGcCollObj::mGroup)
			.addProperty("mIgnoreGroup", &ghmGcCollObj::mIgnoreGroup)
			// delegates are not supported in LuaBridge
			//.addProperty("mpHitTestCallback", &ghmGcCollObj::mpHitTestCallback)
			// delegates are not supported in LuaBridge
			//.addProperty("mpHitCallback", &ghmGcCollObj::mpHitCallback)
			.addProperty("mVelocity", &ghmGcCollObj::mVelocity)
			.addProperty("mFlag", &ghmGcCollObj::mFlag)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mParam", &ghmGcCollObj::mParam)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcCollObj::mObjType) == 4, "expected mObjType to be size 4");
static_assert(sizeof(ghmGcCollObj::mGroup) == 4, "expected mGroup to be size 4");
static_assert(sizeof(ghmGcCollObj::mIgnoreGroup) == 4, "expected mIgnoreGroup to be size 4");
static_assert(sizeof(ghmGcCollObj::mpHitTestCallback) == 4, "expected mpHitTestCallback to be size 4");
static_assert(sizeof(ghmGcCollObj::mpHitCallback) == 4, "expected mpHitCallback to be size 4");
static_assert(sizeof(ghmGcCollObj::mVelocity) == 12, "expected mVelocity to be size 12");
static_assert(sizeof(ghmGcCollObj::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(ghmGcCollObj::mParam) == 8, "expected mParam to be size 8");
static_assert(sizeof(class ghmGcCollObj) == 64, "expected class ghmGcCollObj to be size 64");

// class ghmGcCollObjCapsule
// 6 dependencies: class ghmGcCollObj, class ghmGcOctTreeNodeObj, enum ghmGcCollObj::Type, struct Vec, class ghmCapsule, class ghmSegment
class ghmGcCollObjCapsule : ghmGcCollObj
{
public:
	/// No namespace types
	/// Struct member variables

	// <class ghmGcCollObj field_0, offset 0x0>
	// class ghmGcCollObj Super;

	// <class ghmCapsule mShape, offset 0x40>
	class ghmCapsule mShape;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcCollObjCapsule>("ghmGcCollObjCapsule")
			.addProperty("mShape", &ghmGcCollObjCapsule::mShape)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcCollObjCapsule::mShape) == 32, "expected mShape to be size 32");
static_assert(sizeof(class ghmGcCollObjCapsule) == 96, "expected class ghmGcCollObjCapsule to be size 96");

// class WAnim
// no dependencies
class WAnim
{
public:
	/// No namespace types
	/// Struct member variables

	// <void* (* field_0)[0x1], offset 0x0>
	void* (* field_0)[0x1];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WAnim>("WAnim")
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &WAnim::field_0)
		.endClass();
	}
#endif
};
static_assert(sizeof(WAnim::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(class WAnim) == 4, "expected class WAnim to be size 4");

// class WAnimF
// 1 dependencies: class WAnim
class WAnimF : WAnim
{
public:
	/// No namespace types
	/// Struct member variables

	// <class WAnim field_0, offset 0x0>
	// class WAnim Super;

	// <float mCurValue, offset 0x4>
	float mCurValue;

	// <float mDstValue, offset 0x8>
	float mDstValue;

	// <float mSrcValue, offset 0xc>
	float mSrcValue;

	// <uint32_t mCount, offset 0x10>
	uint32_t mCount;

	// <uint32_t mTime, offset 0x14>
	uint32_t mTime;

	// <int32_t mIpType, offset 0x18>
	int32_t mIpType;

	// <float mMotionRate, offset 0x1c>
	float mMotionRate;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WAnimF>("WAnimF")
			.addProperty("mCurValue", &WAnimF::mCurValue)
			.addProperty("mDstValue", &WAnimF::mDstValue)
			.addProperty("mSrcValue", &WAnimF::mSrcValue)
			.addProperty("mCount", &WAnimF::mCount)
			.addProperty("mTime", &WAnimF::mTime)
			.addProperty("mIpType", &WAnimF::mIpType)
			.addProperty("mMotionRate", &WAnimF::mMotionRate)
		.endClass();
	}
#endif
};
static_assert(sizeof(WAnimF::mCurValue) == 4, "expected mCurValue to be size 4");
static_assert(sizeof(WAnimF::mDstValue) == 4, "expected mDstValue to be size 4");
static_assert(sizeof(WAnimF::mSrcValue) == 4, "expected mSrcValue to be size 4");
static_assert(sizeof(WAnimF::mCount) == 4, "expected mCount to be size 4");
static_assert(sizeof(WAnimF::mTime) == 4, "expected mTime to be size 4");
static_assert(sizeof(WAnimF::mIpType) == 4, "expected mIpType to be size 4");
static_assert(sizeof(WAnimF::mMotionRate) == 4, "expected mMotionRate to be size 4");
static_assert(sizeof(class WAnimF) == 32, "expected class WAnimF to be size 32");

// struct stDamageInfo
// 3 dependencies: struct Vec, class WAnimF, class WAnim
struct stDamageInfo
{
public:
	/// No namespace types
	/// Struct member variables

	// <float dmg, offset 0x0>
	float dmg;

	// <int32_t dmgMot, offset 0x4>
	int32_t dmgMot;

	// <int32_t grdMot, offset 0x8>
	int32_t grdMot;

	// <int32_t atkMot, offset 0xc>
	int32_t atkMot;

	// <int32_t atkKind, offset 0x10>
	int32_t atkKind;

	// <float dmgDirec, offset 0x14>
	float dmgDirec;

	// <float nockBackSpd, offset 0x18>
	float nockBackSpd;

	// <float nockBackDst, offset 0x1c>
	float nockBackDst;

	// <struct Vec nockBackDir, offset 0x20>
	struct Vec nockBackDir;

	// <float nockBackMasatu, offset 0x2c>
	float nockBackMasatu;

	// <float upperPow, offset 0x30>
	float upperPow;

	// <float upperPowLast, offset 0x34>
	float upperPowLast;

	// <float upperPosY, offset 0x38>
	float upperPosY;

	// <float grav, offset 0x3c>
	float grav;

	// <uint8_t upper, offset 0x40>
	uint8_t upper;

	// <Filler, offset 0x41>
	char _Filler15[3];

	// <int32_t tick, offset 0x44>
	int32_t tick;

	// <class WAnimF fade, offset 0x48>
	class WAnimF fade;

	// <uint8_t m_PiyoRequest, offset 0x68>
	uint8_t m_PiyoRequest;

	// <uint8_t m_BikeDeadRequest, offset 0x69>
	uint8_t m_BikeDeadRequest;

	// <Filler, offset 0x6a>
	char _Filler[2];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stDamageInfo>("stDamageInfo")
			.addProperty("dmg", &stDamageInfo::dmg)
			.addProperty("dmgMot", &stDamageInfo::dmgMot)
			.addProperty("grdMot", &stDamageInfo::grdMot)
			.addProperty("atkMot", &stDamageInfo::atkMot)
			.addProperty("atkKind", &stDamageInfo::atkKind)
			.addProperty("dmgDirec", &stDamageInfo::dmgDirec)
			.addProperty("nockBackSpd", &stDamageInfo::nockBackSpd)
			.addProperty("nockBackDst", &stDamageInfo::nockBackDst)
			.addProperty("nockBackDir", &stDamageInfo::nockBackDir)
			.addProperty("nockBackMasatu", &stDamageInfo::nockBackMasatu)
			.addProperty("upperPow", &stDamageInfo::upperPow)
			.addProperty("upperPowLast", &stDamageInfo::upperPowLast)
			.addProperty("upperPosY", &stDamageInfo::upperPosY)
			.addProperty("grav", &stDamageInfo::grav)
			.addProperty("upper", &stDamageInfo::upper)
			.addProperty("tick", &stDamageInfo::tick)
			.addProperty("fade", &stDamageInfo::fade)
			.addProperty("m_PiyoRequest", &stDamageInfo::m_PiyoRequest)
			.addProperty("m_BikeDeadRequest", &stDamageInfo::m_BikeDeadRequest)
		.endClass();
	}
#endif
};
static_assert(sizeof(stDamageInfo::dmg) == 4, "expected dmg to be size 4");
static_assert(sizeof(stDamageInfo::dmgMot) == 4, "expected dmgMot to be size 4");
static_assert(sizeof(stDamageInfo::grdMot) == 4, "expected grdMot to be size 4");
static_assert(sizeof(stDamageInfo::atkMot) == 4, "expected atkMot to be size 4");
static_assert(sizeof(stDamageInfo::atkKind) == 4, "expected atkKind to be size 4");
static_assert(sizeof(stDamageInfo::dmgDirec) == 4, "expected dmgDirec to be size 4");
static_assert(sizeof(stDamageInfo::nockBackSpd) == 4, "expected nockBackSpd to be size 4");
static_assert(sizeof(stDamageInfo::nockBackDst) == 4, "expected nockBackDst to be size 4");
static_assert(sizeof(stDamageInfo::nockBackDir) == 12, "expected nockBackDir to be size 12");
static_assert(sizeof(stDamageInfo::nockBackMasatu) == 4, "expected nockBackMasatu to be size 4");
static_assert(sizeof(stDamageInfo::upperPow) == 4, "expected upperPow to be size 4");
static_assert(sizeof(stDamageInfo::upperPowLast) == 4, "expected upperPowLast to be size 4");
static_assert(sizeof(stDamageInfo::upperPosY) == 4, "expected upperPosY to be size 4");
static_assert(sizeof(stDamageInfo::grav) == 4, "expected grav to be size 4");
static_assert(sizeof(stDamageInfo::upper) == 1, "expected upper to be size 1");
static_assert(sizeof(stDamageInfo::tick) == 4, "expected tick to be size 4");
static_assert(sizeof(stDamageInfo::fade) == 32, "expected fade to be size 32");
static_assert(sizeof(stDamageInfo::m_PiyoRequest) == 1, "expected m_PiyoRequest to be size 1");
static_assert(sizeof(stDamageInfo::m_BikeDeadRequest) == 1, "expected m_BikeDeadRequest to be size 1");
static_assert(sizeof(struct stDamageInfo) == 108, "expected struct stDamageInfo to be size 108");

// class ghmTriangle
// no dependencies
class ghmTriangle
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[36];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmTriangle>("ghmTriangle")
		.endClass();
	}
#endif
};
static_assert(sizeof(class ghmTriangle) == 36, "expected class ghmTriangle to be size 36");

// class ghmPlane
// 1 dependencies: struct Vec
class ghmPlane
{
public:
	/// No namespace types
	/// Struct member variables

	// <struct Vec mNormal, offset 0x0>
	struct Vec mNormal;

	// <float mDist, offset 0xc>
	float mDist;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmPlane>("ghmPlane")
			.addProperty("mNormal", &ghmPlane::mNormal)
			.addProperty("mDist", &ghmPlane::mDist)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmPlane::mNormal) == 12, "expected mNormal to be size 12");
static_assert(sizeof(ghmPlane::mDist) == 4, "expected mDist to be size 4");
static_assert(sizeof(class ghmPlane) == 16, "expected class ghmPlane to be size 16");

// class ghmGcCollObjHitResultObj
// 3 dependencies: class ghmPlane, struct Vec, class ghmTriangle
class ghmGcCollObjHitResultObj
{
public:
	/// No namespace types
	/// Struct member variables

	// <class ghmPlane mPlane, offset 0x0>
	class ghmPlane mPlane;

	// <class ghmTriangle mTriangle, offset 0x10>
	class ghmTriangle mTriangle;

	// <struct Vec mPoint, offset 0x34>
	struct Vec mPoint;

	// <float mRate, offset 0x40>
	float mRate;

	// <uint32_t mAttr, offset 0x44>
	uint32_t mAttr;

	// <class ghmGcCollObj* mpObj, offset 0x48>
	class ghmGcCollObj* mpObj;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcCollObjHitResultObj>("ghmGcCollObjHitResultObj")
			.addProperty("mPlane", &ghmGcCollObjHitResultObj::mPlane)
			.addProperty("mTriangle", &ghmGcCollObjHitResultObj::mTriangle)
			.addProperty("mPoint", &ghmGcCollObjHitResultObj::mPoint)
			.addProperty("mRate", &ghmGcCollObjHitResultObj::mRate)
			.addProperty("mAttr", &ghmGcCollObjHitResultObj::mAttr)
			.addProperty("mpObj", &ghmGcCollObjHitResultObj::mpObj)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcCollObjHitResultObj::mPlane) == 16, "expected mPlane to be size 16");
static_assert(sizeof(ghmGcCollObjHitResultObj::mTriangle) == 36, "expected mTriangle to be size 36");
static_assert(sizeof(ghmGcCollObjHitResultObj::mPoint) == 12, "expected mPoint to be size 12");
static_assert(sizeof(ghmGcCollObjHitResultObj::mRate) == 4, "expected mRate to be size 4");
static_assert(sizeof(ghmGcCollObjHitResultObj::mAttr) == 4, "expected mAttr to be size 4");
static_assert(sizeof(ghmGcCollObjHitResultObj::mpObj) == 4, "expected mpObj to be size 4");
static_assert(sizeof(class ghmGcCollObjHitResultObj) == 76, "expected class ghmGcCollObjHitResultObj to be size 76");

// enum enCharaCondition
enum enCharaCondition : uint32_t
{
	// Enum values

	// <eGood = 0x0>
	eGood = 0,

	// <eDamaging = 0x1>
	eDamaging = 1,

	// <eDying = 0x2>
	eDying = 2,

	// <eDead = 0x3>
	eDead = 3,

	// <eBossDead = 0x4>
	eBossDead = 4,

	// <eConditionInit = 0x5>
	eConditionInit = 5,

	// <eConditionMax = 0x6>
	eConditionMax = 6

};

// struct stVec
// 2 dependencies: class WAnimF, class WAnim
struct stVec
{
public:
	/// No namespace types
	/// Struct member variables

	// <class WAnimF x, offset 0x0>
	class WAnimF x;

	// <class WAnimF y, offset 0x20>
	class WAnimF y;

	// <class WAnimF z, offset 0x40>
	class WAnimF z;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stVec>("stVec")
			.addProperty("x", &stVec::x)
			.addProperty("y", &stVec::y)
			.addProperty("z", &stVec::z)
		.endClass();
	}
#endif
};
static_assert(sizeof(stVec::x) == 32, "expected x to be size 32");
static_assert(sizeof(stVec::y) == 32, "expected y to be size 32");
static_assert(sizeof(stVec::z) == 32, "expected z to be size 32");
static_assert(sizeof(struct stVec) == 96, "expected struct stVec to be size 96");

// struct Quaternion
// no dependencies
struct Quaternion
{
public:
	/// No namespace types
	/// Struct member variables

	// <float x, offset 0x0>
	float x;

	// <float y, offset 0x4>
	float y;

	// <float z, offset 0x8>
	float z;

	// <float w, offset 0xc>
	float w;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<Quaternion>("Quaternion")
			.addProperty("x", &Quaternion::x)
			.addProperty("y", &Quaternion::y)
			.addProperty("z", &Quaternion::z)
			.addProperty("w", &Quaternion::w)
		.endClass();
	}
#endif
};
static_assert(sizeof(Quaternion::x) == 4, "expected x to be size 4");
static_assert(sizeof(Quaternion::y) == 4, "expected y to be size 4");
static_assert(sizeof(Quaternion::z) == 4, "expected z to be size 4");
static_assert(sizeof(Quaternion::w) == 4, "expected w to be size 4");
static_assert(sizeof(struct Quaternion) == 16, "expected struct Quaternion to be size 16");

// enum enCharaType
enum enCharaType : uint32_t
{
	// Enum values

	// <eCharaTypeNone = 0x0>
	eCharaTypeNone = 0,

	// <eCharaTypePC = 0x1>
	eCharaTypePC = 1,

	// <CHARACTER_TYPE_ZAKO_BEGIN = 0x2>
	CHARACTER_TYPE_ZAKO_BEGIN = 2,

	// <eCharaTypeZKPipe = 0x3>
	eCharaTypeZKPipe = 3,

	// <eCharaTypeZKBat = 0x4>
	eCharaTypeZKBat = 4,

	// <eCharaTypeZKHandGun = 0x5>
	eCharaTypeZKHandGun = 5,

	// <eCharaTypeZKSubMachineGun = 0x6>
	eCharaTypeZKSubMachineGun = 6,

	// <eCharaTypeZKKnife = 0x7>
	eCharaTypeZKKnife = 7,

	// <eCharaTypeZKKakuto = 0x8>
	eCharaTypeZKKakuto = 8,

	// <eCharaTypeZKNihonto = 0x9>
	eCharaTypeZKNihonto = 9,

	// <eCharaTypeZKBeamKatana = 0xa>
	eCharaTypeZKBeamKatana = 10,

	// <eCharaTypeZKWarPick = 0xb>
	eCharaTypeZKWarPick = 11,

	// <eCharaTypeZKChainSaw = 0xc>
	eCharaTypeZKChainSaw = 12,

	// <eCharaTypeZKFiveNata = 0xd>
	eCharaTypeZKFiveNata = 13,

	// <eCharaTypeZKFiveHandGun = 0xe>
	eCharaTypeZKFiveHandGun = 14,

	// <eCharaTypeZKFiveMachineGun = 0xf>
	eCharaTypeZKFiveMachineGun = 15,

	// <CHARACTER_TYPE_ZAKO_END = 0x10>
	CHARACTER_TYPE_ZAKO_END = 16,

	// <CHARACTER_TYPE_BOSS_BEGIN = 0x11>
	CHARACTER_TYPE_BOSS_BEGIN = 17,

	// <eCharaTypeSKE = 0x12>
	eCharaTypeSKE = 18,

	// <eCharaTypeSPU = 0x13>
	eCharaTypeSPU = 19,

	// <eCharaTypeDSL = 0x14>
	eCharaTypeDSL = 20,

	// <eCharaTypeDSR = 0x15>
	eCharaTypeDSR = 21,

	// <eCharaTypeGSR = 0x16>
	eCharaTypeGSR = 22,

	// <eCharaTypePOP = 0x17>
	eCharaTypePOP = 23,

	// <eCharaTypeJPY = 0x18>
	eCharaTypeJPY = 24,

	// <eCharaTypeGYN = 0x19>
	eCharaTypeGYN = 25,

	// <eCharaTypeMGN = 0x1a>
	eCharaTypeMGN = 26,

	// <eCharaTypeMOE = 0x1b>
	eCharaTypeMOE = 27,

	// <eCharaTypeLEZ = 0x1c>
	eCharaTypeLEZ = 28,

	// <eCharaTypeCEW = 0x1d>
	eCharaTypeCEW = 29,

	// <eCharaTypeJBJA = 0x1e>
	eCharaTypeJBJA = 30,

	// <eCharaTypeJBJB = 0x1f>
	eCharaTypeJBJB = 31,

	// <eCharaTypeJBJC = 0x20>
	eCharaTypeJBJC = 32,

	// <eCharaTypeAST = 0x21>
	eCharaTypeAST = 33,

	// <eCharaTypeRKT = 0x22>
	eCharaTypeRKT = 34,

	// <eCharaTypeGLB = 0x23>
	eCharaTypeGLB = 35,

	// <eCharaTypeSDP = 0x24>
	eCharaTypeSDP = 36,

	// <eCharaTypeBIKJPY = 0x25>
	eCharaTypeBIKJPY = 37,

	// <CHARACTER_TYPE_BOSS_END = 0x26>
	CHARACTER_TYPE_BOSS_END = 38,

	// <eCharaTypePatroller = 0x27>
	eCharaTypePatroller = 39,

	// <eCharaTypeZKCar_Sedan = 0x28>
	eCharaTypeZKCar_Sedan = 40,

	// <eCharaTypeZKCar_Van = 0x29>
	eCharaTypeZKCar_Van = 41,

	// <eCharaTypePhotoCat = 0x2a>
	eCharaTypePhotoCat = 42,

	// <eCharaTypeFCA = 0x2b>
	eCharaTypeFCA = 43,

	// <eCharaTypeCommonNpc = 0x2c>
	eCharaTypeCommonNpc = 44,

	// <eCharaTypeScorpion = 0x2d>
	eCharaTypeScorpion = 45,

	// <eCharaTypeHelicopter = 0x2e>
	eCharaTypeHelicopter = 46,

	// <eCharaTypeCommonNpc_BUG = 0x2f>
	eCharaTypeCommonNpc_BUG = 47,

	// <eCharaTypeCommonNpc_PIPE = 0x30>
	eCharaTypeCommonNpc_PIPE = 48,

	// <eCharaTypeCommonNpc_COCONUT = 0x31>
	eCharaTypeCommonNpc_COCONUT = 49,

	// <eCharaTypeCommonNpc_DEBLI = 0x32>
	eCharaTypeCommonNpc_DEBLI = 50,

	// <eCharaTypeCommonNpc_PIZZA = 0x33>
	eCharaTypeCommonNpc_PIZZA = 51,

	// <eCharaTypeCommonNpc_TILE = 0x34>
	eCharaTypeCommonNpc_TILE = 52,

	// <eCharaTypeCommonNpc_STEAK = 0x35>
	eCharaTypeCommonNpc_STEAK = 53,

	// <eCharaTypeCommonNpc_SCORPION = 0x36>
	eCharaTypeCommonNpc_SCORPION = 54,

	// <eCharaTypeCommonNpc_CAR_BUG = 0x37>
	eCharaTypeCommonNpc_CAR_BUG = 55,

	// <eCharaTypeCommonNpc_CAR_PIPE = 0x38>
	eCharaTypeCommonNpc_CAR_PIPE = 56,

	// <eCharaTypeCommonNpc_CAR_COCONUT = 0x39>
	eCharaTypeCommonNpc_CAR_COCONUT = 57,

	// <eCharaTypeCommonNpc_CAR_DEBLI = 0x3a>
	eCharaTypeCommonNpc_CAR_DEBLI = 58,

	// <eCharaTypeCommonNpc_CAR_TILE = 0x3b>
	eCharaTypeCommonNpc_CAR_TILE = 59,

	// <eCharaTypeCommonNpc_CAR_STEAK = 0x3c>
	eCharaTypeCommonNpc_CAR_STEAK = 60,

	// <eCharaTypeCommonNpc_CAR_SCORPION = 0x3d>
	eCharaTypeCommonNpc_CAR_SCORPION = 61,

	// <eCharaTypeCmnObj = 0x3e8>
	eCharaTypeCmnObj = 1000,

	// <eCharaTypePlayerWeapon = 0x3e9>
	eCharaTypePlayerWeapon = 1001,

	// <eCustomColliderObject = 0x3ea>
	eCustomColliderObject = 1002

};

// struct stCharaStatus
// 17 dependencies: enum enCharaType, struct Vec, struct Quaternion, struct stVec, class WAnimF, class WAnim, enum enCharaCondition, class ghmGcCollObjHitResultObj, class ghmPlane, class ghmTriangle, struct stDamageInfo, class ghmGcCollObjCapsule, class ghmGcCollObj, class ghmGcOctTreeNodeObj, enum ghmGcCollObj::Type, class ghmCapsule, class ghmSegment
struct stCharaStatus
{
public:
	/// No namespace types
	/// Struct member variables

	// <int32_t resNo, offset 0x0>
	int32_t resNo;

	// <int32_t datNo, offset 0x4>
	int32_t datNo;

	// <enum enCharaType charaType, offset 0x8>
	enum enCharaType charaType;

	// <int16_t zakoWepType, offset 0xc>
	int16_t zakoWepType;

	// <Filler, offset 0xe>
	char _Filler4[2];

	// <float maxHp, offset 0x10>
	float maxHp;

	// <float hp, offset 0x14>
	float hp;

	// <int16_t money, offset 0x18>
	int16_t money;

	// <int16_t dropMoney, offset 0x1a>
	int16_t dropMoney;

	// <float tension, offset 0x1c>
	float tension;

	// <float hajikiCount, offset 0x20>
	float hajikiCount;

	// <uint8_t alwaysCheckHitColl, offset 0x24>
	uint8_t alwaysCheckHitColl;

	// <Filler, offset 0x25>
	char _Filler11[3];

	// <struct Vec pos, offset 0x28>
	struct Vec pos;

	// <struct Vec beforePos, offset 0x34>
	struct Vec beforePos;

	// <struct Vec oldPos, offset 0x40>
	struct Vec oldPos;

	// <struct Vec navelPos, offset 0x4c>
	struct Vec navelPos;

	// <struct Vec brainPos, offset 0x58>
	struct Vec brainPos;

	// <struct Vec rot, offset 0x64>
	struct Vec rot;

	// <struct Vec scale, offset 0x70>
	struct Vec scale;

	// <struct Quaternion qRot, offset 0x7c>
	struct Quaternion qRot;

	// <float movSpd, offset 0x8c>
	float movSpd;

	// <float hitSize, offset 0x90>
	float hitSize;

	// <float height, offset 0x94>
	float height;

	// <struct stVec aPos, offset 0x98>
	struct stVec aPos;

	// <struct stVec aRot, offset 0xf8>
	struct stVec aRot;

	// <int32_t enterPattern, offset 0x158>
	int32_t enterPattern;

	// <float reactionDist, offset 0x15c>
	float reactionDist;

	// <int32_t itemNo, offset 0x160>
	int32_t itemNo;

	// <int32_t mAiDefBasic, offset 0x164>
	int32_t mAiDefBasic;

	// <int32_t mAiDefCurrent, offset 0x168>
	int32_t mAiDefCurrent;

	// <int32_t mAiDefTick, offset 0x16c>
	int32_t mAiDefTick;

	// <int32_t mAiDefBaseTick, offset 0x170>
	int32_t mAiDefBaseTick;

	// <float mAiDamageCount, offset 0x174>
	float mAiDamageCount;

	// <char* pScriptProc, offset 0x178>
	char* pScriptProc;

	// <int32_t tsubazeriNum, offset 0x17c>
	int32_t tsubazeriNum;

	// <int32_t DamageAcceptFrame, offset 0x180>
	int32_t DamageAcceptFrame;

	// <int32_t motionNo, offset 0x184>
	int32_t motionNo;

	// <char motionBrendNum, offset 0x188>
	char motionBrendNum;

	// <Filler, offset 0x189>
	char _Filler37[3];

	// <float motSpd, offset 0x18c>
	float motSpd;

	// <float subMotSpd, offset 0x190>
	float subMotSpd;

	// <enum enCharaCondition condition, offset 0x194>
	enum enCharaCondition condition;

	// <class ghmGcCollObj* footHitResultObj, offset 0x198>
	class ghmGcCollObj* footHitResultObj;

	// <class ghmGcCollObjHitResult* footHitResult, offset 0x19c>
	class ghmGcCollObjHitResult* footHitResult;

	// <class ghmGcCollObjHitResultObj footHitResultObj2, offset 0x1a0>
	class ghmGcCollObjHitResultObj footHitResultObj2;

	// <class ghmGcCollObjHitResultObj HitWallObj, offset 0x1ec>
	class ghmGcCollObjHitResultObj HitWallObj;

	// <struct WGclMaterialSpec* hitWallMaterial, offset 0x238>
	struct WGclMaterialSpec* hitWallMaterial;

	// <struct Vec HitWallNormal, offset 0x23c>
	struct Vec HitWallNormal;

	// <struct stDamageInfo dmgInfo, offset 0x248>
	struct stDamageInfo dmgInfo;

	// <struct Vec mYukaNormal, offset 0x2b4>
	struct Vec mYukaNormal;

	// <int32_t mFootNumber, offset 0x2c0>
	int32_t mFootNumber;

	// <int32_t movTick, offset 0x2c4>
	int32_t movTick;

	// <int16_t hitNum, offset 0x2c8>
	int16_t hitNum;

	// <Filler, offset 0x2ca>
	char _Filler51[2];

	// <class ghmGcCollObjCapsule hitColl, offset 0x2cc>
	class ghmGcCollObjCapsule hitColl;

	// <int32_t mAiAtkLv, offset 0x32c>
	int32_t mAiAtkLv;

	// <int32_t mAiAtkClass, offset 0x330>
	int32_t mAiAtkClass;

	// <int16_t AtkAi[0xa], offset 0x334>
	int16_t AtkAi[10];

	// <int32_t renderSkipCounter, offset 0x348>
	int32_t renderSkipCounter;

	// <float renderSkipMotSpd, offset 0x34c>
	float renderSkipMotSpd;

	// <int32_t frameStop, offset 0x350>
	int32_t frameStop;

	// <float lockOnDistance, offset 0x354>
	float lockOnDistance;

	// <float lockOnDistanceHi, offset 0x358>
	float lockOnDistanceHi;

	// <float lockOnDistanceLow, offset 0x35c>
	float lockOnDistanceLow;

	// <float DrawYAdjust, offset 0x360>
	float DrawYAdjust;

	// <uint8_t bBloom, offset 0x364>
	uint8_t bBloom;

	// <uint8_t JumpBlockHit, offset 0x365>
	uint8_t JumpBlockHit;

	// <Filler, offset 0x366>
	char _Filler64[2];

	// <float AtkDisAdjust, offset 0x368>
	float AtkDisAdjust;

	// <float TubaFrmOffset, offset 0x36c>
	float TubaFrmOffset;

	// <int32_t motionNoNpc, offset 0x370>
	int32_t motionNoNpc;

	// <class WAnimF semiTransRate, offset 0x374>
	class WAnimF semiTransRate;

	// <uint32_t flag[0x2], offset 0x394>
	uint32_t flag[2];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stCharaStatus>("stCharaStatus")
			.addProperty("resNo", &stCharaStatus::resNo)
			.addProperty("datNo", &stCharaStatus::datNo)
			.addProperty("charaType", &stCharaStatus::charaType)
			.addProperty("zakoWepType", &stCharaStatus::zakoWepType)
			.addProperty("maxHp", &stCharaStatus::maxHp)
			.addProperty("hp", &stCharaStatus::hp)
			.addProperty("money", &stCharaStatus::money)
			.addProperty("dropMoney", &stCharaStatus::dropMoney)
			.addProperty("tension", &stCharaStatus::tension)
			.addProperty("hajikiCount", &stCharaStatus::hajikiCount)
			.addProperty("alwaysCheckHitColl", &stCharaStatus::alwaysCheckHitColl)
			.addProperty("pos", &stCharaStatus::pos)
			.addProperty("beforePos", &stCharaStatus::beforePos)
			.addProperty("oldPos", &stCharaStatus::oldPos)
			.addProperty("navelPos", &stCharaStatus::navelPos)
			.addProperty("brainPos", &stCharaStatus::brainPos)
			.addProperty("rot", &stCharaStatus::rot)
			.addProperty("scale", &stCharaStatus::scale)
			.addProperty("qRot", &stCharaStatus::qRot)
			.addProperty("movSpd", &stCharaStatus::movSpd)
			.addProperty("hitSize", &stCharaStatus::hitSize)
			.addProperty("height", &stCharaStatus::height)
			.addProperty("aPos", &stCharaStatus::aPos)
			.addProperty("aRot", &stCharaStatus::aRot)
			.addProperty("enterPattern", &stCharaStatus::enterPattern)
			.addProperty("reactionDist", &stCharaStatus::reactionDist)
			.addProperty("itemNo", &stCharaStatus::itemNo)
			.addProperty("mAiDefBasic", &stCharaStatus::mAiDefBasic)
			.addProperty("mAiDefCurrent", &stCharaStatus::mAiDefCurrent)
			.addProperty("mAiDefTick", &stCharaStatus::mAiDefTick)
			.addProperty("mAiDefBaseTick", &stCharaStatus::mAiDefBaseTick)
			.addProperty("mAiDamageCount", &stCharaStatus::mAiDamageCount)
			// native pointer type (char*) not supported in LuaBridge (needs wrapper function)
			//.addProperty("pScriptProc", &stCharaStatus::pScriptProc)
			.addProperty("tsubazeriNum", &stCharaStatus::tsubazeriNum)
			.addProperty("DamageAcceptFrame", &stCharaStatus::DamageAcceptFrame)
			.addProperty("motionNo", &stCharaStatus::motionNo)
			.addProperty("motionBrendNum", &stCharaStatus::motionBrendNum)
			.addProperty("motSpd", &stCharaStatus::motSpd)
			.addProperty("subMotSpd", &stCharaStatus::subMotSpd)
			.addProperty("condition", &stCharaStatus::condition)
			.addProperty("footHitResultObj", &stCharaStatus::footHitResultObj)
			.addProperty("footHitResult", &stCharaStatus::footHitResult)
			.addProperty("footHitResultObj2", &stCharaStatus::footHitResultObj2)
			.addProperty("HitWallObj", &stCharaStatus::HitWallObj)
			.addProperty("hitWallMaterial", &stCharaStatus::hitWallMaterial)
			.addProperty("HitWallNormal", &stCharaStatus::HitWallNormal)
			.addProperty("dmgInfo", &stCharaStatus::dmgInfo)
			.addProperty("mYukaNormal", &stCharaStatus::mYukaNormal)
			.addProperty("mFootNumber", &stCharaStatus::mFootNumber)
			.addProperty("movTick", &stCharaStatus::movTick)
			.addProperty("hitNum", &stCharaStatus::hitNum)
			.addProperty("hitColl", &stCharaStatus::hitColl)
			.addProperty("mAiAtkLv", &stCharaStatus::mAiAtkLv)
			.addProperty("mAiAtkClass", &stCharaStatus::mAiAtkClass)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("AtkAi", &stCharaStatus::AtkAi)
			.addProperty("renderSkipCounter", &stCharaStatus::renderSkipCounter)
			.addProperty("renderSkipMotSpd", &stCharaStatus::renderSkipMotSpd)
			.addProperty("frameStop", &stCharaStatus::frameStop)
			.addProperty("lockOnDistance", &stCharaStatus::lockOnDistance)
			.addProperty("lockOnDistanceHi", &stCharaStatus::lockOnDistanceHi)
			.addProperty("lockOnDistanceLow", &stCharaStatus::lockOnDistanceLow)
			.addProperty("DrawYAdjust", &stCharaStatus::DrawYAdjust)
			.addProperty("bBloom", &stCharaStatus::bBloom)
			.addProperty("JumpBlockHit", &stCharaStatus::JumpBlockHit)
			.addProperty("AtkDisAdjust", &stCharaStatus::AtkDisAdjust)
			.addProperty("TubaFrmOffset", &stCharaStatus::TubaFrmOffset)
			.addProperty("motionNoNpc", &stCharaStatus::motionNoNpc)
			.addProperty("semiTransRate", &stCharaStatus::semiTransRate)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("flag", &stCharaStatus::flag)
		.endClass();
	}
#endif
};
static_assert(sizeof(stCharaStatus::resNo) == 4, "expected resNo to be size 4");
static_assert(sizeof(stCharaStatus::datNo) == 4, "expected datNo to be size 4");
static_assert(sizeof(stCharaStatus::charaType) == 4, "expected charaType to be size 4");
static_assert(sizeof(stCharaStatus::zakoWepType) == 2, "expected zakoWepType to be size 2");
static_assert(sizeof(stCharaStatus::maxHp) == 4, "expected maxHp to be size 4");
static_assert(sizeof(stCharaStatus::hp) == 4, "expected hp to be size 4");
static_assert(sizeof(stCharaStatus::money) == 2, "expected money to be size 2");
static_assert(sizeof(stCharaStatus::dropMoney) == 2, "expected dropMoney to be size 2");
static_assert(sizeof(stCharaStatus::tension) == 4, "expected tension to be size 4");
static_assert(sizeof(stCharaStatus::hajikiCount) == 4, "expected hajikiCount to be size 4");
static_assert(sizeof(stCharaStatus::alwaysCheckHitColl) == 1, "expected alwaysCheckHitColl to be size 1");
static_assert(sizeof(stCharaStatus::pos) == 12, "expected pos to be size 12");
static_assert(sizeof(stCharaStatus::beforePos) == 12, "expected beforePos to be size 12");
static_assert(sizeof(stCharaStatus::oldPos) == 12, "expected oldPos to be size 12");
static_assert(sizeof(stCharaStatus::navelPos) == 12, "expected navelPos to be size 12");
static_assert(sizeof(stCharaStatus::brainPos) == 12, "expected brainPos to be size 12");
static_assert(sizeof(stCharaStatus::rot) == 12, "expected rot to be size 12");
static_assert(sizeof(stCharaStatus::scale) == 12, "expected scale to be size 12");
static_assert(sizeof(stCharaStatus::qRot) == 16, "expected qRot to be size 16");
static_assert(sizeof(stCharaStatus::movSpd) == 4, "expected movSpd to be size 4");
static_assert(sizeof(stCharaStatus::hitSize) == 4, "expected hitSize to be size 4");
static_assert(sizeof(stCharaStatus::height) == 4, "expected height to be size 4");
static_assert(sizeof(stCharaStatus::aPos) == 96, "expected aPos to be size 96");
static_assert(sizeof(stCharaStatus::aRot) == 96, "expected aRot to be size 96");
static_assert(sizeof(stCharaStatus::enterPattern) == 4, "expected enterPattern to be size 4");
static_assert(sizeof(stCharaStatus::reactionDist) == 4, "expected reactionDist to be size 4");
static_assert(sizeof(stCharaStatus::itemNo) == 4, "expected itemNo to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefBasic) == 4, "expected mAiDefBasic to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefCurrent) == 4, "expected mAiDefCurrent to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefTick) == 4, "expected mAiDefTick to be size 4");
static_assert(sizeof(stCharaStatus::mAiDefBaseTick) == 4, "expected mAiDefBaseTick to be size 4");
static_assert(sizeof(stCharaStatus::mAiDamageCount) == 4, "expected mAiDamageCount to be size 4");
static_assert(sizeof(stCharaStatus::pScriptProc) == 4, "expected pScriptProc to be size 4");
static_assert(sizeof(stCharaStatus::tsubazeriNum) == 4, "expected tsubazeriNum to be size 4");
static_assert(sizeof(stCharaStatus::DamageAcceptFrame) == 4, "expected DamageAcceptFrame to be size 4");
static_assert(sizeof(stCharaStatus::motionNo) == 4, "expected motionNo to be size 4");
static_assert(sizeof(stCharaStatus::motionBrendNum) == 1, "expected motionBrendNum to be size 1");
static_assert(sizeof(stCharaStatus::motSpd) == 4, "expected motSpd to be size 4");
static_assert(sizeof(stCharaStatus::subMotSpd) == 4, "expected subMotSpd to be size 4");
static_assert(sizeof(stCharaStatus::condition) == 4, "expected condition to be size 4");
static_assert(sizeof(stCharaStatus::footHitResultObj) == 4, "expected footHitResultObj to be size 4");
static_assert(sizeof(stCharaStatus::footHitResult) == 4, "expected footHitResult to be size 4");
static_assert(sizeof(stCharaStatus::footHitResultObj2) == 76, "expected footHitResultObj2 to be size 76");
static_assert(sizeof(stCharaStatus::HitWallObj) == 76, "expected HitWallObj to be size 76");
static_assert(sizeof(stCharaStatus::hitWallMaterial) == 4, "expected hitWallMaterial to be size 4");
static_assert(sizeof(stCharaStatus::HitWallNormal) == 12, "expected HitWallNormal to be size 12");
static_assert(sizeof(stCharaStatus::dmgInfo) == 108, "expected dmgInfo to be size 108");
static_assert(sizeof(stCharaStatus::mYukaNormal) == 12, "expected mYukaNormal to be size 12");
static_assert(sizeof(stCharaStatus::mFootNumber) == 4, "expected mFootNumber to be size 4");
static_assert(sizeof(stCharaStatus::movTick) == 4, "expected movTick to be size 4");
static_assert(sizeof(stCharaStatus::hitNum) == 2, "expected hitNum to be size 2");
static_assert(sizeof(stCharaStatus::hitColl) == 96, "expected hitColl to be size 96");
static_assert(sizeof(stCharaStatus::mAiAtkLv) == 4, "expected mAiAtkLv to be size 4");
static_assert(sizeof(stCharaStatus::mAiAtkClass) == 4, "expected mAiAtkClass to be size 4");
static_assert(sizeof(stCharaStatus::AtkAi) == 20, "expected AtkAi to be size 20");
static_assert(sizeof(stCharaStatus::renderSkipCounter) == 4, "expected renderSkipCounter to be size 4");
static_assert(sizeof(stCharaStatus::renderSkipMotSpd) == 4, "expected renderSkipMotSpd to be size 4");
static_assert(sizeof(stCharaStatus::frameStop) == 4, "expected frameStop to be size 4");
static_assert(sizeof(stCharaStatus::lockOnDistance) == 4, "expected lockOnDistance to be size 4");
static_assert(sizeof(stCharaStatus::lockOnDistanceHi) == 4, "expected lockOnDistanceHi to be size 4");
static_assert(sizeof(stCharaStatus::lockOnDistanceLow) == 4, "expected lockOnDistanceLow to be size 4");
static_assert(sizeof(stCharaStatus::DrawYAdjust) == 4, "expected DrawYAdjust to be size 4");
static_assert(sizeof(stCharaStatus::bBloom) == 1, "expected bBloom to be size 1");
static_assert(sizeof(stCharaStatus::JumpBlockHit) == 1, "expected JumpBlockHit to be size 1");
static_assert(sizeof(stCharaStatus::AtkDisAdjust) == 4, "expected AtkDisAdjust to be size 4");
static_assert(sizeof(stCharaStatus::TubaFrmOffset) == 4, "expected TubaFrmOffset to be size 4");
static_assert(sizeof(stCharaStatus::motionNoNpc) == 4, "expected motionNoNpc to be size 4");
static_assert(sizeof(stCharaStatus::semiTransRate) == 32, "expected semiTransRate to be size 32");
static_assert(sizeof(stCharaStatus::flag) == 8, "expected flag to be size 8");
static_assert(sizeof(struct stCharaStatus) == 924, "expected struct stCharaStatus to be size 924");

// class ghmListObj
// no dependencies
class ghmListObj
{
public:
	/// No namespace types
	/// Struct member variables

	// <void* (* field_0)[0x6], offset 0x0>
	void* (* field_0)[0x6];

	// <ghmListObj* mpPrev, offset 0x4>
	ghmListObj* mpPrev;

	// <ghmListObj* mpNext, offset 0x8>
	ghmListObj* mpNext;

	// <int32_t mPriority, offset 0xc>
	int32_t mPriority;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmListObj>("ghmListObj")
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &ghmListObj::field_0)
			.addProperty("mpPrev", &ghmListObj::mpPrev)
			.addProperty("mpNext", &ghmListObj::mpNext)
			.addProperty("mPriority", &ghmListObj::mPriority)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmListObj::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(ghmListObj::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(ghmListObj::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(ghmListObj::mPriority) == 4, "expected mPriority to be size 4");
static_assert(sizeof(class ghmListObj) == 16, "expected class ghmListObj to be size 16");

// class mHRChara
// 25 dependencies: class ghmListObj, struct stCharaStatus, enum enCharaType, struct Vec, struct Quaternion, struct stVec, class WAnimF, class WAnim, enum enCharaCondition, class ghmGcCollObjHitResultObj, class ghmPlane, class ghmTriangle, struct stDamageInfo, class ghmGcCollObjCapsule, class ghmGcCollObj, class ghmGcOctTreeNodeObj, enum ghmGcCollObj::Type, class ghmCapsule, class ghmSegment, class stCharaFileData, struct stCharaEffect, class CAmbientShadow, class CDoubleSpringInterpolate, class CSpringInterpolate, enum enCharaInitProc
class mHRChara : ghmListObj
{
public:
	/// 363 namespace types: enum enCharaType __convention("thiscall") mHRChara::mGetCharaType(class mHRChara* const this), uint8_t mHRChara::isCharacterTypeZako(enum enCharaType arg1), uint8_t __convention("thiscall") mHRChara::mTestZako(class mHRChara* const this), uint8_t mHRChara::isCharacterTypeBoss(enum enCharaType arg1), uint8_t __convention("thiscall") mHRChara::mTestBoss(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTestEnemy(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetItemNo(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetLockOnNoCheckColl(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetLockOnDistanceLow(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetLockOnDistanceHi(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetLockOnDistance(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetCanLockOn(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetDisableDameged(class mHRChara* const this, uint8_t arg2), uint8_t __convention("thiscall") mHRChara::mGetDisableDameged(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetMaxHp(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mUndispTgtIcn(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mDispTgtIcn(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetHp(class mHRChara* const this), enum enCharaCondition __convention("thiscall") mHRChara::mGetCondition(class mHRChara* const this), class mHRChara* __convention("thiscall") mHRChara::mGetNext(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetHp(class mHRChara* const this, float arg2), class mHRChara* mHRChara::mGetTop(), struct Vec& __convention("thiscall") mHRChara::mGetRot(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetCharaPause(class mHRChara* const this, uint8_t arg2), float __convention("thiscall") mHRChara::mGetRotY(class mHRChara* const this), struct WGclMaterialSpec* __convention("thiscall") mHRChara::GetGroundTouchMaterial(class mHRChara* const this), struct stCharaStatus* __convention("thiscall") mHRChara::mGetStatusPtr(class mHRChara* const this), struct Vec& __convention("thiscall") mHRChara::mGetPos(class mHRChara* const this), int32_t __convention("thiscall") mHRChara::mGetMotionNo(class mHRChara* const this), char* __convention("thiscall") mHRChara::mGetFileName(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsTubaAngleCorrect(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::getMiraretaiPosition(class mHRChara* const this, struct Vec* arg2), uint8_t __convention("thiscall") mHRChara::isHopeInterestMe(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsWatchPc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsUseRotMov(class mHRChara* const this), char const* __convention("thiscall") mHRChara::getCurMotionName(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTestRunMotion(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mZakoDieOut(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCreateLoseSight(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckDamageMotion(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckEnterMotion(class mHRChara* const this), class TGan* __convention("thiscall") mHRChara::mpGetGan(class mHRChara* const this, int32_t arg2), class TGmf* __convention("thiscall") mHRChara::mGetCurResourceGmfPtr(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::mGetCurResourceGmfPtr(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfWepLPtr(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfWepRPtr(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetResourceGmfPtr(class mHRChara* const this, class TGmf* arg2, char* arg3), class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfDeadPtr(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfDeadPtr(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfPtr(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfPtr(class mHRChara* const this), class ghmGcCollObjCapsule* __convention("thiscall") mHRChara::mGetCollPtr(class mHRChara* const this), void __convention("thiscall") mHRChara::mSethitOidashiDisEnable(class mHRChara* const this, uint8_t arg2), struct Vec& __convention("thiscall") mHRChara::mGetBrainPos(class mHRChara* const this), struct Vec& __convention("thiscall") mHRChara::mGetHitPos(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetMirrorModel(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetVisibleDist(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetCondition(class mHRChara* const this, enum enCharaCondition arg2), void __convention("thiscall") mHRChara::mSetSubMotionSpd(class mHRChara* const this, float arg2), uint8_t __convention("thiscall") mHRChara::mCheck4tsunbai(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckSquat(class mHRChara* const this), void __convention("thiscall") mHRChara::mGetThrowMotNo(class mHRChara* const this, int32_t* arg2, int32_t* arg3), int32_t __convention("thiscall") mHRChara::mGetTsubazeriMotionID(class mHRChara* const this), void __convention("thiscall") mHRChara::mTsubazeriDifficultyClear(class mHRChara* const this), void __convention("thiscall") mHRChara::mTsubazeriDifficultyUp(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsTubaPosAdjust(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckGuard(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckAttack(class mHRChara* const this), void __convention("thiscall") mHRChara::mSubTension(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mAddTension(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetTension(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mResetTension(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetMovSpd(class mHRChara* const this, float arg2), uint8_t __convention("thiscall") mHRChara::UnderControllAttack_A(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::UnderControllComboAttack(class mHRChara* const this), void __convention("thiscall") mHRChara::ExitUnderControl(class mHRChara* const this), void __convention("thiscall") mHRChara::EnterUnderControl(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPostRenderProc(class mHRChara* const this), float __convention("thiscall") mHRChara::getViewClipBoxPositionOffsetY(class mHRChara* const this), void __convention("thiscall") mHRChara::getViewClipBoxHalfLengthXYZ(class mHRChara* const this, struct Vec* arg2), int32_t __convention("thiscall") mHRChara::mGetResNo(class mHRChara* const this), int32_t __convention("thiscall") mHRChara::mGetDropMoney(class mHRChara* const this), int32_t __convention("thiscall") mHRChara::mGetItemNo(class mHRChara* const this), void __convention("thiscall") mHRChara::setLocatorNode(class mHRChara* const this, class TGmfNode* arg2), float __convention("thiscall") mHRChara::mGetHpRate(class mHRChara* const this), void __convention("thiscall") mHRChara::mSubHp(class mHRChara* const this, float arg2), float __convention("thiscall") mHRChara::mGetHitSize(class mHRChara* const this), enum enCharaInitProc __convention("thiscall") mHRChara::mGetInitProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::isCrashBreak(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetCharaHit(class mHRChara* const this, uint8_t arg2), int32_t __convention("thiscall") mHRChara::mGetDmgAtkMot(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetMotionProcessDisEnable(class mHRChara* const this, uint8_t arg2), float __convention("thiscall") mHRChara::mGetMotionSpd(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetStageHitDisEnable(class mHRChara* const this, uint8_t arg2), uint8_t __convention("thiscall") mHRChara::IsFootShadowDraw(class mHRChara* const this), void __convention("thiscall") mHRChara::SetFootShadowDraw(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetMotionNoNpc(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetCallScriptProc(class mHRChara* const this, char* arg2), void __convention("thiscall") mHRChara::mSetDropMoney(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetReactionDist(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetEnterPattern(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetDatNo(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetResNo(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetCharaType(class mHRChara* const this, enum enCharaType arg2), int32_t __convention("thiscall") mHRChara::mGetDatNo(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetResourceDeleteFlag(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetDmgUpperPosY(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetDmgUpper(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetResourceDeleteFlag(class mHRChara* const this, uint8_t arg2), class ghmPlane& __convention("thiscall") mHRChara::getLatestGroundTouchPlane(class mHRChara* const this), void __convention("thiscall") mHRChara::mUndispBtlIcn(class mHRChara* const this), void __convention("thiscall") mHRChara::mChgBtlIcnTb(class mHRChara* const this), void __convention("thiscall") mHRChara::SetDrawYAdjust(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetDemoCtrl(class mHRChara* const this, uint8_t arg2), uint64_t __convention("thiscall") mHRChara::mGetDemoCtrl(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::isAcceptDistanceDelete(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetStageHitDisEnableReq(class mHRChara* const this, uint8_t arg2), struct stCharaEffect* __convention("thiscall") mHRChara::mGetEffectStPtr(class mHRChara* const this), void __convention("thiscall") mHRChara::setBlackBodyEffect(class mHRChara* const this, class EffectEnemyDamage* arg2), struct Vec& __convention("thiscall") mHRChara::mGetNavelPos(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetDamageAcceptFrame(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetAlwaysCheckHitColl(class mHRChara* const this, uint8_t arg2), uint8_t __convention("thiscall") mHRChara::mGetLockOnNoCheckColl(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetLockOnDistanceLow(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetLockOnDistanceHi(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetLockOnDistance(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetAliveBtlIcn(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetSlowBlow(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetInputFinishReq(class mHRChara* const this, uint8_t arg2), class TGan* __convention("thiscall") mHRChara::mGetResourceGanPtr(class mHRChara* const this, int32_t arg2), int16_t __convention("thiscall") mHRChara::mGetMoney(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetMoney(class mHRChara* const this, int16_t arg2), uint8_t __convention("thiscall") mHRChara::mGetInputFinishReq(class mHRChara* const this), void __convention("thiscall") mHRChara::mAddMoney(class mHRChara* const this, int16_t arg2), void __convention("thiscall") mHRChara::mSetInvincibleMotion(class mHRChara* const this, int32_t arg2, int32_t arg3), void __convention("thiscall") mHRChara::mResetInvincibleMotion(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCanGetHitByMotion(class mHRChara* const this, int32_t arg2), uint8_t __convention("thiscall") mHRChara::mDispAtkHitIcn(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetDontStandUp(class mHRChara* const this), float __convention("thiscall") mHRChara::GetTubaFrmOffset(class mHRChara* const this), float __convention("thiscall") mHRChara::GetAtkDisAdjust(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetLoseTsubazeriFlag(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetSuccessThrow(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetRotYA(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mSetDontStandUp(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetDmgGrav(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mChgBtlIcnSml(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mChgBtlIcnBig(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetCharaHit(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetCanLockOn(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGethitOidashiDisEnable(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetWepVisible(class mHRChara* const this), int32_t __convention("thiscall") mHRChara::mGetMotionBrendNum(class mHRChara* const this), int16_t __convention("thiscall") mHRChara::mGetAiValue(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mResetPosA(class mHRChara* const this), class ghmPlane& __convention("thiscall") mHRChara::getEasyShadowProjectionPlane(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::isInterestTarget(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetMotionSpd(class mHRChara* const this, float arg2), uint8_t __convention("thiscall") mHRChara::mGetWepEffectVisible(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetVisible(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetTension(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetMiniMapRender(class mHRChara* const this), class ghmResGroup* __convention("thiscall") mHRChara::mGetResourceRslPtr(class mHRChara* const this), int32_t __convention("thiscall") mHRChara::getFootNumber(class mHRChara* const this), void* __convention("thiscall") mHRChara::`vector deleting destructor'(class mHRChara* const this, uint32_t arg2), char* __convention("thiscall") mHRChara::mGetCallScriptProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetMotionProcessDisEnable(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsBloom(class mHRChara* const this), void __convention("thiscall") mHRChara::SetTermAll(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::SetKnockBackSpd(class mHRChara* const this, float arg2), float __convention("thiscall") mHRChara::GetKnockBackSpd(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetStageHitDisEnable(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetStartSplitFlameFlag(class mHRChara* const this), class TGmf* __convention("thiscall") mHRChara::getBoneEffectGmf(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetStartSplitFlameFlag(class mHRChara* const this, uint8_t arg2), uint8_t __convention("thiscall") mHRChara::mGetCharaPause(class mHRChara* const this), struct Vec& __convention("thiscall") mHRChara::mGetBeforePos(class mHRChara* const this), int16_t __convention("thiscall") mHRChara::mGetZakoWepType(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetFootHitResultObj2(class mHRChara* const this, class ghmGcCollObjHitResultObj& arg2), void __convention("thiscall") mHRChara::mSetDmgUpperPow(class mHRChara* const this, float arg2), void __convention("thiscall") mHRChara::mAddHp(class mHRChara* const this, float arg2), float __convention("thiscall") mHRChara::mGetSubMotionSpd(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetZakoWepType(class mHRChara* const this, int16_t arg2), void __convention("thiscall") mHRChara::mSetHitSize(class mHRChara* const this, float arg2), float __convention("thiscall") mHRChara::mGetReactionDist(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetMiniMapRender(class mHRChara* const this, uint8_t arg2), struct Vec __convention("thiscall") mHRChara::GetKnockBackDir(class mHRChara* const this), int32_t __convention("thiscall") mHRChara::mGetMotionNoNpc(class mHRChara* const this), void __convention("thiscall") mHRChara::SetNormalClip(class mHRChara* const this, uint8_t arg2), struct Vec& __convention("thiscall") mHRChara::mGetOldPos(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mGetSuccessThrow(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetDmgUpperPosY(class mHRChara* const this, float const arg2), void __convention("thiscall") mHRChara::SetDeleteReq(class mHRChara* const this), void __convention("thiscall") mHRChara::getShootPosiAndYaw(class mHRChara* const this, struct Vec* arg2, float* arg3, class TGmf& arg4, char const* arg5), void __convention("thiscall") mHRChara::setHomingPositionFromAI(class mHRChara* const this, struct Vec& arg2), void __convention("thiscall") mHRChara::setHomingActFlagFromAI(class mHRChara* const this, uint8_t const arg2), uint8_t __convention("thiscall") mHRChara::isHoming(class mHRChara* const this), void __convention("thiscall") mHRChara::setInterestUseBoneNumFromAI(class mHRChara* const this, int32_t const arg2), uint8_t __convention("thiscall") mHRChara::isInteresting(class mHRChara* const this), void __convention("thiscall") mHRChara::addDamageToYuremono(class mHRChara* const this, float const arg2, struct Vec& arg3), uint8_t __convention("thiscall") mHRChara::mSetHajikiCheck(class mHRChara* const this, float arg2), uint8_t __convention("thiscall") mHRChara::mCheckDamageAccept(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTestZakoDown(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTestPiyoRequest(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetPiyoriHeight(class mHRChara* const this), class mHRChara* mHRChara::mGetCharaPtr(int32_t arg1), void mHRChara::mRenderGmf(void* arg1), int32_t mHRChara::debugDispCharaInfo(), uint8_t mHRChara::mTermAllZakoMotion(), uint8_t mHRChara::mInitAllNpc(), void __convention("thiscall") mHRChara::mCreateBloodSplash(class mHRChara* const this, class TGmfNode* arg2, float arg3, struct tagHRTASKCHECK* arg4), void __convention("thiscall") mHRChara::mBloodSplashProc(class mHRChara* const this), void __convention("thiscall") mHRChara::AddBoneElectPtrToList(class mHRChara* const this, class EffectBoneElect* arg2), uint8_t __convention("thiscall") mHRChara::ReleaseBoneElect(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsEmtpyBoneElectList(class mHRChara* const this), void __convention("thiscall") mHRChara::DeleteBoneElectFromList(class mHRChara* const this, class EffectBoneElect* arg2), void __convention("thiscall") mHRChara::AddCutmarkPtrToList(class mHRChara* const this, class EffectCutMark* arg2), uint8_t __convention("thiscall") mHRChara::IsEmtpyCutmarkList(class mHRChara* const this), void __convention("thiscall") mHRChara::DeleteCutmarkFromList(class mHRChara* const this, class EffectCutMark* arg2), uint8_t __convention("thiscall") mHRChara::SetPowerFlash(class mHRChara* const this, int32_t arg2, struct GXColor arg3), uint8_t __convention("thiscall") mHRChara::SetNoGuardEffect(class mHRChara* const this), uint8_t mHRChara::mCheckAtkAllNpc(), uint8_t mHRChara::mCheckCanAtk(), void __convention("thiscall") mHRChara::mCallBeforeRenderProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckCanHit(class mHRChara* const this, int32_t arg2, uint8_t arg3, uint8_t arg4), void __convention("thiscall") mHRChara::CreateFootSmokeEffect(class mHRChara* const this), void __convention("thiscall") mHRChara::KnockBackProc(class mHRChara* const this), float __convention("thiscall") mHRChara::GetKnockBackRatio(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mSetDamage(class mHRChara* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10), void __convention("thiscall") mHRChara::mInitDamageMotInfo(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mChangeDefAi(class mHRChara* const this, uint8_t arg2, uint8_t arg3), void __convention("thiscall") mHRChara::mSetDefAI(class mHRChara* const this, uint8_t arg2), uint8_t __convention("thiscall") mHRChara::mCheckCallFrameProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsNowUnderControl(class mHRChara* const this), void __convention("thiscall") mHRChara::RegistUnderControlAtkFuncPtr(class mHRChara* const this), void __convention("thiscall") mHRChara::RegistUnderControlMotID(class mHRChara* const this, struct CharControlMotID& arg2), void __convention("thiscall") mHRChara::SetUnderControlFlag(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::DrawDebugCollision(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mRenderProc(class mHRChara* const this), void __convention("thiscall") mHRChara::postSetupMatrix(class mHRChara* const this), void __convention("thiscall") mHRChara::preSetupMatrix(class mHRChara* const this), void __convention("thiscall") mHRChara::mFootSmokeEffect(class mHRChara* const this), void __convention("thiscall") mHRChara::mPosAnimationProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPostFrameProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mFrameProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mInit(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetRotA(class mHRChara* const this, struct Vec& arg2, uint32_t const arg3), void __convention("thiscall") mHRChara::mSetWepEffectVisibleInstant(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSubFrameStop(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPlayMotionMov(class mHRChara* const this, int32_t arg2, float arg3, float arg4, float arg5, uint8_t arg6), uint8_t __convention("thiscall") mHRChara::mTestMotion(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::mSetDifficultyMotionSpeed(class mHRChara* const this, float arg2), class mHRChara* mHRChara::getCharaByGM2FileName(char const* arg1), void __convention("thiscall") mHRChara::mSetDeath(class mHRChara* const this), void __convention("thiscall") mHRChara::mDamageCallBackForScript(class mHRChara* const this, int32_t arg2, uint8_t arg3, enum eDmgCallBackDmgType arg4, int32_t arg5), uint8_t __convention("thiscall") mHRChara::mGetMotionPlay(class mHRChara* const this), class mHRChara* mHRChara::mGetAliveResourceCharaPtr(enum enCharaType arg1, uint32_t arg2), uint8_t __convention("thiscall") mHRChara::ReleaseCutmark(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTestPiyori(class mHRChara* const this), uint32_t __convention("thiscall") mHRChara::mGetMotionTotalTick(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::setInterestPositionFromAI(class mHRChara* const this, struct Vec& arg2), void __convention("thiscall") mHRChara::setInterestActFlagFromAI(class mHRChara* const this, uint8_t const arg2), uint8_t __convention("thiscall") mHRChara::mGetWepTopPos(class mHRChara* const this, struct Vec* arg2, enum enWepLeftRight arg3), void __convention("thiscall") mHRChara::mInitDamageStatus(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPostFrameCommonProc1(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPostFrameCommonProc2(class mHRChara* const this), void __convention("thiscall") mHRChara::SetKnockBack(class mHRChara* const this, float arg2, struct Vec& arg3, float arg4), uint8_t __convention("thiscall") mHRChara::CheckWallCrashAndDamageProc(class mHRChara* const this, int32_t const arg2, int32_t const arg3), uint8_t __convention("thiscall") mHRChara::mSetHpBarVisible(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetPosA(class mHRChara* const this, struct Vec& arg2, uint32_t const arg3, int32_t const arg4), uint8_t __convention("thiscall") mHRChara::mSetSimpleHpBarVisible(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mPlayCamMotFromCharMot(class mHRChara* const this, int32_t arg2, int32_t arg3, uint8_t arg4, uint8_t arg5, uint8_t arg6), uint8_t __convention("thiscall") mHRChara::mPlayMotionMov(class mHRChara* const this, int32_t arg2, float arg3, float arg4, uint8_t arg5), void __convention("thiscall") mHRChara::checkDeleteBlackBodyEffect(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetHitCounter(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mReleaseBloodSplash(class mHRChara* const this, uint8_t arg2), uint8_t __convention("thiscall") mHRChara::mPreFrameProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPreRenderProc(class mHRChara* const this), void __convention("thiscall") mHRChara::mDetouchMotionBrend(class mHRChara* const this), void __convention("thiscall") mHRChara::mReleaseDemoBtleIcn(class mHRChara* const this), uint8_t mHRChara::isThisCharaExist(class mHRChara* arg1), uint8_t mHRChara::mTermAllNpc(), int32_t mHRChara::mGetPopZakoNum(), void __convention("thiscall") mHRChara::mDeleteDispChara(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetAiDef(class mHRChara* const this, int32_t arg2), void __convention("thiscall") mHRChara::setFootShadowDrawFlag(class mHRChara* const this, uint8_t const arg2), uint8_t mHRChara::mFrameProcAll(), uint8_t mHRChara::mRenderProcAll(uint8_t arg1), uint8_t mHRChara::mPostRenderProcAll(), uint8_t mHRChara::mTermAllNpcWithoutCmnObj(), uint8_t mHRChara::mTermAllEnemyNpc(), class mHRChara* mHRChara::mGetNpcTop(), void __convention("thiscall") mHRChara::~mHRChara(class mHRChara* const this), void __convention("thiscall") mHRChara::mHRChara(class mHRChara* const this), void __convention("thiscall") mHRChara::SetFileName(class mHRChara* const this, char const* arg2), void __convention("thiscall") mHRChara::mSetMaxHp(class mHRChara* const this, float arg2), uint8_t __convention("thiscall") mHRChara::mTerm(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetPos(class mHRChara* const this, struct Vec& arg2, uint8_t arg3, float arg4), void __convention("thiscall") mHRChara::mSetRot(class mHRChara* const this, struct Vec& arg2), void __convention("thiscall") mHRChara::mSetScale(class mHRChara* const this, struct Vec& arg2), uint8_t __convention("thiscall") mHRChara::mHitCheck(class mHRChara* const this, class mHRChara* arg2), void __convention("thiscall") mHRChara::mMotionSpeedControl(class mHRChara* const this), void __convention("thiscall") mHRChara::mCallMotionProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPlayMotion(class mHRChara* const this, int32_t arg2, uint8_t arg3, int32_t arg4, uint8_t arg5, float arg6), void __convention("thiscall") mHRChara::mCallMoneyDrop(class mHRChara* const this, int32_t arg2, uint8_t arg3, uint8_t arg4), uint8_t __convention("thiscall") mHRChara::mAttachWep(class mHRChara* const this, class TGmf* arg2, enum eUDLR arg3, char* arg4), uint8_t __convention("thiscall") mHRChara::mDetachWep(class mHRChara* const this, enum eUDLR arg2, char* arg3), void __convention("thiscall") mHRChara::mSemitransparentProcess(class mHRChara* const this), void __convention("thiscall") mHRChara::mUpdateAtkColl(class mHRChara* const this), void __convention("thiscall") mHRChara::mRenderShadowProc(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mRefreshFloorPosition(class mHRChara* const this, float arg2, uint8_t arg3), uint8_t __convention("thiscall") mHRChara::mDamageProc(class mHRChara* const this), void __convention("thiscall") mHRChara::mRestoreDamage(class mHRChara* const this, int32_t arg2, float arg3), uint8_t __convention("thiscall") mHRChara::mCheckAttack(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckCanAttack(class mHRChara* const this), void __convention("thiscall") mHRChara::mGetTsubazeriaiPos(class mHRChara* const this, struct Vec* arg2), void __convention("thiscall") mHRChara::mSetPcTsubaOuterMot(class mHRChara* const this), struct Vec __convention("thiscall") mHRChara::GetTsubaEffectPos(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckCanCatch(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckCanThrow(class mHRChara* const this), void __convention("thiscall") mHRChara::mPlayThrownMotion(class mHRChara* const this, int32_t arg2, int32_t arg3), uint8_t __convention("thiscall") mHRChara::mPlayMotionBlend(class mHRChara* const this, class TGan** arg2, char arg3), uint8_t __convention("thiscall") mHRChara::mPlayMotionBlend(class mHRChara* const this, int32_t arg2, char arg3, uint8_t arg4, uint8_t arg5), void __convention("thiscall") mHRChara::mBossDeadCommonProcess(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckCanLockOn(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::getLockOnCursorBasePosition(class mHRChara* const this, struct Vec* arg2), void __convention("thiscall") mHRChara::mSetVisible(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetWepVisible(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetWepEffectVisible(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetVisibleDist(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mEffectInit(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetMirrorModel(class mHRChara* const this, uint8_t arg2), void __convention("thiscall") mHRChara::mSetAiAtk(class mHRChara* const this, int32_t arg2, int32_t arg3), void __convention("thiscall") mHRChara::mSetWarpPos(class mHRChara* const this, struct Vec& arg2, uint8_t arg3), uint8_t __convention("thiscall") mHRChara::mHitCheckStage(class mHRChara* const this, class ghmGcCollObjCapsule* arg2, struct Vec* arg3, struct Vec* arg4, struct Vec* arg5, struct Vec* arg6, class ghmGcCollObj** arg7, class ghmGcCollObjHitResult** arg8, class ghmGcCollObjHitResultObj* arg9, struct WGclMaterialSpec** arg10, uint8_t* arg11, uint8_t arg12, float arg13), class TGan* __convention("thiscall") mHRChara::mpGetGan(class mHRChara* const this, int32_t arg2), class TGan** __convention("thiscall") mHRChara::mppGetGan(class mHRChara* const this, int32_t arg2), uint8_t __convention("thiscall") mHRChara::mRequestBloodSplash(class mHRChara* const this, char* arg2, int32_t arg3), void __convention("thiscall") mHRChara::mCallKillPcProcess(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCheckComboing(class mHRChara* const this), float __convention("thiscall") mHRChara::mGetAttackTableValue(class mHRChara* const this, int32_t arg2, int32_t arg3), float __convention("thiscall") mHRChara::mGetAttackDirection(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTestLowDmg(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mCreatePiyori(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mTermPiyori(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::mPiyoriProc(class mHRChara* const this), void __convention("thiscall") mHRChara::mSetDamageAcceptFrame(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsMultiStep(class mHRChara* const this), uint8_t __convention("thiscall") mHRChara::IsDownAttack(class mHRChara* const this), float __convention("thiscall") mHRChara::getFootShadowWidthHalf(class mHRChara* const this), float __convention("thiscall") mHRChara::getFootShadowDepthPlus(class mHRChara* const this), float __convention("thiscall") mHRChara::getFootShadowDepthMinus(class mHRChara* const this), void __convention("thiscall") mHRChara::OnStageUnload(class mHRChara* const this), void __convention("thiscall") mHRChara::setFootGroundTouchActFlagFromAI(class mHRChara* const this, uint8_t const arg2), void __convention("thiscall") mHRChara::mPlayCamMot(class mHRChara* const this, class TGan* arg2, int32_t arg3, uint8_t arg4, struct Vec* arg5, float* arg6, uint8_t arg7), void __convention("thiscall") mHRChara::mStopCamMotFromCharMot(class mHRChara* const this), uint8_t mHRChara::mRenderShadowProcAll(), void __convention("thiscall") mHRChara::mSetRotY(class mHRChara* const this, float arg2), uint8_t __convention("thiscall") mHRChara::mCheckSegmentHitStage(class mHRChara* const this, int64_t arg2, int32_t, float arg4, uint8_t arg5, float* arg6, struct Vec* arg7), void __convention("thiscall") mHRChara::mEraseDispChara(class mHRChara* const this), class mHRChara* mHRChara::mGetCharaPtr(enum enCharaType arg1, uint32_t arg2), class mHRChara* mHRChara::mAllSearchPiyoZako(), void mHRChara::OnStageUnloadAll()

	// TODO: Function 'enum enCharaType __convention("thiscall") mHRChara::mGetCharaType(class mHRChara* const this)'
	// TODO: Function 'uint8_t mHRChara::isCharacterTypeZako(enum enCharaType arg1)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestZako(class mHRChara* const this)'
	// TODO: Function 'uint8_t mHRChara::isCharacterTypeBoss(enum enCharaType arg1)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestBoss(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestEnemy(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetItemNo(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetLockOnNoCheckColl(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetLockOnDistanceLow(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetLockOnDistanceHi(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetLockOnDistance(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetCanLockOn(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDisableDameged(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetDisableDameged(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetMaxHp(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mUndispTgtIcn(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mDispTgtIcn(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetHp(class mHRChara* const this)'
	// TODO: Function 'enum enCharaCondition __convention("thiscall") mHRChara::mGetCondition(class mHRChara* const this)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRChara::mGetNext(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetHp(class mHRChara* const this, float arg2)'
	// TODO: Function 'class mHRChara* mHRChara::mGetTop()'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetRot(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetCharaPause(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetRotY(class mHRChara* const this)'
	// TODO: Function 'struct WGclMaterialSpec* __convention("thiscall") mHRChara::GetGroundTouchMaterial(class mHRChara* const this)'
	// TODO: Function 'struct stCharaStatus* __convention("thiscall") mHRChara::mGetStatusPtr(class mHRChara* const this)'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetPos(class mHRChara* const this)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetMotionNo(class mHRChara* const this)'
	// TODO: Function 'char* __convention("thiscall") mHRChara::mGetFileName(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsTubaAngleCorrect(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::getMiraretaiPosition(class mHRChara* const this, struct Vec* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::isHopeInterestMe(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsWatchPc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsUseRotMov(class mHRChara* const this)'
	// TODO: Function 'char const* __convention("thiscall") mHRChara::getCurMotionName(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestRunMotion(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mZakoDieOut(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCreateLoseSight(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckDamageMotion(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckEnterMotion(class mHRChara* const this)'
	// TODO: Function 'class TGan* __convention("thiscall") mHRChara::mpGetGan(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetCurResourceGmfPtr(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetCurResourceGmfPtr(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfWepLPtr(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfWepRPtr(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetResourceGmfPtr(class mHRChara* const this, class TGmf* arg2, char* arg3)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfDeadPtr(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfDeadPtr(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfPtr(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::mGetResourceGmfPtr(class mHRChara* const this)'
	// TODO: Function 'class ghmGcCollObjCapsule* __convention("thiscall") mHRChara::mGetCollPtr(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSethitOidashiDisEnable(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetBrainPos(class mHRChara* const this)'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetHitPos(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetMirrorModel(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetVisibleDist(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetCondition(class mHRChara* const this, enum enCharaCondition arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetSubMotionSpd(class mHRChara* const this, float arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheck4tsunbai(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckSquat(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mGetThrowMotNo(class mHRChara* const this, int32_t* arg2, int32_t* arg3)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetTsubazeriMotionID(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mTsubazeriDifficultyClear(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mTsubazeriDifficultyUp(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsTubaPosAdjust(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckGuard(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckAttack(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSubTension(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mAddTension(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetTension(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mResetTension(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMovSpd(class mHRChara* const this, float arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::UnderControllAttack_A(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::UnderControllComboAttack(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::ExitUnderControl(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::EnterUnderControl(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPostRenderProc(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::getViewClipBoxPositionOffsetY(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::getViewClipBoxHalfLengthXYZ(class mHRChara* const this, struct Vec* arg2)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetResNo(class mHRChara* const this)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetDropMoney(class mHRChara* const this)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetItemNo(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setLocatorNode(class mHRChara* const this, class TGmfNode* arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetHpRate(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSubHp(class mHRChara* const this, float arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetHitSize(class mHRChara* const this)'
	// TODO: Function 'enum enCharaInitProc __convention("thiscall") mHRChara::mGetInitProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::isCrashBreak(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetCharaHit(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetDmgAtkMot(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMotionProcessDisEnable(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetMotionSpd(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetStageHitDisEnable(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsFootShadowDraw(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetFootShadowDraw(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMotionNoNpc(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetCallScriptProc(class mHRChara* const this, char* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDropMoney(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetReactionDist(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetEnterPattern(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDatNo(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetResNo(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetCharaType(class mHRChara* const this, enum enCharaType arg2)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetDatNo(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetResourceDeleteFlag(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetDmgUpperPosY(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetDmgUpper(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetResourceDeleteFlag(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'class ghmPlane& __convention("thiscall") mHRChara::getLatestGroundTouchPlane(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mUndispBtlIcn(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mChgBtlIcnTb(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetDrawYAdjust(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDemoCtrl(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint64_t __convention("thiscall") mHRChara::mGetDemoCtrl(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::isAcceptDistanceDelete(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetStageHitDisEnableReq(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'struct stCharaEffect* __convention("thiscall") mHRChara::mGetEffectStPtr(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setBlackBodyEffect(class mHRChara* const this, class EffectEnemyDamage* arg2)'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetNavelPos(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDamageAcceptFrame(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetAlwaysCheckHitColl(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetLockOnNoCheckColl(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetLockOnDistanceLow(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetLockOnDistanceHi(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetLockOnDistance(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetAliveBtlIcn(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetSlowBlow(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetInputFinishReq(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'class TGan* __convention("thiscall") mHRChara::mGetResourceGanPtr(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'int16_t __convention("thiscall") mHRChara::mGetMoney(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMoney(class mHRChara* const this, int16_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetInputFinishReq(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mAddMoney(class mHRChara* const this, int16_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetInvincibleMotion(class mHRChara* const this, int32_t arg2, int32_t arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mResetInvincibleMotion(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCanGetHitByMotion(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mDispAtkHitIcn(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetDontStandUp(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::GetTubaFrmOffset(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::GetAtkDisAdjust(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetLoseTsubazeriFlag(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetSuccessThrow(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetRotYA(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDontStandUp(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDmgGrav(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mChgBtlIcnSml(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mChgBtlIcnBig(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetCharaHit(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetCanLockOn(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGethitOidashiDisEnable(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetWepVisible(class mHRChara* const this)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetMotionBrendNum(class mHRChara* const this)'
	// TODO: Function 'int16_t __convention("thiscall") mHRChara::mGetAiValue(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mResetPosA(class mHRChara* const this)'
	// TODO: Function 'class ghmPlane& __convention("thiscall") mHRChara::getEasyShadowProjectionPlane(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::isInterestTarget(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMotionSpd(class mHRChara* const this, float arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetWepEffectVisible(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetVisible(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetTension(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetMiniMapRender(class mHRChara* const this)'
	// TODO: Function 'class ghmResGroup* __convention("thiscall") mHRChara::mGetResourceRslPtr(class mHRChara* const this)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::getFootNumber(class mHRChara* const this)'
	// TODO: Function 'void* __convention("thiscall") mHRChara::`vector deleting destructor'(class mHRChara* const this, uint32_t arg2)'
	// TODO: Function 'char* __convention("thiscall") mHRChara::mGetCallScriptProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetMotionProcessDisEnable(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsBloom(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetTermAll(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetKnockBackSpd(class mHRChara* const this, float arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::GetKnockBackSpd(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetStageHitDisEnable(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetStartSplitFlameFlag(class mHRChara* const this)'
	// TODO: Function 'class TGmf* __convention("thiscall") mHRChara::getBoneEffectGmf(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetStartSplitFlameFlag(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetCharaPause(class mHRChara* const this)'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetBeforePos(class mHRChara* const this)'
	// TODO: Function 'int16_t __convention("thiscall") mHRChara::mGetZakoWepType(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetFootHitResultObj2(class mHRChara* const this, class ghmGcCollObjHitResultObj& arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDmgUpperPow(class mHRChara* const this, float arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mAddHp(class mHRChara* const this, float arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetSubMotionSpd(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetZakoWepType(class mHRChara* const this, int16_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetHitSize(class mHRChara* const this, float arg2)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetReactionDist(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMiniMapRender(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'struct Vec __convention("thiscall") mHRChara::GetKnockBackDir(class mHRChara* const this)'
	// TODO: Function 'int32_t __convention("thiscall") mHRChara::mGetMotionNoNpc(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetNormalClip(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'struct Vec& __convention("thiscall") mHRChara::mGetOldPos(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetSuccessThrow(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDmgUpperPosY(class mHRChara* const this, float const arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetDeleteReq(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::getShootPosiAndYaw(class mHRChara* const this, struct Vec* arg2, float* arg3, class TGmf& arg4, char const* arg5)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setHomingPositionFromAI(class mHRChara* const this, struct Vec& arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setHomingActFlagFromAI(class mHRChara* const this, uint8_t const arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::isHoming(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setInterestUseBoneNumFromAI(class mHRChara* const this, int32_t const arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::isInteresting(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::addDamageToYuremono(class mHRChara* const this, float const arg2, struct Vec& arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mSetHajikiCheck(class mHRChara* const this, float arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckDamageAccept(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestZakoDown(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestPiyoRequest(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetPiyoriHeight(class mHRChara* const this)'
	// TODO: Function 'class mHRChara* mHRChara::mGetCharaPtr(int32_t arg1)'
	// TODO: Function 'void mHRChara::mRenderGmf(void* arg1)'
	// TODO: Function 'int32_t mHRChara::debugDispCharaInfo()'
	// TODO: Function 'uint8_t mHRChara::mTermAllZakoMotion()'
	// TODO: Function 'uint8_t mHRChara::mInitAllNpc()'
	// TODO: Function 'void __convention("thiscall") mHRChara::mCreateBloodSplash(class mHRChara* const this, class TGmfNode* arg2, float arg3, struct tagHRTASKCHECK* arg4)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mBloodSplashProc(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::AddBoneElectPtrToList(class mHRChara* const this, class EffectBoneElect* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::ReleaseBoneElect(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsEmtpyBoneElectList(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::DeleteBoneElectFromList(class mHRChara* const this, class EffectBoneElect* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::AddCutmarkPtrToList(class mHRChara* const this, class EffectCutMark* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsEmtpyCutmarkList(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::DeleteCutmarkFromList(class mHRChara* const this, class EffectCutMark* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::SetPowerFlash(class mHRChara* const this, int32_t arg2, struct GXColor arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::SetNoGuardEffect(class mHRChara* const this)'
	// TODO: Function 'uint8_t mHRChara::mCheckAtkAllNpc()'
	// TODO: Function 'uint8_t mHRChara::mCheckCanAtk()'
	// TODO: Function 'void __convention("thiscall") mHRChara::mCallBeforeRenderProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckCanHit(class mHRChara* const this, int32_t arg2, uint8_t arg3, uint8_t arg4)'
	// TODO: Function 'void __convention("thiscall") mHRChara::CreateFootSmokeEffect(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::KnockBackProc(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::GetKnockBackRatio(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mSetDamage(class mHRChara* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mInitDamageMotInfo(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mChangeDefAi(class mHRChara* const this, uint8_t arg2, uint8_t arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDefAI(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckCallFrameProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsNowUnderControl(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::RegistUnderControlAtkFuncPtr(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::RegistUnderControlMotID(class mHRChara* const this, struct CharControlMotID& arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetUnderControlFlag(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::DrawDebugCollision(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mRenderProc(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::postSetupMatrix(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::preSetupMatrix(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mFootSmokeEffect(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mPosAnimationProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPostFrameProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mFrameProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mInit(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetRotA(class mHRChara* const this, struct Vec& arg2, uint32_t const arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetWepEffectVisibleInstant(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSubFrameStop(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPlayMotionMov(class mHRChara* const this, int32_t arg2, float arg3, float arg4, float arg5, uint8_t arg6)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestMotion(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDifficultyMotionSpeed(class mHRChara* const this, float arg2)'
	// TODO: Function 'class mHRChara* mHRChara::getCharaByGM2FileName(char const* arg1)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDeath(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mDamageCallBackForScript(class mHRChara* const this, int32_t arg2, uint8_t arg3, enum eDmgCallBackDmgType arg4, int32_t arg5)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetMotionPlay(class mHRChara* const this)'
	// TODO: Function 'class mHRChara* mHRChara::mGetAliveResourceCharaPtr(enum enCharaType arg1, uint32_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::ReleaseCutmark(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestPiyori(class mHRChara* const this)'
	// TODO: Function 'uint32_t __convention("thiscall") mHRChara::mGetMotionTotalTick(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setInterestPositionFromAI(class mHRChara* const this, struct Vec& arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setInterestActFlagFromAI(class mHRChara* const this, uint8_t const arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mGetWepTopPos(class mHRChara* const this, struct Vec* arg2, enum enWepLeftRight arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mInitDamageStatus(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPostFrameCommonProc1(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPostFrameCommonProc2(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetKnockBack(class mHRChara* const this, float arg2, struct Vec& arg3, float arg4)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::CheckWallCrashAndDamageProc(class mHRChara* const this, int32_t const arg2, int32_t const arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mSetHpBarVisible(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetPosA(class mHRChara* const this, struct Vec& arg2, uint32_t const arg3, int32_t const arg4)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mSetSimpleHpBarVisible(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mPlayCamMotFromCharMot(class mHRChara* const this, int32_t arg2, int32_t arg3, uint8_t arg4, uint8_t arg5, uint8_t arg6)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPlayMotionMov(class mHRChara* const this, int32_t arg2, float arg3, float arg4, uint8_t arg5)'
	// TODO: Function 'void __convention("thiscall") mHRChara::checkDeleteBlackBodyEffect(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetHitCounter(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mReleaseBloodSplash(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPreFrameProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPreRenderProc(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mDetouchMotionBrend(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mReleaseDemoBtleIcn(class mHRChara* const this)'
	// TODO: Function 'uint8_t mHRChara::isThisCharaExist(class mHRChara* arg1)'
	// TODO: Function 'uint8_t mHRChara::mTermAllNpc()'
	// TODO: Function 'int32_t mHRChara::mGetPopZakoNum()'
	// TODO: Function 'void __convention("thiscall") mHRChara::mDeleteDispChara(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetAiDef(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setFootShadowDrawFlag(class mHRChara* const this, uint8_t const arg2)'
	// TODO: Function 'uint8_t mHRChara::mFrameProcAll()'
	// TODO: Function 'uint8_t mHRChara::mRenderProcAll(uint8_t arg1)'
	// TODO: Function 'uint8_t mHRChara::mPostRenderProcAll()'
	// TODO: Function 'uint8_t mHRChara::mTermAllNpcWithoutCmnObj()'
	// TODO: Function 'uint8_t mHRChara::mTermAllEnemyNpc()'
	// TODO: Function 'class mHRChara* mHRChara::mGetNpcTop()'
	// TODO: Function 'void __convention("thiscall") mHRChara::~mHRChara(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mHRChara(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::SetFileName(class mHRChara* const this, char const* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMaxHp(class mHRChara* const this, float arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTerm(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetPos(class mHRChara* const this, struct Vec& arg2, uint8_t arg3, float arg4)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetRot(class mHRChara* const this, struct Vec& arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetScale(class mHRChara* const this, struct Vec& arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mHitCheck(class mHRChara* const this, class mHRChara* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mMotionSpeedControl(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mCallMotionProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPlayMotion(class mHRChara* const this, int32_t arg2, uint8_t arg3, int32_t arg4, uint8_t arg5, float arg6)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mCallMoneyDrop(class mHRChara* const this, int32_t arg2, uint8_t arg3, uint8_t arg4)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mAttachWep(class mHRChara* const this, class TGmf* arg2, enum eUDLR arg3, char* arg4)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mDetachWep(class mHRChara* const this, enum eUDLR arg2, char* arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSemitransparentProcess(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mUpdateAtkColl(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mRenderShadowProc(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mRefreshFloorPosition(class mHRChara* const this, float arg2, uint8_t arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mDamageProc(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mRestoreDamage(class mHRChara* const this, int32_t arg2, float arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckAttack(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckCanAttack(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mGetTsubazeriaiPos(class mHRChara* const this, struct Vec* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetPcTsubaOuterMot(class mHRChara* const this)'
	// TODO: Function 'struct Vec __convention("thiscall") mHRChara::GetTsubaEffectPos(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckCanCatch(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckCanThrow(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mPlayThrownMotion(class mHRChara* const this, int32_t arg2, int32_t arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPlayMotionBlend(class mHRChara* const this, class TGan** arg2, char arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPlayMotionBlend(class mHRChara* const this, int32_t arg2, char arg3, uint8_t arg4, uint8_t arg5)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mBossDeadCommonProcess(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckCanLockOn(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::getLockOnCursorBasePosition(class mHRChara* const this, struct Vec* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetVisible(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetWepVisible(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetWepEffectVisible(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetVisibleDist(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mEffectInit(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetMirrorModel(class mHRChara* const this, uint8_t arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetAiAtk(class mHRChara* const this, int32_t arg2, int32_t arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetWarpPos(class mHRChara* const this, struct Vec& arg2, uint8_t arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mHitCheckStage(class mHRChara* const this, class ghmGcCollObjCapsule* arg2, struct Vec* arg3, struct Vec* arg4, struct Vec* arg5, struct Vec* arg6, class ghmGcCollObj** arg7, class ghmGcCollObjHitResult** arg8, class ghmGcCollObjHitResultObj* arg9, struct WGclMaterialSpec** arg10, uint8_t* arg11, uint8_t arg12, float arg13)'
	// TODO: Function 'class TGan* __convention("thiscall") mHRChara::mpGetGan(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'class TGan** __convention("thiscall") mHRChara::mppGetGan(class mHRChara* const this, int32_t arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mRequestBloodSplash(class mHRChara* const this, char* arg2, int32_t arg3)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mCallKillPcProcess(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckComboing(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetAttackTableValue(class mHRChara* const this, int32_t arg2, int32_t arg3)'
	// TODO: Function 'float __convention("thiscall") mHRChara::mGetAttackDirection(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTestLowDmg(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCreatePiyori(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mTermPiyori(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mPiyoriProc(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetDamageAcceptFrame(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsMultiStep(class mHRChara* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::IsDownAttack(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::getFootShadowWidthHalf(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::getFootShadowDepthPlus(class mHRChara* const this)'
	// TODO: Function 'float __convention("thiscall") mHRChara::getFootShadowDepthMinus(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::OnStageUnload(class mHRChara* const this)'
	// TODO: Function 'void __convention("thiscall") mHRChara::setFootGroundTouchActFlagFromAI(class mHRChara* const this, uint8_t const arg2)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mPlayCamMot(class mHRChara* const this, class TGan* arg2, int32_t arg3, uint8_t arg4, struct Vec* arg5, float* arg6, uint8_t arg7)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mStopCamMotFromCharMot(class mHRChara* const this)'
	// TODO: Function 'uint8_t mHRChara::mRenderShadowProcAll()'
	// TODO: Function 'void __convention("thiscall") mHRChara::mSetRotY(class mHRChara* const this, float arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRChara::mCheckSegmentHitStage(class mHRChara* const this, int64_t arg2, int32_t, float arg4, uint8_t arg5, float* arg6, struct Vec* arg7)'
	// TODO: Function 'void __convention("thiscall") mHRChara::mEraseDispChara(class mHRChara* const this)'
	// TODO: Function 'class mHRChara* mHRChara::mGetCharaPtr(enum enCharaType arg1, uint32_t arg2)'
	// TODO: Function 'class mHRChara* mHRChara::mAllSearchPiyoZako()'
	// TODO: Function 'void mHRChara::OnStageUnloadAll()'

	/// Struct member variables

	// <class ghmListObj field_0, offset 0x0>
	// class ghmListObj Super;

	// <struct stCharaStatus mStatus, offset 0x10>
	struct stCharaStatus mStatus;

	// <class stCharaFileData mResource, offset 0x3ac>
	class stCharaFileData mResource;

	// <struct stCharaEffect mEffect, offset 0x3e4>
	struct stCharaEffect mEffect;

	// <class CAmbientShadow m_inAmbientShadow, offset 0x508>
	class CAmbientShadow m_inAmbientShadow;

	// <class CStlVector<CStickShadow> m_ainFootShadow, offset 0x540>
	class std::vector<CStickShadow> m_ainFootShadow;

	// <enum enCharaInitProc mInitProc, offset 0x54c>
	enum enCharaInitProc mInitProc;

	// <class CharController* m_pCharController, offset 0x550>
	class CharController* m_pCharController;

	// <class ghmTriangle mWepColl, offset 0x554>
	class ghmTriangle mWepColl;

	// <int32_t motionInvincibilityFrames, offset 0x578>
	int32_t motionInvincibilityFrames;

	// <int32_t invincibileMotion, offset 0x57c>
	int32_t invincibileMotion;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<mHRChara>("mHRChara")
			.addProperty("mStatus", &mHRChara::mStatus)
			.addProperty("mResource", &mHRChara::mResource)
			.addProperty("mEffect", &mHRChara::mEffect)
			.addProperty("m_inAmbientShadow", &mHRChara::m_inAmbientShadow)
			.addProperty("m_ainFootShadow", &mHRChara::m_ainFootShadow)
			.addProperty("mInitProc", &mHRChara::mInitProc)
			.addProperty("m_pCharController", &mHRChara::m_pCharController)
			.addProperty("mWepColl", &mHRChara::mWepColl)
			.addProperty("motionInvincibilityFrames", &mHRChara::motionInvincibilityFrames)
			.addProperty("invincibileMotion", &mHRChara::invincibileMotion)
		.endClass();
	}
#endif
};
static_assert(sizeof(mHRChara::mStatus) == 924, "expected mStatus to be size 924");
static_assert(sizeof(mHRChara::mResource) == 56, "expected mResource to be size 56");
static_assert(sizeof(mHRChara::mEffect) == 292, "expected mEffect to be size 292");
static_assert(sizeof(mHRChara::m_inAmbientShadow) == 56, "expected m_inAmbientShadow to be size 56");
static_assert(sizeof(mHRChara::m_ainFootShadow) == 12, "expected m_ainFootShadow to be size 12");
static_assert(sizeof(mHRChara::mInitProc) == 4, "expected mInitProc to be size 4");
static_assert(sizeof(mHRChara::m_pCharController) == 4, "expected m_pCharController to be size 4");
static_assert(sizeof(mHRChara::mWepColl) == 36, "expected mWepColl to be size 36");
static_assert(sizeof(mHRChara::motionInvincibilityFrames) == 4, "expected motionInvincibilityFrames to be size 4");
static_assert(sizeof(mHRChara::invincibileMotion) == 4, "expected invincibileMotion to be size 4");
static_assert(sizeof(class mHRChara) == 1408, "expected class mHRChara to be size 1408");

// class ghmAABB
// 1 dependencies: struct Vec
class ghmAABB
{
public:
	/// No namespace types
	/// Struct member variables

	// <struct Vec mCenter, offset 0x0>
	struct Vec mCenter;

	// <struct Vec mExtent, offset 0xc>
	struct Vec mExtent;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmAABB>("ghmAABB")
			.addProperty("mCenter", &ghmAABB::mCenter)
			.addProperty("mExtent", &ghmAABB::mExtent)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmAABB::mCenter) == 12, "expected mCenter to be size 12");
static_assert(sizeof(ghmAABB::mExtent) == 12, "expected mExtent to be size 12");
static_assert(sizeof(class ghmAABB) == 24, "expected class ghmAABB to be size 24");

// class ghmGcOctTreeNode
// 2 dependencies: class ghmAABB, struct Vec
class ghmGcOctTreeNode
{
public:
	/// No namespace types
	/// Struct member variables

	// <void* (* field_0)[0x1], offset 0x0>
	void* (* field_0)[0x1];

	// <class ghmGcOctTree* mpContainer, offset 0x4>
	class ghmGcOctTree* mpContainer;

	// <int32_t mDepthLevel, offset 0x8>
	int32_t mDepthLevel;

	// <int32_t mKey, offset 0xc>
	int32_t mKey;

	// <ghmGcOctTreeNode* mpParent, offset 0x10>
	ghmGcOctTreeNode* mpParent;

	// <ghmGcOctTreeNode* mpChildL[0x8], offset 0x14>
	ghmGcOctTreeNode* mpChildL[8];

	// <int32_t mNextKey[0x6], offset 0x34>
	int32_t mNextKey[6];

	// <class ghmGcOctTreeNodeObj* mpObjTop, offset 0x4c>
	class ghmGcOctTreeNodeObj* mpObjTop;

	// <class ghmAABB mShape, offset 0x50>
	class ghmAABB mShape;

	// <uint32_t mVisible, offset 0x68>
	uint32_t mVisible;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcOctTreeNode>("ghmGcOctTreeNode")
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &ghmGcOctTreeNode::field_0)
			.addProperty("mpContainer", &ghmGcOctTreeNode::mpContainer)
			.addProperty("mDepthLevel", &ghmGcOctTreeNode::mDepthLevel)
			.addProperty("mKey", &ghmGcOctTreeNode::mKey)
			.addProperty("mpParent", &ghmGcOctTreeNode::mpParent)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mpChildL", &ghmGcOctTreeNode::mpChildL)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mNextKey", &ghmGcOctTreeNode::mNextKey)
			.addProperty("mpObjTop", &ghmGcOctTreeNode::mpObjTop)
			.addProperty("mShape", &ghmGcOctTreeNode::mShape)
			.addProperty("mVisible", &ghmGcOctTreeNode::mVisible)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcOctTreeNode::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(ghmGcOctTreeNode::mpContainer) == 4, "expected mpContainer to be size 4");
static_assert(sizeof(ghmGcOctTreeNode::mDepthLevel) == 4, "expected mDepthLevel to be size 4");
static_assert(sizeof(ghmGcOctTreeNode::mKey) == 4, "expected mKey to be size 4");
static_assert(sizeof(ghmGcOctTreeNode::mpParent) == 4, "expected mpParent to be size 4");
static_assert(sizeof(ghmGcOctTreeNode::mpChildL) == 32, "expected mpChildL to be size 32");
static_assert(sizeof(ghmGcOctTreeNode::mNextKey) == 24, "expected mNextKey to be size 24");
static_assert(sizeof(ghmGcOctTreeNode::mpObjTop) == 4, "expected mpObjTop to be size 4");
static_assert(sizeof(ghmGcOctTreeNode::mShape) == 24, "expected mShape to be size 24");
static_assert(sizeof(ghmGcOctTreeNode::mVisible) == 4, "expected mVisible to be size 4");
static_assert(sizeof(class ghmGcOctTreeNode) == 108, "expected class ghmGcOctTreeNode to be size 108");

// class ghmGcOctTree
// no dependencies
class ghmGcOctTree
{
public:
	/// No namespace types
	/// Struct member variables

	// <void* (* field_0)[0x1], offset 0x0>
	void* (* field_0)[0x1];

	// <int32_t mMaxDepthLevel, offset 0x4>
	int32_t mMaxDepthLevel;

	// <class ghmGcOctTreeNode* mpRootNode, offset 0x8>
	class ghmGcOctTreeNode* mpRootNode;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcOctTree>("ghmGcOctTree")
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &ghmGcOctTree::field_0)
			.addProperty("mMaxDepthLevel", &ghmGcOctTree::mMaxDepthLevel)
			.addProperty("mpRootNode", &ghmGcOctTree::mpRootNode)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcOctTree::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(ghmGcOctTree::mMaxDepthLevel) == 4, "expected mMaxDepthLevel to be size 4");
static_assert(sizeof(ghmGcOctTree::mpRootNode) == 4, "expected mpRootNode to be size 4");
static_assert(sizeof(class ghmGcOctTree) == 12, "expected class ghmGcOctTree to be size 12");

// class ghmGcCollObjHitResult
// no dependencies
class ghmGcCollObjHitResult
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[48];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcCollObjHitResult>("ghmGcCollObjHitResult")
		.endClass();
	}
#endif
};
static_assert(sizeof(class ghmGcCollObjHitResult) == 48, "expected class ghmGcCollObjHitResult to be size 48");

// struct WGclMaterialSpec
// no dependencies
struct WGclMaterialSpec
{
public:
	/// No namespace types
	/// Struct member variables

	// <char mIDStr[0x8], offset 0x0>
	char mIDStr[8];

	// <uint32_t mEnable, offset 0x8>
	uint32_t mEnable;

	// <uint32_t mPad[0x5], offset 0xc>
	uint32_t mPad[5];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WGclMaterialSpec>("WGclMaterialSpec")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mIDStr", &WGclMaterialSpec::mIDStr)
			.addProperty("mEnable", &WGclMaterialSpec::mEnable)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad", &WGclMaterialSpec::mPad)
		.endClass();
	}
#endif
};
static_assert(sizeof(WGclMaterialSpec::mIDStr) == 8, "expected mIDStr to be size 8");
static_assert(sizeof(WGclMaterialSpec::mEnable) == 4, "expected mEnable to be size 4");
static_assert(sizeof(WGclMaterialSpec::mPad) == 20, "expected mPad to be size 20");
static_assert(sizeof(struct WGclMaterialSpec) == 32, "expected struct WGclMaterialSpec to be size 32");

// class EE::SmartPtr<EE::IFile>
// no dependencies
namespace EE
{
	template<typename T>
	class SmartPtr
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <class EE::IFile* m_pObject, offset 0x0>
		class IFile* m_pObject;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<EE::SmartPtr<EE::IFile>>("EE::SmartPtr<EE::IFile>")
				.addProperty("m_pObject", &EE::SmartPtr<EE::IFile>::m_pObject)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(EE::SmartPtr<EE::IFile>::m_pObject) == 4, "expected m_pObject to be size 4");
static_assert(sizeof(class EE::SmartPtr<EE::IFile>) == 4, "expected class EE::SmartPtr<EE::IFile> to be size 4");

// struct DVDCommandBlock
// no dependencies
struct DVDCommandBlock
{
public:
	/// No namespace types
	/// Struct member variables

	// <DVDCommandBlock* next, offset 0x0>
	DVDCommandBlock* next;

	// <DVDCommandBlock* prev, offset 0x4>
	DVDCommandBlock* prev;

	// <uint32_t command, offset 0x8>
	uint32_t command;

	// <int32_t volatile state, offset 0xc>
	int32_t volatile state;

	// <uint32_t offset, offset 0x10>
	uint32_t offset;

	// <uint32_t length, offset 0x14>
	uint32_t length;

	// <void* addr, offset 0x18>
	void* addr;

	// <uint32_t currTransferSize, offset 0x1c>
	uint32_t currTransferSize;

	// <uint32_t transferredSize, offset 0x20>
	uint32_t transferredSize;

	// <struct DVDDiskID* id, offset 0x24>
	struct DVDDiskID* id;

	// <void (* callback)(int32_t, DVDCommandBlock*), offset 0x28>
	void (* callback)(int32_t, DVDCommandBlock*);

	// <void* userData, offset 0x2c>
	void* userData;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<DVDCommandBlock>("DVDCommandBlock")
			.addProperty("next", &DVDCommandBlock::next)
			.addProperty("prev", &DVDCommandBlock::prev)
			.addProperty("command", &DVDCommandBlock::command)
			// volatile not supported in LuaBridge and needs a getter
			//.addProperty("state", &DVDCommandBlock::state)
			.addProperty("offset", &DVDCommandBlock::offset)
			.addProperty("length", &DVDCommandBlock::length)
			// void type not supported in LuaBridge
			//.addProperty("addr", &DVDCommandBlock::addr)
			.addProperty("currTransferSize", &DVDCommandBlock::currTransferSize)
			.addProperty("transferredSize", &DVDCommandBlock::transferredSize)
			.addProperty("id", &DVDCommandBlock::id)
			// delegates are not supported in LuaBridge
			//.addProperty("callback", &DVDCommandBlock::callback)
			// void type not supported in LuaBridge
			//.addProperty("userData", &DVDCommandBlock::userData)
		.endClass();
	}
#endif
};
static_assert(sizeof(DVDCommandBlock::next) == 4, "expected next to be size 4");
static_assert(sizeof(DVDCommandBlock::prev) == 4, "expected prev to be size 4");
static_assert(sizeof(DVDCommandBlock::command) == 4, "expected command to be size 4");
static_assert(sizeof(DVDCommandBlock::state) == 4, "expected state to be size 4");
static_assert(sizeof(DVDCommandBlock::offset) == 4, "expected offset to be size 4");
static_assert(sizeof(DVDCommandBlock::length) == 4, "expected length to be size 4");
static_assert(sizeof(DVDCommandBlock::addr) == 4, "expected addr to be size 4");
static_assert(sizeof(DVDCommandBlock::currTransferSize) == 4, "expected currTransferSize to be size 4");
static_assert(sizeof(DVDCommandBlock::transferredSize) == 4, "expected transferredSize to be size 4");
static_assert(sizeof(DVDCommandBlock::id) == 4, "expected id to be size 4");
static_assert(sizeof(DVDCommandBlock::callback) == 4, "expected callback to be size 4");
static_assert(sizeof(DVDCommandBlock::userData) == 4, "expected userData to be size 4");
static_assert(sizeof(struct DVDCommandBlock) == 48, "expected struct DVDCommandBlock to be size 48");

// struct DVDFileInfo
// 2 dependencies: struct DVDCommandBlock, class EE::SmartPtr<EE::IFile>
struct DVDFileInfo
{
public:
	/// No namespace types
	/// Struct member variables

	// <struct DVDCommandBlock cb, offset 0x0>
	struct DVDCommandBlock cb;

	// <uint32_t startAddr, offset 0x30>
	uint32_t startAddr;

	// <uint32_t length, offset 0x34>
	uint32_t length;

	// <void (* callback)(int32_t, DVDFileInfo*), offset 0x38>
	void (* callback)(int32_t, DVDFileInfo*);

	// <class EE::SmartPtr<EE::IFile> file, offset 0x3c>
	class EE::SmartPtr<EE::IFile> file;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<DVDFileInfo>("DVDFileInfo")
			.addProperty("cb", &DVDFileInfo::cb)
			.addProperty("startAddr", &DVDFileInfo::startAddr)
			.addProperty("length", &DVDFileInfo::length)
			// delegates are not supported in LuaBridge
			//.addProperty("callback", &DVDFileInfo::callback)
			.addProperty("file", &DVDFileInfo::file)
		.endClass();
	}
#endif
};
static_assert(sizeof(DVDFileInfo::cb) == 48, "expected cb to be size 48");
static_assert(sizeof(DVDFileInfo::startAddr) == 4, "expected startAddr to be size 4");
static_assert(sizeof(DVDFileInfo::length) == 4, "expected length to be size 4");
static_assert(sizeof(DVDFileInfo::callback) == 4, "expected callback to be size 4");
static_assert(sizeof(DVDFileInfo::file) == 4, "expected file to be size 4");
static_assert(sizeof(struct DVDFileInfo) == 64, "expected struct DVDFileInfo to be size 64");

// class ghmGcFile
// 5 dependencies: struct ghmGcFile::ghmGcFileInfo, struct DVDFileInfo, struct DVDCommandBlock, class EE::SmartPtr<EE::IFile>, enum ghmGcFile::ghmGcFileState
class ghmGcFile
{
public:
	/// 2 namespace types: enum ghmGcFile::ghmGcFileState, struct ghmGcFile::ghmGcFileInfo

	// enum ghmGcFile::ghmGcFileState
	enum ghmGcFileState : uint32_t
	{
		// Enum values

		// <READFINISH = 0x1>
		READFINISH = 1,

		// <CANCELED = 0x1>
		CANCELED = 1,

		// <CLOSED = 0x0>
		CLOSED = 0,

		// <OPENED = 0x1>
		OPENED = 1,

		// <READ = 0x2>
		READ = 2,

		// <READRETRY = 0x3>
		READRETRY = 3

	};

	// struct ghmGcFile::ghmGcFileInfo
	// 4 dependencies: struct DVDFileInfo, struct DVDCommandBlock, class EE::SmartPtr<EE::IFile>, enum ghmGcFile::ghmGcFileState
	struct ghmGcFileInfo
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <struct DVDFileInfo mFileInfo, offset 0x0>
		struct DVDFileInfo mFileInfo;

		// <int32_t mOffset, offset 0x40>
		int32_t mOffset;

		// <int32_t mLength, offset 0x44>
		int32_t mLength;

		// <int32_t mRequestNo, offset 0x48>
		int32_t mRequestNo;

		// <int32_t volatile mReadStatus, offset 0x4c>
		int32_t volatile mReadStatus;

		// <int32_t volatile mReadResult, offset 0x50>
		int32_t volatile mReadResult;

		// <enum ghmGcFile::ghmGcFileState mState, offset 0x54>
		enum ghmGcFileState mState;

		// <uint8_t mDivRead, offset 0x58>
		uint8_t mDivRead;

		// <Filler, offset 0x59>
		char _Filler8[3];

		// <int32_t mTotalReadLength, offset 0x5c>
		int32_t mTotalReadLength;

		// <int32_t mOneReadLength, offset 0x60>
		int32_t mOneReadLength;

		// <int32_t mReadOffset, offset 0x64>
		int32_t mReadOffset;

		// <void* mpBuffer, offset 0x68>
		void* mpBuffer;

		// <int32_t mReadCount, offset 0x6c>
		int32_t mReadCount;

		// <int32_t mDivNum, offset 0x70>
		int32_t mDivNum;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<ghmGcFile::ghmGcFileInfo>("ghmGcFile::ghmGcFileInfo")
				.addProperty("mFileInfo", &ghmGcFile::ghmGcFileInfo::mFileInfo)
				.addProperty("mOffset", &ghmGcFile::ghmGcFileInfo::mOffset)
				.addProperty("mLength", &ghmGcFile::ghmGcFileInfo::mLength)
				.addProperty("mRequestNo", &ghmGcFile::ghmGcFileInfo::mRequestNo)
				// volatile not supported in LuaBridge and needs a getter
				//.addProperty("mReadStatus", &ghmGcFile::ghmGcFileInfo::mReadStatus)
				// volatile not supported in LuaBridge and needs a getter
				//.addProperty("mReadResult", &ghmGcFile::ghmGcFileInfo::mReadResult)
				.addProperty("mState", &ghmGcFile::ghmGcFileInfo::mState)
				.addProperty("mDivRead", &ghmGcFile::ghmGcFileInfo::mDivRead)
				.addProperty("mTotalReadLength", &ghmGcFile::ghmGcFileInfo::mTotalReadLength)
				.addProperty("mOneReadLength", &ghmGcFile::ghmGcFileInfo::mOneReadLength)
				.addProperty("mReadOffset", &ghmGcFile::ghmGcFileInfo::mReadOffset)
				// void type not supported in LuaBridge
				//.addProperty("mpBuffer", &ghmGcFile::ghmGcFileInfo::mpBuffer)
				.addProperty("mReadCount", &ghmGcFile::ghmGcFileInfo::mReadCount)
				.addProperty("mDivNum", &ghmGcFile::ghmGcFileInfo::mDivNum)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mFileInfo) == 64, "expected mFileInfo to be size 64");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mOffset) == 4, "expected mOffset to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mLength) == 4, "expected mLength to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mRequestNo) == 4, "expected mRequestNo to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadStatus) == 4, "expected mReadStatus to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadResult) == 4, "expected mReadResult to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mState) == 4, "expected mState to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mDivRead) == 1, "expected mDivRead to be size 1");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mTotalReadLength) == 4, "expected mTotalReadLength to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mOneReadLength) == 4, "expected mOneReadLength to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadOffset) == 4, "expected mReadOffset to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mpBuffer) == 4, "expected mpBuffer to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mReadCount) == 4, "expected mReadCount to be size 4");
	static_assert(sizeof(ghmGcFile::ghmGcFileInfo::mDivNum) == 4, "expected mDivNum to be size 4");
	static_assert(sizeof(struct ghmGcFile::ghmGcFileInfo) == 116, "expected struct ghmGcFile::ghmGcFileInfo to be size 116");


	/// Struct member variables

	// <struct ghmGcFile::ghmGcFileInfo mInfo, offset 0x0>
	struct ghmGcFile::ghmGcFileInfo mInfo;

	// <ghmGcFile* mpPrev, offset 0x74>
	ghmGcFile* mpPrev;

	// <ghmGcFile* mpNext, offset 0x78>
	ghmGcFile* mpNext;

	// <char mFileName[0x40], offset 0x7c>
	char mFileName[64];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmGcFile>("ghmGcFile")
			.addProperty("mInfo", &ghmGcFile::mInfo)
			.addProperty("mpPrev", &ghmGcFile::mpPrev)
			.addProperty("mpNext", &ghmGcFile::mpNext)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mFileName", &ghmGcFile::mFileName)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmGcFile::mInfo) == 116, "expected mInfo to be size 116");
static_assert(sizeof(ghmGcFile::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(ghmGcFile::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(ghmGcFile::mFileName) == 64, "expected mFileName to be size 64");
static_assert(sizeof(class ghmGcFile) == 188, "expected class ghmGcFile to be size 188");

// struct DVDDiskID
// no dependencies
struct DVDDiskID
{
public:
	/// No namespace types
	/// Struct member variables

	// <char gameName[0x4], offset 0x0>
	char gameName[4];

	// <char company[0x2], offset 0x4>
	char company[2];

	// <uint8_t diskNumber, offset 0x6>
	uint8_t diskNumber;

	// <uint8_t gameVersion, offset 0x7>
	uint8_t gameVersion;

	// <uint8_t streaming, offset 0x8>
	uint8_t streaming;

	// <uint8_t streamingBufSize, offset 0x9>
	uint8_t streamingBufSize;

	// <uint8_t padding[0xe], offset 0xa>
	uint8_t padding[14];

	// <uint32_t rvlMagic, offset 0x18>
	uint32_t rvlMagic;

	// <uint32_t gcMagic, offset 0x1c>
	uint32_t gcMagic;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<DVDDiskID>("DVDDiskID")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("gameName", &DVDDiskID::gameName)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("company", &DVDDiskID::company)
			.addProperty("diskNumber", &DVDDiskID::diskNumber)
			.addProperty("gameVersion", &DVDDiskID::gameVersion)
			.addProperty("streaming", &DVDDiskID::streaming)
			.addProperty("streamingBufSize", &DVDDiskID::streamingBufSize)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("padding", &DVDDiskID::padding)
			.addProperty("rvlMagic", &DVDDiskID::rvlMagic)
			.addProperty("gcMagic", &DVDDiskID::gcMagic)
		.endClass();
	}
#endif
};
static_assert(sizeof(DVDDiskID::gameName) == 4, "expected gameName to be size 4");
static_assert(sizeof(DVDDiskID::company) == 2, "expected company to be size 2");
static_assert(sizeof(DVDDiskID::diskNumber) == 1, "expected diskNumber to be size 1");
static_assert(sizeof(DVDDiskID::gameVersion) == 1, "expected gameVersion to be size 1");
static_assert(sizeof(DVDDiskID::streaming) == 1, "expected streaming to be size 1");
static_assert(sizeof(DVDDiskID::streamingBufSize) == 1, "expected streamingBufSize to be size 1");
static_assert(sizeof(DVDDiskID::padding) == 14, "expected padding to be size 14");
static_assert(sizeof(DVDDiskID::rvlMagic) == 4, "expected rvlMagic to be size 4");
static_assert(sizeof(DVDDiskID::gcMagic) == 4, "expected gcMagic to be size 4");
static_assert(sizeof(struct DVDDiskID) == 32, "expected struct DVDDiskID to be size 32");

// class EE::RefObject
// no dependencies
namespace EE
{
	class RefObject
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <void* (* field_0)[0x1], offset 0x0>
		void* (* field_0)[0x1];

		// <int32_t volatile refCount, offset 0x4>
		int32_t volatile refCount;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<EE::RefObject>("EE::RefObject")
				// delegates are not supported in LuaBridge
				//.addProperty("field_0", &EE::RefObject::field_0)
				// volatile not supported in LuaBridge and needs a getter
				//.addProperty("refCount", &EE::RefObject::refCount)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(EE::RefObject::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(EE::RefObject::refCount) == 4, "expected refCount to be size 4");
static_assert(sizeof(class EE::RefObject) == 8, "expected class EE::RefObject to be size 8");

// class EE::IFile
// 4 dependencies: class EE::RefObject, class EE::String, class EE::StringBase<char,EE::String>, enum EE::StringBase<char,EE::String>::Storage
namespace EE
{
	class IFile : EE::RefObject
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <class EE::RefObject field_0, offset 0x0>
		// class RefObject Super;

		// <class EE::String name, offset 0x8>
		class String name;

		// <uint8_t endianSwap, offset 0x14>
		uint8_t endianSwap;

		// <Filler, offset 0x15>
		char _Filler[3];

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<EE::IFile>("EE::IFile")
				.addProperty("name", &EE::IFile::name)
				.addProperty("endianSwap", &EE::IFile::endianSwap)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(EE::IFile::name) == 12, "expected name to be size 12");
static_assert(sizeof(EE::IFile::endianSwap) == 1, "expected endianSwap to be size 1");
static_assert(sizeof(class EE::IFile) == 24, "expected class EE::IFile to be size 24");

// class ghmResGroup
// no dependencies
class ghmResGroup
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint32_t mMagicNo, offset 0x0>
	uint32_t mMagicNo;

	// <uint32_t mResourceNum, offset 0x4>
	uint32_t mResourceNum;

	// <uint32_t mAttrOffset, offset 0x8>
	uint32_t mAttrOffset;

	// <uint32_t mVersion, offset 0xc>
	uint32_t mVersion;

	// <class ghmResStrTable* mpStrTablePtr, offset 0x10>
	class ghmResStrTable* mpStrTablePtr;

	// <uint32_t mFlag, offset 0x14>
	uint32_t mFlag;

	// <uint32_t mPad[0x3], offset 0x18>
	uint32_t mPad[3];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmResGroup>("ghmResGroup")
			.addProperty("mMagicNo", &ghmResGroup::mMagicNo)
			.addProperty("mResourceNum", &ghmResGroup::mResourceNum)
			.addProperty("mAttrOffset", &ghmResGroup::mAttrOffset)
			.addProperty("mVersion", &ghmResGroup::mVersion)
			.addProperty("mpStrTablePtr", &ghmResGroup::mpStrTablePtr)
			.addProperty("mFlag", &ghmResGroup::mFlag)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad", &ghmResGroup::mPad)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmResGroup::mMagicNo) == 4, "expected mMagicNo to be size 4");
static_assert(sizeof(ghmResGroup::mResourceNum) == 4, "expected mResourceNum to be size 4");
static_assert(sizeof(ghmResGroup::mAttrOffset) == 4, "expected mAttrOffset to be size 4");
static_assert(sizeof(ghmResGroup::mVersion) == 4, "expected mVersion to be size 4");
static_assert(sizeof(ghmResGroup::mpStrTablePtr) == 4, "expected mpStrTablePtr to be size 4");
static_assert(sizeof(ghmResGroup::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(ghmResGroup::mPad) == 12, "expected mPad to be size 12");
static_assert(sizeof(class ghmResGroup) == 36, "expected class ghmResGroup to be size 36");

// class ghmResStrTable
// no dependencies
class ghmResStrTable
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint32_t mNum, offset 0x0>
	uint32_t mNum;

	// <char const** mppStrings, offset 0x4>
	char const** mppStrings;

	// <uint32_t mFlag, offset 0x8>
	uint32_t mFlag;

	// <uint32_t mPad[0x1], offset 0xc>
	uint32_t mPad[1];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<ghmResStrTable>("ghmResStrTable")
			.addProperty("mNum", &ghmResStrTable::mNum)
			// pointer to pointer is not supported in LuaBridge
			//.addProperty("mppStrings", &ghmResStrTable::mppStrings)
			.addProperty("mFlag", &ghmResStrTable::mFlag)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad", &ghmResStrTable::mPad)
		.endClass();
	}
#endif
};
static_assert(sizeof(ghmResStrTable::mNum) == 4, "expected mNum to be size 4");
static_assert(sizeof(ghmResStrTable::mppStrings) == 4, "expected mppStrings to be size 4");
static_assert(sizeof(ghmResStrTable::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(ghmResStrTable::mPad) == 4, "expected mPad to be size 4");
static_assert(sizeof(class ghmResStrTable) == 16, "expected class ghmResStrTable to be size 16");

// union __m128
// no dependencies
union __m128
{
public:
	/// No namespace types
	/// Struct member variables

	// <float m128_f32[0x4], offset 0x0>
	float m128_f32[4];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<__m128>("__m128")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m128_f32", &__m128::m128_f32)
		.endClass();
	}
#endif
};
static_assert(sizeof(__m128::m128_f32) == 16, "expected m128_f32 to be size 16");
static_assert(sizeof(union __m128) == 16, "expected union __m128 to be size 16");

// class vector4f
// no dependencies
class vector4f
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint32_t u[0x4], offset 0x0>
	uint32_t u[4];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<vector4f>("vector4f")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("u", &vector4f::u)
		.endClass();
	}
#endif
};
static_assert(sizeof(vector4f::u) == 16, "expected u to be size 16");
static_assert(sizeof(class vector4f) == 16, "expected class vector4f to be size 16");

// class vector4x
// 1 dependencies: class vector4f
class vector4x
{
public:
	/// No namespace types
	/// Struct member variables

	// <double sd[0x2], offset 0x0>
	double sd[2];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<vector4x>("vector4x")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("sd", &vector4x::sd)
		.endClass();
	}
#endif
};
static_assert(sizeof(vector4x::sd) == 16, "expected sd to be size 16");
static_assert(sizeof(class vector4x) == 16, "expected class vector4x to be size 16");

// class tiVector
// 3 dependencies: class vector4x, class vector4f, union __m128
class tiVector
{
public:
	/// No namespace types
	/// Struct member variables

	// <float x, offset 0x0>
	float x;

	// <float y, offset 0x4>
	float y;

	// <float z, offset 0x8>
	float z;

	// <float w, offset 0xc>
	float w;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<tiVector>("tiVector")
			.addProperty("x", &tiVector::x)
			.addProperty("y", &tiVector::y)
			.addProperty("z", &tiVector::z)
			.addProperty("w", &tiVector::w)
		.endClass();
	}
#endif
};
static_assert(sizeof(tiVector::x) == 4, "expected x to be size 4");
static_assert(sizeof(tiVector::y) == 4, "expected y to be size 4");
static_assert(sizeof(tiVector::z) == 4, "expected z to be size 4");
static_assert(sizeof(tiVector::w) == 4, "expected w to be size 4");
static_assert(sizeof(class tiVector) == 16, "expected class tiVector to be size 16");

// class mot::IBoneEffectModel
// no dependencies
namespace mot
{
	class IBoneEffectModel
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <void* (* field_0)[0x1f], offset 0x0>
		void* (* field_0)[0x1f];

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<mot::IBoneEffectModel>("mot::IBoneEffectModel")
				// delegates are not supported in LuaBridge
				//.addProperty("field_0", &mot::IBoneEffectModel::field_0)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(mot::IBoneEffectModel::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(class mot::IBoneEffectModel) == 4, "expected class mot::IBoneEffectModel to be size 4");

// class mot::IBoneEffectModelPJ
// 5 dependencies: class mot::IBoneEffectModel, class tiVector, class vector4x, class vector4f, union __m128
namespace mot
{
	class IBoneEffectModelPJ : mot::IBoneEffectModel
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <class mot::IBoneEffectModel field_0, offset 0x0>
		// class IBoneEffectModel Super;

		// <Filler, offset 0x4>
		char _Filler1[12];

		// <class tiVector m_inYureBonePosiOfst, offset 0x10>
		class tiVector m_inYureBonePosiOfst;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<mot::IBoneEffectModelPJ>("mot::IBoneEffectModelPJ")
				.addProperty("m_inYureBonePosiOfst", &mot::IBoneEffectModelPJ::m_inYureBonePosiOfst)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(mot::IBoneEffectModelPJ::m_inYureBonePosiOfst) == 16, "expected m_inYureBonePosiOfst to be size 16");
static_assert(sizeof(class mot::IBoneEffectModelPJ) == 32, "expected class mot::IBoneEffectModelPJ to be size 32");

// class TGmf
// 7 dependencies: class mot::IBoneEffectModelPJ, class mot::IBoneEffectModel, class tiVector, class vector4x, class vector4f, union __m128, struct TGmf::tagMAIN
class TGmf : mot::IBoneEffectModelPJ
{
public:
	/// 1 namespace types: struct TGmf::tagMAIN

	// struct TGmf::tagMAIN
	// no dependencies
	struct tagMAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <Filler, offset 0x0>
		char _Filler[2284];

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TGmf::tagMAIN>("TGmf::tagMAIN")
			.endClass();
		}
#endif
	};
	static_assert(sizeof(struct TGmf::tagMAIN) == 2284, "expected struct TGmf::tagMAIN to be size 2284");


	/// Struct member variables

	// <class mot::IBoneEffectModelPJ field_0, offset 0x0>
	// class mot::IBoneEffectModelPJ Super;

	// <struct TGmf::tagMAIN dat, offset 0x20>
	struct TGmf::tagMAIN dat;

	// <uint8_t mUseLight, offset 0x90c>
	uint8_t mUseLight;

	// <Filler, offset 0x90d>
	char _Filler3[3];

	// <class TGanPlay* mpFrameInfoPlay, offset 0x910>
	class TGanPlay* mpFrameInfoPlay;

	// <class TGanPlayNode* mpFrameInfoNode, offset 0x914>
	class TGanPlayNode* mpFrameInfoNode;

	// <class TGanPlay* mpEffectInfoPlay, offset 0x918>
	class TGanPlay* mpEffectInfoPlay;

	// <class TGanPlayNode* mpSmokeParam1Node, offset 0x91c>
	class TGanPlayNode* mpSmokeParam1Node;

	// <class TGanPlayNode* mpSmokeParam2Node, offset 0x920>
	class TGanPlayNode* mpSmokeParam2Node;

	// <int32_t mHitFrameNum, offset 0x924>
	int32_t mHitFrameNum;

	// <int32_t mDmgMotNum, offset 0x928>
	int32_t mDmgMotNum;

	// <int32_t mGrdMotNum, offset 0x92c>
	int32_t mGrdMotNum;

	// <int32_t mNextGrdMotNum, offset 0x930>
	int32_t mNextGrdMotNum;

	// <int32_t mAtkDirec, offset 0x934>
	int32_t mAtkDirec;

	// <int32_t mEffectNum, offset 0x938>
	int32_t mEffectNum;

	// <float mIKBlendRate, offset 0x93c>
	float mIKBlendRate;

	// <float mSlowRate, offset 0x940>
	float mSlowRate;

	// <uint8_t mbDrawMirror, offset 0x944>
	uint8_t mbDrawMirror;

	// <uint8_t mbObj, offset 0x945>
	uint8_t mbObj;

	// <Filler, offset 0x946>
	char _Filler18[2];

	// <float m_fFadeAlpha, offset 0x948>
	float m_fFadeAlpha;

	// <class TGmfNode* m_pLocatorNode, offset 0x94c>
	class TGmfNode* m_pLocatorNode;

	// <int32_t m_nTotalModel, offset 0x950>
	int32_t m_nTotalModel;

	// <int32_t m_nCurModelIndex, offset 0x954>
	int32_t m_nCurModelIndex;

	// <class TGmfNode* m_pCurModelTopNode, offset 0x958>
	class TGmfNode* m_pCurModelTopNode;

	// <class TGmfNode* m_pBoneEffectTopNode, offset 0x95c>
	class TGmfNode* m_pBoneEffectTopNode;

	// <uint32_t m_bActedSetupRefMesh, offset 0x960>
	uint32_t m_bActedSetupRefMesh;

	// <uint32_t m_bActedRefreshRefMesh, offset 0x964>
	uint32_t m_bActedRefreshRefMesh;

	// <class mot::IBoneEffectPJ* m_pBoneEffect, offset 0x968>
	class mot::IBoneEffectPJ* m_pBoneEffect;

	// <uint8_t m_bActedBoneEffectInit, offset 0x96c>
	uint8_t m_bActedBoneEffectInit;

	// <uint8_t m_bActBoneEffectOnUpdate, offset 0x96d>
	uint8_t m_bActBoneEffectOnUpdate;

	// <Filler, offset 0x96e>
	char _Filler29[2];

	// <char const* m_sIDName, offset 0x970>
	char const* m_sIDName;

	// <int32_t m_nIDNum, offset 0x974>
	int32_t m_nIDNum;

	// <char const* m_sMotName, offset 0x978>
	char const* m_sMotName;

	// <int32_t m_nTotalCamVibTiming, offset 0x97c>
	int32_t m_nTotalCamVibTiming;

	// <class CCameraVibTiming* m_ainCamVibTiming, offset 0x980>
	class CCameraVibTiming* m_ainCamVibTiming;

	// <uint8_t m_bIsBootCamVib, offset 0x984>
	uint8_t m_bIsBootCamVib;

	// <Filler, offset 0x985>
	char _Filler[11];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TGmf>("TGmf")
			.addProperty("dat", &TGmf::dat)
			.addProperty("mUseLight", &TGmf::mUseLight)
			.addProperty("mpFrameInfoPlay", &TGmf::mpFrameInfoPlay)
			.addProperty("mpFrameInfoNode", &TGmf::mpFrameInfoNode)
			.addProperty("mpEffectInfoPlay", &TGmf::mpEffectInfoPlay)
			.addProperty("mpSmokeParam1Node", &TGmf::mpSmokeParam1Node)
			.addProperty("mpSmokeParam2Node", &TGmf::mpSmokeParam2Node)
			.addProperty("mHitFrameNum", &TGmf::mHitFrameNum)
			.addProperty("mDmgMotNum", &TGmf::mDmgMotNum)
			.addProperty("mGrdMotNum", &TGmf::mGrdMotNum)
			.addProperty("mNextGrdMotNum", &TGmf::mNextGrdMotNum)
			.addProperty("mAtkDirec", &TGmf::mAtkDirec)
			.addProperty("mEffectNum", &TGmf::mEffectNum)
			.addProperty("mIKBlendRate", &TGmf::mIKBlendRate)
			.addProperty("mSlowRate", &TGmf::mSlowRate)
			.addProperty("mbDrawMirror", &TGmf::mbDrawMirror)
			.addProperty("mbObj", &TGmf::mbObj)
			.addProperty("m_fFadeAlpha", &TGmf::m_fFadeAlpha)
			.addProperty("m_pLocatorNode", &TGmf::m_pLocatorNode)
			.addProperty("m_nTotalModel", &TGmf::m_nTotalModel)
			.addProperty("m_nCurModelIndex", &TGmf::m_nCurModelIndex)
			.addProperty("m_pCurModelTopNode", &TGmf::m_pCurModelTopNode)
			.addProperty("m_pBoneEffectTopNode", &TGmf::m_pBoneEffectTopNode)
			.addProperty("m_bActedSetupRefMesh", &TGmf::m_bActedSetupRefMesh)
			.addProperty("m_bActedRefreshRefMesh", &TGmf::m_bActedRefreshRefMesh)
			.addProperty("m_pBoneEffect", &TGmf::m_pBoneEffect)
			.addProperty("m_bActedBoneEffectInit", &TGmf::m_bActedBoneEffectInit)
			.addProperty("m_bActBoneEffectOnUpdate", &TGmf::m_bActBoneEffectOnUpdate)
			.addProperty("m_sIDName", &TGmf::m_sIDName)
			.addProperty("m_nIDNum", &TGmf::m_nIDNum)
			.addProperty("m_sMotName", &TGmf::m_sMotName)
			.addProperty("m_nTotalCamVibTiming", &TGmf::m_nTotalCamVibTiming)
			.addProperty("m_ainCamVibTiming", &TGmf::m_ainCamVibTiming)
			.addProperty("m_bIsBootCamVib", &TGmf::m_bIsBootCamVib)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGmf::dat) == 2284, "expected dat to be size 2284");
static_assert(sizeof(TGmf::mUseLight) == 1, "expected mUseLight to be size 1");
static_assert(sizeof(TGmf::mpFrameInfoPlay) == 4, "expected mpFrameInfoPlay to be size 4");
static_assert(sizeof(TGmf::mpFrameInfoNode) == 4, "expected mpFrameInfoNode to be size 4");
static_assert(sizeof(TGmf::mpEffectInfoPlay) == 4, "expected mpEffectInfoPlay to be size 4");
static_assert(sizeof(TGmf::mpSmokeParam1Node) == 4, "expected mpSmokeParam1Node to be size 4");
static_assert(sizeof(TGmf::mpSmokeParam2Node) == 4, "expected mpSmokeParam2Node to be size 4");
static_assert(sizeof(TGmf::mHitFrameNum) == 4, "expected mHitFrameNum to be size 4");
static_assert(sizeof(TGmf::mDmgMotNum) == 4, "expected mDmgMotNum to be size 4");
static_assert(sizeof(TGmf::mGrdMotNum) == 4, "expected mGrdMotNum to be size 4");
static_assert(sizeof(TGmf::mNextGrdMotNum) == 4, "expected mNextGrdMotNum to be size 4");
static_assert(sizeof(TGmf::mAtkDirec) == 4, "expected mAtkDirec to be size 4");
static_assert(sizeof(TGmf::mEffectNum) == 4, "expected mEffectNum to be size 4");
static_assert(sizeof(TGmf::mIKBlendRate) == 4, "expected mIKBlendRate to be size 4");
static_assert(sizeof(TGmf::mSlowRate) == 4, "expected mSlowRate to be size 4");
static_assert(sizeof(TGmf::mbDrawMirror) == 1, "expected mbDrawMirror to be size 1");
static_assert(sizeof(TGmf::mbObj) == 1, "expected mbObj to be size 1");
static_assert(sizeof(TGmf::m_fFadeAlpha) == 4, "expected m_fFadeAlpha to be size 4");
static_assert(sizeof(TGmf::m_pLocatorNode) == 4, "expected m_pLocatorNode to be size 4");
static_assert(sizeof(TGmf::m_nTotalModel) == 4, "expected m_nTotalModel to be size 4");
static_assert(sizeof(TGmf::m_nCurModelIndex) == 4, "expected m_nCurModelIndex to be size 4");
static_assert(sizeof(TGmf::m_pCurModelTopNode) == 4, "expected m_pCurModelTopNode to be size 4");
static_assert(sizeof(TGmf::m_pBoneEffectTopNode) == 4, "expected m_pBoneEffectTopNode to be size 4");
static_assert(sizeof(TGmf::m_bActedSetupRefMesh) == 4, "expected m_bActedSetupRefMesh to be size 4");
static_assert(sizeof(TGmf::m_bActedRefreshRefMesh) == 4, "expected m_bActedRefreshRefMesh to be size 4");
static_assert(sizeof(TGmf::m_pBoneEffect) == 4, "expected m_pBoneEffect to be size 4");
static_assert(sizeof(TGmf::m_bActedBoneEffectInit) == 1, "expected m_bActedBoneEffectInit to be size 1");
static_assert(sizeof(TGmf::m_bActBoneEffectOnUpdate) == 1, "expected m_bActBoneEffectOnUpdate to be size 1");
static_assert(sizeof(TGmf::m_sIDName) == 4, "expected m_sIDName to be size 4");
static_assert(sizeof(TGmf::m_nIDNum) == 4, "expected m_nIDNum to be size 4");
static_assert(sizeof(TGmf::m_sMotName) == 4, "expected m_sMotName to be size 4");
static_assert(sizeof(TGmf::m_nTotalCamVibTiming) == 4, "expected m_nTotalCamVibTiming to be size 4");
static_assert(sizeof(TGmf::m_ainCamVibTiming) == 4, "expected m_ainCamVibTiming to be size 4");
static_assert(sizeof(TGmf::m_bIsBootCamVib) == 1, "expected m_bIsBootCamVib to be size 1");
static_assert(sizeof(class TGmf) == 2448, "expected class TGmf to be size 2448");

// class TGanPlay
// 1 dependencies: struct TGanPlay::MAIN
class TGanPlay
{
public:
	/// 1 namespace types: struct TGanPlay::MAIN

	// struct TGanPlay::MAIN
	// no dependencies
	struct MAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <class TGan* pGan, offset 0x0>
		class TGan* pGan;

		// <class TGanPlayNode* pTopNode, offset 0x4>
		class TGanPlayNode* pTopNode;

		// <class TFAnm* pFAnm, offset 0x8>
		class TFAnm* pFAnm;

		// <int32_t FAnmNum, offset 0xc>
		int32_t FAnmNum;

		// <class TGanPlayNode* pNode, offset 0x10>
		class TGanPlayNode* pNode;

		// <int32_t NodeNum, offset 0x14>
		int32_t NodeNum;

		// <uint8_t Loop, offset 0x18>
		uint8_t Loop;

		// <uint8_t PlayTyokugoFlag, offset 0x19>
		uint8_t PlayTyokugoFlag;

		// <uint8_t PlayFlag, offset 0x1a>
		uint8_t PlayFlag;

		// <Filler, offset 0x1b>
		char _Filler9[1];

		// <float PlayTick, offset 0x1c>
		float PlayTick;

		// <float Rate, offset 0x20>
		float Rate;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TGanPlay::MAIN>("TGanPlay::MAIN")
				.addProperty("pGan", &TGanPlay::MAIN::pGan)
				.addProperty("pTopNode", &TGanPlay::MAIN::pTopNode)
				.addProperty("pFAnm", &TGanPlay::MAIN::pFAnm)
				.addProperty("FAnmNum", &TGanPlay::MAIN::FAnmNum)
				.addProperty("pNode", &TGanPlay::MAIN::pNode)
				.addProperty("NodeNum", &TGanPlay::MAIN::NodeNum)
				.addProperty("Loop", &TGanPlay::MAIN::Loop)
				.addProperty("PlayTyokugoFlag", &TGanPlay::MAIN::PlayTyokugoFlag)
				.addProperty("PlayFlag", &TGanPlay::MAIN::PlayFlag)
				.addProperty("PlayTick", &TGanPlay::MAIN::PlayTick)
				.addProperty("Rate", &TGanPlay::MAIN::Rate)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TGanPlay::MAIN::pGan) == 4, "expected pGan to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::pTopNode) == 4, "expected pTopNode to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::pFAnm) == 4, "expected pFAnm to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::FAnmNum) == 4, "expected FAnmNum to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::pNode) == 4, "expected pNode to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::NodeNum) == 4, "expected NodeNum to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::Loop) == 1, "expected Loop to be size 1");
	static_assert(sizeof(TGanPlay::MAIN::PlayTyokugoFlag) == 1, "expected PlayTyokugoFlag to be size 1");
	static_assert(sizeof(TGanPlay::MAIN::PlayFlag) == 1, "expected PlayFlag to be size 1");
	static_assert(sizeof(TGanPlay::MAIN::PlayTick) == 4, "expected PlayTick to be size 4");
	static_assert(sizeof(TGanPlay::MAIN::Rate) == 4, "expected Rate to be size 4");
	static_assert(sizeof(struct TGanPlay::MAIN) == 36, "expected struct TGanPlay::MAIN to be size 36");


	/// Struct member variables

	// <struct TGanPlay::MAIN dat, offset 0x0>
	struct TGanPlay::MAIN dat;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TGanPlay>("TGanPlay")
			.addProperty("dat", &TGanPlay::dat)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGanPlay::dat) == 36, "expected dat to be size 36");
static_assert(sizeof(class TGanPlay) == 36, "expected class TGanPlay to be size 36");

// enum TGAN_STATE
enum TGAN_STATE : uint32_t
{
	// Enum values

	// <TGAN_STATE_INIT = 0x0>
	TGAN_STATE_INIT = 0,

	// <TGAN_STATE_STANDBY = 0x1>
	TGAN_STATE_STANDBY = 1,

	// <TGAN_STATE_ERROR = 0x2>
	TGAN_STATE_ERROR = 2

};

// class TGan
// 2 dependencies: struct TGan::tagMAIN, enum TGAN_STATE
class TGan
{
public:
	/// 1 namespace types: struct TGan::tagMAIN

	// struct TGan::tagMAIN
	// 1 dependencies: enum TGAN_STATE
	struct tagMAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <uint8_t ProcessBlock, offset 0x0>
		uint8_t ProcessBlock;

		// <uint8_t XYZLS16WKFlag, offset 0x1>
		uint8_t XYZLS16WKFlag;

		// <Filler, offset 0x2>
		char _Filler2[2];

		// <enum TGAN_STATE State, offset 0x4>
		enum TGAN_STATE State;

		// <struct WGanSpec* pSpec, offset 0x8>
		struct WGanSpec* pSpec;

		// <int32_t TimingSoundDataIndex, offset 0xc>
		int32_t TimingSoundDataIndex;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TGan::tagMAIN>("TGan::tagMAIN")
				.addProperty("ProcessBlock", &TGan::tagMAIN::ProcessBlock)
				.addProperty("XYZLS16WKFlag", &TGan::tagMAIN::XYZLS16WKFlag)
				.addProperty("State", &TGan::tagMAIN::State)
				.addProperty("pSpec", &TGan::tagMAIN::pSpec)
				.addProperty("TimingSoundDataIndex", &TGan::tagMAIN::TimingSoundDataIndex)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TGan::tagMAIN::ProcessBlock) == 1, "expected ProcessBlock to be size 1");
	static_assert(sizeof(TGan::tagMAIN::XYZLS16WKFlag) == 1, "expected XYZLS16WKFlag to be size 1");
	static_assert(sizeof(TGan::tagMAIN::State) == 4, "expected State to be size 4");
	static_assert(sizeof(TGan::tagMAIN::pSpec) == 4, "expected pSpec to be size 4");
	static_assert(sizeof(TGan::tagMAIN::TimingSoundDataIndex) == 4, "expected TimingSoundDataIndex to be size 4");
	static_assert(sizeof(struct TGan::tagMAIN) == 16, "expected struct TGan::tagMAIN to be size 16");


	/// Struct member variables

	// <struct TGan::tagMAIN dat, offset 0x0>
	struct TGan::tagMAIN dat;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TGan>("TGan")
			.addProperty("dat", &TGan::dat)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGan::dat) == 16, "expected dat to be size 16");
static_assert(sizeof(class TGan) == 16, "expected class TGan to be size 16");

// struct WGanSpec
// no dependencies
struct WGanSpec
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint32_t mID, offset 0x0>
	uint32_t mID;

	// <uint32_t mVersion, offset 0x4>
	uint32_t mVersion;

	// <uint32_t mStartTick, offset 0x8>
	uint32_t mStartTick;

	// <uint32_t mEndTick, offset 0xc>
	uint32_t mEndTick;

	// <uint32_t mFlag, offset 0x10>
	uint32_t mFlag;

	// <uint16_t mNodeCount, offset 0x14>
	uint16_t mNodeCount;

	// <uint16_t mMaterialCount, offset 0x16>
	uint16_t mMaterialCount;

	// <uint16_t mPad0[0x2], offset 0x18>
	uint16_t mPad0[2];

	// <struct WGanMaterialSpec* mpTopMaterial, offset 0x1c>
	struct WGanMaterialSpec* mpTopMaterial;

	// <struct WGanNodeSpec* mpTopNode, offset 0x20>
	struct WGanNodeSpec* mpTopNode;

	// <uint32_t mPad1[0x3], offset 0x24>
	uint32_t mPad1[3];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WGanSpec>("WGanSpec")
			.addProperty("mID", &WGanSpec::mID)
			.addProperty("mVersion", &WGanSpec::mVersion)
			.addProperty("mStartTick", &WGanSpec::mStartTick)
			.addProperty("mEndTick", &WGanSpec::mEndTick)
			.addProperty("mFlag", &WGanSpec::mFlag)
			.addProperty("mNodeCount", &WGanSpec::mNodeCount)
			.addProperty("mMaterialCount", &WGanSpec::mMaterialCount)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad0", &WGanSpec::mPad0)
			.addProperty("mpTopMaterial", &WGanSpec::mpTopMaterial)
			.addProperty("mpTopNode", &WGanSpec::mpTopNode)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad1", &WGanSpec::mPad1)
		.endClass();
	}
#endif
};
static_assert(sizeof(WGanSpec::mID) == 4, "expected mID to be size 4");
static_assert(sizeof(WGanSpec::mVersion) == 4, "expected mVersion to be size 4");
static_assert(sizeof(WGanSpec::mStartTick) == 4, "expected mStartTick to be size 4");
static_assert(sizeof(WGanSpec::mEndTick) == 4, "expected mEndTick to be size 4");
static_assert(sizeof(WGanSpec::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(WGanSpec::mNodeCount) == 2, "expected mNodeCount to be size 2");
static_assert(sizeof(WGanSpec::mMaterialCount) == 2, "expected mMaterialCount to be size 2");
static_assert(sizeof(WGanSpec::mPad0) == 4, "expected mPad0 to be size 4");
static_assert(sizeof(WGanSpec::mpTopMaterial) == 4, "expected mpTopMaterial to be size 4");
static_assert(sizeof(WGanSpec::mpTopNode) == 4, "expected mpTopNode to be size 4");
static_assert(sizeof(WGanSpec::mPad1) == 12, "expected mPad1 to be size 12");
static_assert(sizeof(struct WGanSpec) == 48, "expected struct WGanSpec to be size 48");

// struct WGanMaterialSpec
// no dependencies
struct WGanMaterialSpec
{
public:
	/// No namespace types
	/// Struct member variables

	// <char mIDStr[0x8], offset 0x0>
	char mIDStr[8];

	// <uint32_t mFlag, offset 0x8>
	uint32_t mFlag;

	// <uint32_t mPad0, offset 0xc>
	uint32_t mPad0;

	// <WGanMaterialSpec* mpPrev, offset 0x10>
	WGanMaterialSpec* mpPrev;

	// <WGanMaterialSpec* mpNext, offset 0x14>
	WGanMaterialSpec* mpNext;

	// <struct WGanFAnmSpec* mpFAnmSpec, offset 0x18>
	struct WGanFAnmSpec* mpFAnmSpec;

	// <struct WGanMaterialLayerSpec* mpTopLayer, offset 0x1c>
	struct WGanMaterialLayerSpec* mpTopLayer;

	// <uint32_t mPad1[0x4], offset 0x20>
	uint32_t mPad1[4];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WGanMaterialSpec>("WGanMaterialSpec")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mIDStr", &WGanMaterialSpec::mIDStr)
			.addProperty("mFlag", &WGanMaterialSpec::mFlag)
			.addProperty("mPad0", &WGanMaterialSpec::mPad0)
			.addProperty("mpPrev", &WGanMaterialSpec::mpPrev)
			.addProperty("mpNext", &WGanMaterialSpec::mpNext)
			.addProperty("mpFAnmSpec", &WGanMaterialSpec::mpFAnmSpec)
			.addProperty("mpTopLayer", &WGanMaterialSpec::mpTopLayer)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad1", &WGanMaterialSpec::mPad1)
		.endClass();
	}
#endif
};
static_assert(sizeof(WGanMaterialSpec::mIDStr) == 8, "expected mIDStr to be size 8");
static_assert(sizeof(WGanMaterialSpec::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(WGanMaterialSpec::mPad0) == 4, "expected mPad0 to be size 4");
static_assert(sizeof(WGanMaterialSpec::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(WGanMaterialSpec::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(WGanMaterialSpec::mpFAnmSpec) == 4, "expected mpFAnmSpec to be size 4");
static_assert(sizeof(WGanMaterialSpec::mpTopLayer) == 4, "expected mpTopLayer to be size 4");
static_assert(sizeof(WGanMaterialSpec::mPad1) == 16, "expected mPad1 to be size 16");
static_assert(sizeof(struct WGanMaterialSpec) == 48, "expected struct WGanMaterialSpec to be size 48");

// struct WGanFAnmSpec
// no dependencies
struct WGanFAnmSpec
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint16_t mFlag, offset 0x0>
	uint16_t mFlag;

	// <uint16_t mTFlag, offset 0x2>
	uint16_t mTFlag;

	// <uint32_t mStartTick, offset 0x4>
	uint32_t mStartTick;

	// <uint32_t mEndTick, offset 0x8>
	uint32_t mEndTick;

	// <uint32_t mHeaderCount, offset 0xc>
	uint32_t mHeaderCount;

	// <uint32_t mPad[0x3], offset 0x10>
	uint32_t mPad[3];

	// <struct _WFAnmObjHeader** mppHeader, offset 0x1c>
	struct _WFAnmObjHeader** mppHeader;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WGanFAnmSpec>("WGanFAnmSpec")
			.addProperty("mFlag", &WGanFAnmSpec::mFlag)
			.addProperty("mTFlag", &WGanFAnmSpec::mTFlag)
			.addProperty("mStartTick", &WGanFAnmSpec::mStartTick)
			.addProperty("mEndTick", &WGanFAnmSpec::mEndTick)
			.addProperty("mHeaderCount", &WGanFAnmSpec::mHeaderCount)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad", &WGanFAnmSpec::mPad)
			// pointer to pointer is not supported in LuaBridge
			//.addProperty("mppHeader", &WGanFAnmSpec::mppHeader)
		.endClass();
	}
#endif
};
static_assert(sizeof(WGanFAnmSpec::mFlag) == 2, "expected mFlag to be size 2");
static_assert(sizeof(WGanFAnmSpec::mTFlag) == 2, "expected mTFlag to be size 2");
static_assert(sizeof(WGanFAnmSpec::mStartTick) == 4, "expected mStartTick to be size 4");
static_assert(sizeof(WGanFAnmSpec::mEndTick) == 4, "expected mEndTick to be size 4");
static_assert(sizeof(WGanFAnmSpec::mHeaderCount) == 4, "expected mHeaderCount to be size 4");
static_assert(sizeof(WGanFAnmSpec::mPad) == 12, "expected mPad to be size 12");
static_assert(sizeof(WGanFAnmSpec::mppHeader) == 4, "expected mppHeader to be size 4");
static_assert(sizeof(struct WGanFAnmSpec) == 32, "expected struct WGanFAnmSpec to be size 32");

// struct _WFAnmObjHeader
// no dependencies
struct _WFAnmObjHeader
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint16_t mKeyListCount, offset 0x0>
	uint16_t mKeyListCount;

	// <uint16_t mType, offset 0x2>
	uint16_t mType;

	// <uint32_t mPad, offset 0x4>
	uint32_t mPad;

	// <struct _WFAnmObjKeyListHeader* mpListHeader[0x1], offset 0x8>
	struct _WFAnmObjKeyListHeader* mpListHeader[1];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<_WFAnmObjHeader>("_WFAnmObjHeader")
			.addProperty("mKeyListCount", &_WFAnmObjHeader::mKeyListCount)
			.addProperty("mType", &_WFAnmObjHeader::mType)
			.addProperty("mPad", &_WFAnmObjHeader::mPad)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mpListHeader", &_WFAnmObjHeader::mpListHeader)
		.endClass();
	}
#endif
};
static_assert(sizeof(_WFAnmObjHeader::mKeyListCount) == 2, "expected mKeyListCount to be size 2");
static_assert(sizeof(_WFAnmObjHeader::mType) == 2, "expected mType to be size 2");
static_assert(sizeof(_WFAnmObjHeader::mPad) == 4, "expected mPad to be size 4");
static_assert(sizeof(_WFAnmObjHeader::mpListHeader) == 4, "expected mpListHeader to be size 4");
static_assert(sizeof(struct _WFAnmObjHeader) == 12, "expected struct _WFAnmObjHeader to be size 12");

// struct _WFAnmObjKeyListHeader
// no dependencies
struct _WFAnmObjKeyListHeader
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[20];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<_WFAnmObjKeyListHeader>("_WFAnmObjKeyListHeader")
		.endClass();
	}
#endif
};
static_assert(sizeof(struct _WFAnmObjKeyListHeader) == 20, "expected struct _WFAnmObjKeyListHeader to be size 20");

// struct WGanMaterialLayerSpec
// no dependencies
struct WGanMaterialLayerSpec
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint32_t mFlag, offset 0x0>
	uint32_t mFlag;

	// <WGanMaterialLayerSpec* mpPrev, offset 0x4>
	WGanMaterialLayerSpec* mpPrev;

	// <WGanMaterialLayerSpec* mpNext, offset 0x8>
	WGanMaterialLayerSpec* mpNext;

	// <struct WGanFAnmSpec* mpFAnmSpec, offset 0xc>
	struct WGanFAnmSpec* mpFAnmSpec;

	// <uint32_t mPad[0x4], offset 0x10>
	uint32_t mPad[4];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WGanMaterialLayerSpec>("WGanMaterialLayerSpec")
			.addProperty("mFlag", &WGanMaterialLayerSpec::mFlag)
			.addProperty("mpPrev", &WGanMaterialLayerSpec::mpPrev)
			.addProperty("mpNext", &WGanMaterialLayerSpec::mpNext)
			.addProperty("mpFAnmSpec", &WGanMaterialLayerSpec::mpFAnmSpec)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad", &WGanMaterialLayerSpec::mPad)
		.endClass();
	}
#endif
};
static_assert(sizeof(WGanMaterialLayerSpec::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(WGanMaterialLayerSpec::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(WGanMaterialLayerSpec::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(WGanMaterialLayerSpec::mpFAnmSpec) == 4, "expected mpFAnmSpec to be size 4");
static_assert(sizeof(WGanMaterialLayerSpec::mPad) == 16, "expected mPad to be size 16");
static_assert(sizeof(struct WGanMaterialLayerSpec) == 32, "expected struct WGanMaterialLayerSpec to be size 32");

// struct WGanNodeSpec
// no dependencies
struct WGanNodeSpec
{
public:
	/// No namespace types
	/// Struct member variables

	// <char mIDStr[0x8], offset 0x0>
	char mIDStr[8];

	// <uint32_t mFlag, offset 0x8>
	uint32_t mFlag;

	// <uint32_t mPad0, offset 0xc>
	uint32_t mPad0;

	// <WGanNodeSpec* mpParent, offset 0x10>
	WGanNodeSpec* mpParent;

	// <WGanNodeSpec* mpChild, offset 0x14>
	WGanNodeSpec* mpChild;

	// <WGanNodeSpec* mpPrev, offset 0x18>
	WGanNodeSpec* mpPrev;

	// <WGanNodeSpec* mpNext, offset 0x1c>
	WGanNodeSpec* mpNext;

	// <struct WGanFAnmSpec* mpFAnmSpec, offset 0x20>
	struct WGanFAnmSpec* mpFAnmSpec;

	// <uint32_t mPad1[0x3], offset 0x24>
	uint32_t mPad1[3];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<WGanNodeSpec>("WGanNodeSpec")
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mIDStr", &WGanNodeSpec::mIDStr)
			.addProperty("mFlag", &WGanNodeSpec::mFlag)
			.addProperty("mPad0", &WGanNodeSpec::mPad0)
			.addProperty("mpParent", &WGanNodeSpec::mpParent)
			.addProperty("mpChild", &WGanNodeSpec::mpChild)
			.addProperty("mpPrev", &WGanNodeSpec::mpPrev)
			.addProperty("mpNext", &WGanNodeSpec::mpNext)
			.addProperty("mpFAnmSpec", &WGanNodeSpec::mpFAnmSpec)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mPad1", &WGanNodeSpec::mPad1)
		.endClass();
	}
#endif
};
static_assert(sizeof(WGanNodeSpec::mIDStr) == 8, "expected mIDStr to be size 8");
static_assert(sizeof(WGanNodeSpec::mFlag) == 4, "expected mFlag to be size 4");
static_assert(sizeof(WGanNodeSpec::mPad0) == 4, "expected mPad0 to be size 4");
static_assert(sizeof(WGanNodeSpec::mpParent) == 4, "expected mpParent to be size 4");
static_assert(sizeof(WGanNodeSpec::mpChild) == 4, "expected mpChild to be size 4");
static_assert(sizeof(WGanNodeSpec::mpPrev) == 4, "expected mpPrev to be size 4");
static_assert(sizeof(WGanNodeSpec::mpNext) == 4, "expected mpNext to be size 4");
static_assert(sizeof(WGanNodeSpec::mpFAnmSpec) == 4, "expected mpFAnmSpec to be size 4");
static_assert(sizeof(WGanNodeSpec::mPad1) == 12, "expected mPad1 to be size 12");
static_assert(sizeof(struct WGanNodeSpec) == 48, "expected struct WGanNodeSpec to be size 48");

// class TGanPlayNode
// 1 dependencies: struct TGanPlayNode::MAIN
class TGanPlayNode
{
public:
	/// 1 namespace types: struct TGanPlayNode::MAIN

	// struct TGanPlayNode::MAIN
	// no dependencies
	struct MAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <uint8_t ValidAnm, offset 0x0>
		uint8_t ValidAnm;

		// <Filler, offset 0x1>
		char _Filler1[3];

		// <class TFAnm* pAnm, offset 0x4>
		class TFAnm* pAnm;

		// <struct WGanNodeSpec* pSpec, offset 0x8>
		struct WGanNodeSpec* pSpec;

		// <class TGanPlay* pGanPlay, offset 0xc>
		class TGanPlay* pGanPlay;

		// <class TGanPlayNode* pNext, offset 0x10>
		class TGanPlayNode* pNext;

		// <class TGanPlayNode* pPrev, offset 0x14>
		class TGanPlayNode* pPrev;

		// <class TGanPlayNode* pChild, offset 0x18>
		class TGanPlayNode* pChild;

		// <class TGanPlayNode* pParent, offset 0x1c>
		class TGanPlayNode* pParent;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TGanPlayNode::MAIN>("TGanPlayNode::MAIN")
				.addProperty("ValidAnm", &TGanPlayNode::MAIN::ValidAnm)
				.addProperty("pAnm", &TGanPlayNode::MAIN::pAnm)
				.addProperty("pSpec", &TGanPlayNode::MAIN::pSpec)
				.addProperty("pGanPlay", &TGanPlayNode::MAIN::pGanPlay)
				.addProperty("pNext", &TGanPlayNode::MAIN::pNext)
				.addProperty("pPrev", &TGanPlayNode::MAIN::pPrev)
				.addProperty("pChild", &TGanPlayNode::MAIN::pChild)
				.addProperty("pParent", &TGanPlayNode::MAIN::pParent)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TGanPlayNode::MAIN::ValidAnm) == 1, "expected ValidAnm to be size 1");
	static_assert(sizeof(TGanPlayNode::MAIN::pAnm) == 4, "expected pAnm to be size 4");
	static_assert(sizeof(TGanPlayNode::MAIN::pSpec) == 4, "expected pSpec to be size 4");
	static_assert(sizeof(TGanPlayNode::MAIN::pGanPlay) == 4, "expected pGanPlay to be size 4");
	static_assert(sizeof(TGanPlayNode::MAIN::pNext) == 4, "expected pNext to be size 4");
	static_assert(sizeof(TGanPlayNode::MAIN::pPrev) == 4, "expected pPrev to be size 4");
	static_assert(sizeof(TGanPlayNode::MAIN::pChild) == 4, "expected pChild to be size 4");
	static_assert(sizeof(TGanPlayNode::MAIN::pParent) == 4, "expected pParent to be size 4");
	static_assert(sizeof(struct TGanPlayNode::MAIN) == 32, "expected struct TGanPlayNode::MAIN to be size 32");


	/// Struct member variables

	// <struct TGanPlayNode::MAIN dat, offset 0x0>
	struct TGanPlayNode::MAIN dat;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TGanPlayNode>("TGanPlayNode")
			.addProperty("dat", &TGanPlayNode::dat)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGanPlayNode::dat) == 32, "expected dat to be size 32");
static_assert(sizeof(class TGanPlayNode) == 32, "expected class TGanPlayNode to be size 32");

// class TFAnm
// 1 dependencies: struct TFAnm::tagMAIN
class TFAnm
{
public:
	/// 1 namespace types: struct TFAnm::tagMAIN

	// struct TFAnm::tagMAIN
	// no dependencies
	struct tagMAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <class TGmfNode* pGmfNode, offset 0x0>
		class TGmfNode* pGmfNode;

		// <class TFAnmObjF32_3* pAnmObj3, offset 0x4>
		class TFAnmObjF32_3* pAnmObj3;

		// <int32_t AnmObj3Num, offset 0x8>
		int32_t AnmObj3Num;

		// <class TFAnmObj* pAnmObj, offset 0xc>
		class TFAnmObj* pAnmObj;

		// <int32_t AnmObjNum, offset 0x10>
		int32_t AnmObjNum;

		// <float Rate, offset 0x14>
		float Rate;

		// <uint32_t Flag, offset 0x18>
		uint32_t Flag;

		// <float PlayTick, offset 0x1c>
		float PlayTick;

		// <float StartTick, offset 0x20>
		float StartTick;

		// <float EndTick, offset 0x24>
		float EndTick;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TFAnm::tagMAIN>("TFAnm::tagMAIN")
				.addProperty("pGmfNode", &TFAnm::tagMAIN::pGmfNode)
				.addProperty("pAnmObj3", &TFAnm::tagMAIN::pAnmObj3)
				.addProperty("AnmObj3Num", &TFAnm::tagMAIN::AnmObj3Num)
				.addProperty("pAnmObj", &TFAnm::tagMAIN::pAnmObj)
				.addProperty("AnmObjNum", &TFAnm::tagMAIN::AnmObjNum)
				.addProperty("Rate", &TFAnm::tagMAIN::Rate)
				.addProperty("Flag", &TFAnm::tagMAIN::Flag)
				.addProperty("PlayTick", &TFAnm::tagMAIN::PlayTick)
				.addProperty("StartTick", &TFAnm::tagMAIN::StartTick)
				.addProperty("EndTick", &TFAnm::tagMAIN::EndTick)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TFAnm::tagMAIN::pGmfNode) == 4, "expected pGmfNode to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::pAnmObj3) == 4, "expected pAnmObj3 to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::AnmObj3Num) == 4, "expected AnmObj3Num to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::pAnmObj) == 4, "expected pAnmObj to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::AnmObjNum) == 4, "expected AnmObjNum to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::Rate) == 4, "expected Rate to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::Flag) == 4, "expected Flag to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::PlayTick) == 4, "expected PlayTick to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::StartTick) == 4, "expected StartTick to be size 4");
	static_assert(sizeof(TFAnm::tagMAIN::EndTick) == 4, "expected EndTick to be size 4");
	static_assert(sizeof(struct TFAnm::tagMAIN) == 40, "expected struct TFAnm::tagMAIN to be size 40");


	/// Struct member variables

	// <struct TFAnm::tagMAIN dat, offset 0x0>
	struct TFAnm::tagMAIN dat;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TFAnm>("TFAnm")
			.addProperty("dat", &TFAnm::dat)
		.endClass();
	}
#endif
};
static_assert(sizeof(TFAnm::dat) == 40, "expected dat to be size 40");
static_assert(sizeof(class TFAnm) == 40, "expected class TFAnm to be size 40");

// class TGmfNode
// 1 dependencies: struct TGmfNode::tagMAIN
class TGmfNode
{
public:
	/// 1 namespace types: struct TGmfNode::tagMAIN

	// struct TGmfNode::tagMAIN
	// no dependencies
	struct tagMAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <Filler, offset 0x0>
		char _Filler[244];

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TGmfNode::tagMAIN>("TGmfNode::tagMAIN")
			.endClass();
		}
#endif
	};
	static_assert(sizeof(struct TGmfNode::tagMAIN) == 244, "expected struct TGmfNode::tagMAIN to be size 244");


	/// Struct member variables

	// <struct TGmfNode::tagMAIN dat, offset 0x0>
	struct TGmfNode::tagMAIN dat;

	// <uint8_t m_bIsAlwaysSetupMatrix, offset 0xf4>
	uint8_t m_bIsAlwaysSetupMatrix;

	// <Filler, offset 0xf5>
	char _Filler2[3];

	// <int32_t m_nPolyNum, offset 0xf8>
	int32_t m_nPolyNum;

	// <float m_inLocalMat[0x3][0x4], offset 0xfc>
	float m_inLocalMat[3][4];

	// <class CViewClipObjSphere* m_pViewClipObjSphere, offset 0x12c>
	class CViewClipObjSphere* m_pViewClipObjSphere;

	// <class CViewClipObjBox* m_pViewClipObjBox, offset 0x130>
	class CViewClipObjBox* m_pViewClipObjBox;

	// <float m_fClipDistSqu, offset 0x134>
	float m_fClipDistSqu;

	// <float m_inPreWorldMatMtx[0x3][0x4], offset 0x138>
	float m_inPreWorldMatMtx[3][4];

	// <class EfDestortion* mpDestortion, offset 0x168>
	class EfDestortion* mpDestortion;

	// <class CVertexAnimation* m_pVertexAnime, offset 0x16c>
	class CVertexAnimation* m_pVertexAnime;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TGmfNode>("TGmfNode")
			.addProperty("dat", &TGmfNode::dat)
			.addProperty("m_bIsAlwaysSetupMatrix", &TGmfNode::m_bIsAlwaysSetupMatrix)
			.addProperty("m_nPolyNum", &TGmfNode::m_nPolyNum)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_inLocalMat", &TGmfNode::m_inLocalMat)
			.addProperty("m_pViewClipObjSphere", &TGmfNode::m_pViewClipObjSphere)
			.addProperty("m_pViewClipObjBox", &TGmfNode::m_pViewClipObjBox)
			.addProperty("m_fClipDistSqu", &TGmfNode::m_fClipDistSqu)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_inPreWorldMatMtx", &TGmfNode::m_inPreWorldMatMtx)
			.addProperty("mpDestortion", &TGmfNode::mpDestortion)
			.addProperty("m_pVertexAnime", &TGmfNode::m_pVertexAnime)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGmfNode::dat) == 244, "expected dat to be size 244");
static_assert(sizeof(TGmfNode::m_bIsAlwaysSetupMatrix) == 1, "expected m_bIsAlwaysSetupMatrix to be size 1");
static_assert(sizeof(TGmfNode::m_nPolyNum) == 4, "expected m_nPolyNum to be size 4");
static_assert(sizeof(TGmfNode::m_inLocalMat) == 48, "expected m_inLocalMat to be size 48");
static_assert(sizeof(TGmfNode::m_pViewClipObjSphere) == 4, "expected m_pViewClipObjSphere to be size 4");
static_assert(sizeof(TGmfNode::m_pViewClipObjBox) == 4, "expected m_pViewClipObjBox to be size 4");
static_assert(sizeof(TGmfNode::m_fClipDistSqu) == 4, "expected m_fClipDistSqu to be size 4");
static_assert(sizeof(TGmfNode::m_inPreWorldMatMtx) == 48, "expected m_inPreWorldMatMtx to be size 48");
static_assert(sizeof(TGmfNode::mpDestortion) == 4, "expected mpDestortion to be size 4");
static_assert(sizeof(TGmfNode::m_pVertexAnime) == 4, "expected m_pVertexAnime to be size 4");
static_assert(sizeof(class TGmfNode) == 368, "expected class TGmfNode to be size 368");

// class CViewClipObjSphere
// 4 dependencies: class tiVector, class vector4x, class vector4f, union __m128
class CViewClipObjSphere
{
public:
	/// No namespace types
	/// Struct member variables

	// <class tiVector m_inPosi, offset 0x0>
	class tiVector m_inPosi;

	// <float m_fRadius, offset 0x10>
	float m_fRadius;

	// <Filler, offset 0x14>
	char _Filler[12];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CViewClipObjSphere>("CViewClipObjSphere")
			.addProperty("m_inPosi", &CViewClipObjSphere::m_inPosi)
			.addProperty("m_fRadius", &CViewClipObjSphere::m_fRadius)
		.endClass();
	}
#endif
};
static_assert(sizeof(CViewClipObjSphere::m_inPosi) == 16, "expected m_inPosi to be size 16");
static_assert(sizeof(CViewClipObjSphere::m_fRadius) == 4, "expected m_fRadius to be size 4");
static_assert(sizeof(class CViewClipObjSphere) == 32, "expected class CViewClipObjSphere to be size 32");

// class CViewClipObjBox
// no dependencies
class CViewClipObjBox
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[64];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CViewClipObjBox>("CViewClipObjBox")
		.endClass();
	}
#endif
};
static_assert(sizeof(class CViewClipObjBox) == 64, "expected class CViewClipObjBox to be size 64");

// enum GHMR_PRIMTYPE
enum GHMR_PRIMTYPE : uint32_t
{
	// Enum values

	// <GHMR_PRIMTYPE_POINTLIST = 0x0>
	GHMR_PRIMTYPE_POINTLIST = 0,

	// <GHMR_PRIMTYPE_LINELIST = 0x1>
	GHMR_PRIMTYPE_LINELIST = 1,

	// <GHMR_PRIMTYPE_LINESTRIP = 0x2>
	GHMR_PRIMTYPE_LINESTRIP = 2,

	// <GHMR_PRIMTYPE_TRIANGLELIST = 0x3>
	GHMR_PRIMTYPE_TRIANGLELIST = 3,

	// <GHMR_PRIMTYPE_TRIANGLESTRIP = 0x4>
	GHMR_PRIMTYPE_TRIANGLESTRIP = 4,

	// <GHMR_PRIMTYPE_TRIANGLEFAN = 0x5>
	GHMR_PRIMTYPE_TRIANGLEFAN = 5,

	// <GHMR_PRIMTYPE_QUADLIST = 0x6>
	GHMR_PRIMTYPE_QUADLIST = 6

};

// enum GHMR_PROJECT
enum GHMR_PROJECT : uint32_t
{
	// Enum values

	// <GHMR_PROJECT_PERS = 0x0>
	GHMR_PROJECT_PERS = 0,

	// <GHMR_PROJECT_ORTHO = 0x1>
	GHMR_PROJECT_ORTHO = 1,

	// <GHMR_PROJECT_NUM = 0x2>
	GHMR_PROJECT_NUM = 2

};

// class rPrimUnific
// 2 dependencies: enum GHMR_PROJECT, enum GHMR_PRIMTYPE
class rPrimUnific
{
public:
	/// No namespace types
	/// Struct member variables

	// <class rPrimBase* m_pListTop, offset 0x0>
	class rPrimBase* m_pListTop;

	// <class rPrimBase* m_pListEnd, offset 0x4>
	class rPrimBase* m_pListEnd;

	// <enum GHMR_PROJECT m_ProjectMode, offset 0x8>
	enum GHMR_PROJECT m_ProjectMode;

	// <enum GHMR_PRIMTYPE m_PrimType, offset 0xc>
	enum GHMR_PRIMTYPE m_PrimType;

	// <uint32_t m_PrimNum, offset 0x10>
	uint32_t m_PrimNum;

	// <struct tagGHMR_TEX* m_pTex, offset 0x14>
	struct tagGHMR_TEX* m_pTex;

	// <struct tagGHMR_TEX* m_pMultiTex, offset 0x18>
	struct tagGHMR_TEX* m_pMultiTex;

	// <uint32_t m_BitFlag, offset 0x1c>
	uint32_t m_BitFlag;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rPrimUnific>("rPrimUnific")
			.addProperty("m_pListTop", &rPrimUnific::m_pListTop)
			.addProperty("m_pListEnd", &rPrimUnific::m_pListEnd)
			.addProperty("m_ProjectMode", &rPrimUnific::m_ProjectMode)
			.addProperty("m_PrimType", &rPrimUnific::m_PrimType)
			.addProperty("m_PrimNum", &rPrimUnific::m_PrimNum)
			.addProperty("m_pTex", &rPrimUnific::m_pTex)
			.addProperty("m_pMultiTex", &rPrimUnific::m_pMultiTex)
			.addProperty("m_BitFlag", &rPrimUnific::m_BitFlag)
		.endClass();
	}
#endif
};
static_assert(sizeof(rPrimUnific::m_pListTop) == 4, "expected m_pListTop to be size 4");
static_assert(sizeof(rPrimUnific::m_pListEnd) == 4, "expected m_pListEnd to be size 4");
static_assert(sizeof(rPrimUnific::m_ProjectMode) == 4, "expected m_ProjectMode to be size 4");
static_assert(sizeof(rPrimUnific::m_PrimType) == 4, "expected m_PrimType to be size 4");
static_assert(sizeof(rPrimUnific::m_PrimNum) == 4, "expected m_PrimNum to be size 4");
static_assert(sizeof(rPrimUnific::m_pTex) == 4, "expected m_pTex to be size 4");
static_assert(sizeof(rPrimUnific::m_pMultiTex) == 4, "expected m_pMultiTex to be size 4");
static_assert(sizeof(rPrimUnific::m_BitFlag) == 4, "expected m_BitFlag to be size 4");
static_assert(sizeof(class rPrimUnific) == 32, "expected class rPrimUnific to be size 32");

// class EfBase
// no dependencies
class EfBase
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint8_t mBitFlag, offset 0x0>
	uint8_t mBitFlag;

	// <Filler, offset 0x1>
	char _Filler1[3];

	// <uint32_t mTick, offset 0x4>
	uint32_t mTick;

	// <uint32_t mBefFrameTick, offset 0x8>
	uint32_t mBefFrameTick;

	// <float mRate, offset 0xc>
	float mRate;

	// <uint32_t mSelectParam, offset 0x10>
	uint32_t mSelectParam;

	// <uint32_t mKeyWait, offset 0x14>
	uint32_t mKeyWait;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<EfBase>("EfBase")
			.addProperty("mBitFlag", &EfBase::mBitFlag)
			.addProperty("mTick", &EfBase::mTick)
			.addProperty("mBefFrameTick", &EfBase::mBefFrameTick)
			.addProperty("mRate", &EfBase::mRate)
			.addProperty("mSelectParam", &EfBase::mSelectParam)
			.addProperty("mKeyWait", &EfBase::mKeyWait)
		.endClass();
	}
#endif
};
static_assert(sizeof(EfBase::mBitFlag) == 1, "expected mBitFlag to be size 1");
static_assert(sizeof(EfBase::mTick) == 4, "expected mTick to be size 4");
static_assert(sizeof(EfBase::mBefFrameTick) == 4, "expected mBefFrameTick to be size 4");
static_assert(sizeof(EfBase::mRate) == 4, "expected mRate to be size 4");
static_assert(sizeof(EfBase::mSelectParam) == 4, "expected mSelectParam to be size 4");
static_assert(sizeof(EfBase::mKeyWait) == 4, "expected mKeyWait to be size 4");
static_assert(sizeof(class EfBase) == 24, "expected class EfBase to be size 24");

// class HrTask
// no dependencies
class HrTask
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[80];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HrTask>("HrTask")
		.endClass();
	}
#endif
};
static_assert(sizeof(class HrTask) == 80, "expected class HrTask to be size 80");

// class EfDestortion
// 6 dependencies: class HrTask, class EfBase, enum EfDestortion::UV_Type, class rPrimUnific, enum GHMR_PROJECT, enum GHMR_PRIMTYPE
class EfDestortion : HrTask
{
public:
	/// 1 namespace types: enum EfDestortion::UV_Type

	// enum EfDestortion::UV_Type
	enum UV_Type : uint32_t
	{
		// Enum values

		// <UV_Sin = 0x1>
		UV_Sin = 1,

		// <UV_Rand = 0x2>
		UV_Rand = 2

	};


	/// Struct member variables

	// <class HrTask field_0, offset 0x0>
	// class HrTask Super;

	// <class EfBase field_50, offset 0x50>
	class EfBase field_50;

	// <class TGmfNode* mpNode, offset 0x68>
	class TGmfNode* mpNode;

	// <struct TGMFMESH** mppMeshList, offset 0x6c>
	struct TGMFMESH** mppMeshList;

	// <uint32_t mTriangleNum, offset 0x70>
	uint32_t mTriangleNum;

	// <float mScreenWidthInv, offset 0x74>
	float mScreenWidthInv;

	// <float mAmplitude, offset 0x78>
	float mAmplitude;

	// <enum EfDestortion::UV_Type mType, offset 0x7c>
	enum EfDestortion::UV_Type mType;

	// <uint8_t* mpRandIdxAry, offset 0x80>
	uint8_t* mpRandIdxAry;

	// <class rTriangleList* mpTriangleAry, offset 0x84>
	class rTriangleList* mpTriangleAry;

	// <class rPrimUnific mTriangleUni, offset 0x88>
	class rPrimUnific mTriangleUni;

	// <uint8_t mbRenderWait, offset 0xa8>
	uint8_t mbRenderWait;

	// <Filler, offset 0xa9>
	char _Filler12[3];

	// <float mSinCnt[0x64], offset 0xac>
	float mSinCnt[100];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<EfDestortion>("EfDestortion")
			.addProperty("field_50", &EfDestortion::field_50)
			.addProperty("mpNode", &EfDestortion::mpNode)
			// pointer to pointer is not supported in LuaBridge
			//.addProperty("mppMeshList", &EfDestortion::mppMeshList)
			.addProperty("mTriangleNum", &EfDestortion::mTriangleNum)
			.addProperty("mScreenWidthInv", &EfDestortion::mScreenWidthInv)
			.addProperty("mAmplitude", &EfDestortion::mAmplitude)
			.addProperty("mType", &EfDestortion::mType)
			// native pointer type (uint8_t*) not supported in LuaBridge (needs wrapper function)
			//.addProperty("mpRandIdxAry", &EfDestortion::mpRandIdxAry)
			.addProperty("mpTriangleAry", &EfDestortion::mpTriangleAry)
			.addProperty("mTriangleUni", &EfDestortion::mTriangleUni)
			.addProperty("mbRenderWait", &EfDestortion::mbRenderWait)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mSinCnt", &EfDestortion::mSinCnt)
		.endClass();
	}
#endif
};
static_assert(sizeof(EfDestortion::field_50) == 24, "expected field_50 to be size 24");
static_assert(sizeof(EfDestortion::mpNode) == 4, "expected mpNode to be size 4");
static_assert(sizeof(EfDestortion::mppMeshList) == 4, "expected mppMeshList to be size 4");
static_assert(sizeof(EfDestortion::mTriangleNum) == 4, "expected mTriangleNum to be size 4");
static_assert(sizeof(EfDestortion::mScreenWidthInv) == 4, "expected mScreenWidthInv to be size 4");
static_assert(sizeof(EfDestortion::mAmplitude) == 4, "expected mAmplitude to be size 4");
static_assert(sizeof(EfDestortion::mType) == 4, "expected mType to be size 4");
static_assert(sizeof(EfDestortion::mpRandIdxAry) == 4, "expected mpRandIdxAry to be size 4");
static_assert(sizeof(EfDestortion::mpTriangleAry) == 4, "expected mpTriangleAry to be size 4");
static_assert(sizeof(EfDestortion::mTriangleUni) == 32, "expected mTriangleUni to be size 32");
static_assert(sizeof(EfDestortion::mbRenderWait) == 1, "expected mbRenderWait to be size 1");
static_assert(sizeof(EfDestortion::mSinCnt) == 400, "expected mSinCnt to be size 400");
static_assert(sizeof(class EfDestortion) == 572, "expected class EfDestortion to be size 572");

// struct TGMFMESH
// no dependencies
struct TGMFMESH
{
public:
	/// No namespace types
	/// Struct member variables

	// <class TGmfNode* pNode, offset 0x0>
	class TGmfNode* pNode;

	// <struct tagGHMR_TEX* pTex, offset 0x4>
	struct tagGHMR_TEX* pTex;

	// <int32_t VertexNum, offset 0x8>
	int32_t VertexNum;

	// <int32_t PolyNum, offset 0xc>
	int32_t PolyNum;

	// <uint32_t VertexSize, offset 0x10>
	uint32_t VertexSize;

	// <uint32_t TransVertexSize, offset 0x14>
	uint32_t TransVertexSize;

	// <uint8_t HaveNormal, offset 0x18>
	uint8_t HaveNormal;

	// <uint8_t HaveColor, offset 0x19>
	uint8_t HaveColor;

	// <uint8_t HaveUV, offset 0x1a>
	uint8_t HaveUV;

	// <uint8_t Transform, offset 0x1b>
	uint8_t Transform;

	// <float TransMat[0x8][0x3][0x4], offset 0x1c>
	float TransMat[8][3][4];

	// <void* Vertex, offset 0x19c>
	void* Vertex;

	// <void* TransVertex, offset 0x1a0>
	void* TransVertex;

	// <uint32_t* PolyList, offset 0x1a4>
	uint32_t* PolyList;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TGMFMESH>("TGMFMESH")
			.addProperty("pNode", &TGMFMESH::pNode)
			.addProperty("pTex", &TGMFMESH::pTex)
			.addProperty("VertexNum", &TGMFMESH::VertexNum)
			.addProperty("PolyNum", &TGMFMESH::PolyNum)
			.addProperty("VertexSize", &TGMFMESH::VertexSize)
			.addProperty("TransVertexSize", &TGMFMESH::TransVertexSize)
			.addProperty("HaveNormal", &TGMFMESH::HaveNormal)
			.addProperty("HaveColor", &TGMFMESH::HaveColor)
			.addProperty("HaveUV", &TGMFMESH::HaveUV)
			.addProperty("Transform", &TGMFMESH::Transform)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("TransMat", &TGMFMESH::TransMat)
			// void type not supported in LuaBridge
			//.addProperty("Vertex", &TGMFMESH::Vertex)
			// void type not supported in LuaBridge
			//.addProperty("TransVertex", &TGMFMESH::TransVertex)
			// native pointer type (uint32_t*) not supported in LuaBridge (needs wrapper function)
			//.addProperty("PolyList", &TGMFMESH::PolyList)
		.endClass();
	}
#endif
};
static_assert(sizeof(TGMFMESH::pNode) == 4, "expected pNode to be size 4");
static_assert(sizeof(TGMFMESH::pTex) == 4, "expected pTex to be size 4");
static_assert(sizeof(TGMFMESH::VertexNum) == 4, "expected VertexNum to be size 4");
static_assert(sizeof(TGMFMESH::PolyNum) == 4, "expected PolyNum to be size 4");
static_assert(sizeof(TGMFMESH::VertexSize) == 4, "expected VertexSize to be size 4");
static_assert(sizeof(TGMFMESH::TransVertexSize) == 4, "expected TransVertexSize to be size 4");
static_assert(sizeof(TGMFMESH::HaveNormal) == 1, "expected HaveNormal to be size 1");
static_assert(sizeof(TGMFMESH::HaveColor) == 1, "expected HaveColor to be size 1");
static_assert(sizeof(TGMFMESH::HaveUV) == 1, "expected HaveUV to be size 1");
static_assert(sizeof(TGMFMESH::Transform) == 1, "expected Transform to be size 1");
static_assert(sizeof(TGMFMESH::TransMat) == 384, "expected TransMat to be size 384");
static_assert(sizeof(TGMFMESH::Vertex) == 4, "expected Vertex to be size 4");
static_assert(sizeof(TGMFMESH::TransVertex) == 4, "expected TransVertex to be size 4");
static_assert(sizeof(TGMFMESH::PolyList) == 4, "expected PolyList to be size 4");
static_assert(sizeof(struct TGMFMESH) == 424, "expected struct TGMFMESH to be size 424");

// enum GHMR_TEXDOT_ASPECT
enum GHMR_TEXDOT_ASPECT : uint32_t
{
	// Enum values

	// <GHMR_TEXDOT_ASPECT_1x1 = 0x0>
	GHMR_TEXDOT_ASPECT_1x1 = 0,

	// <GHMR_TEXDOT_ASPECT_CANCEL = 0x1>
	GHMR_TEXDOT_ASPECT_CANCEL = 1

};

// enum _GXTexFmt
enum _GXTexFmt : uint32_t
{
	// Enum values

	// <GX_TF_I4 = 0x0>
	GX_TF_I4 = 0,

	// <GX_TF_I8 = 0x1>
	GX_TF_I8 = 1,

	// <GX_TF_IA4 = 0x2>
	GX_TF_IA4 = 2,

	// <GX_TF_IA8 = 0x3>
	GX_TF_IA8 = 3,

	// <GX_TF_RGB565 = 0x4>
	GX_TF_RGB565 = 4,

	// <GX_TF_RGB5A3 = 0x5>
	GX_TF_RGB5A3 = 5,

	// <GX_TF_RGBA8 = 0x6>
	GX_TF_RGBA8 = 6,

	// <GX_TF_CMPR = 0xe>
	GX_TF_CMPR = 14,

	// <GX_CTF_R4 = 0x20>
	GX_CTF_R4 = 32,

	// <GX_CTF_RA4 = 0x22>
	GX_CTF_RA4 = 34,

	// <GX_CTF_RA8 = 0x23>
	GX_CTF_RA8 = 35,

	// <GX_CTF_YUVA8 = 0x26>
	GX_CTF_YUVA8 = 38,

	// <GX_CTF_A8 = 0x27>
	GX_CTF_A8 = 39,

	// <GX_CTF_R8 = 0x28>
	GX_CTF_R8 = 40,

	// <GX_CTF_G8 = 0x29>
	GX_CTF_G8 = 41,

	// <GX_CTF_B8 = 0x2a>
	GX_CTF_B8 = 42,

	// <GX_CTF_RG8 = 0x2b>
	GX_CTF_RG8 = 43,

	// <GX_CTF_GB8 = 0x2c>
	GX_CTF_GB8 = 44,

	// <GX_TF_Z8 = 0x11>
	GX_TF_Z8 = 17,

	// <GX_TF_Z16 = 0x13>
	GX_TF_Z16 = 19,

	// <GX_TF_Z24X8 = 0x16>
	GX_TF_Z24X8 = 22,

	// <GX_CTF_Z4 = 0x30>
	GX_CTF_Z4 = 48,

	// <GX_CTF_Z8M = 0x39>
	GX_CTF_Z8M = 57,

	// <GX_CTF_Z8L = 0x3a>
	GX_CTF_Z8L = 58,

	// <GX_CTF_Z16L = 0x3c>
	GX_CTF_Z16L = 60,

	// <GX_TF_A8 = 0x27>
	GX_TF_A8 = 39

};

// enum GHMR_TEXFILTER
enum GHMR_TEXFILTER : uint32_t
{
	// Enum values

	// <GHMR_TEXFILTER_NEAR = 0x0>
	GHMR_TEXFILTER_NEAR = 0,

	// <GHMR_TEXFILTER_LINEAR = 0x1>
	GHMR_TEXFILTER_LINEAR = 1

};

// enum GHMR_TEXADDRESS
enum GHMR_TEXADDRESS : uint32_t
{
	// Enum values

	// <GHMR_TEXADDRESS_CLAMP = 0x0>
	GHMR_TEXADDRESS_CLAMP = 0,

	// <GHMR_TEXADDRESS_REPEAT = 0x1>
	GHMR_TEXADDRESS_REPEAT = 1,

	// <GHMR_TEXADDRESS_MIRROR = 0x2>
	GHMR_TEXADDRESS_MIRROR = 2,

	// <GHMR_TEXADDRESS_REPEAT_FORCED = 0x3>
	GHMR_TEXADDRESS_REPEAT_FORCED = 3,

	// <GHMR_TEXADDRESS_MIRROR_FORCED = 0x4>
	GHMR_TEXADDRESS_MIRROR_FORCED = 4

};

// struct GXTexObj
// no dependencies
struct GXTexObj
{
public:
	/// No namespace types
	/// Struct member variables

	// <class GXTexture* pTex, offset 0x0>
	class GXTexture* pTex;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GXTexObj>("GXTexObj")
			.addProperty("pTex", &GXTexObj::pTex)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXTexObj::pTex) == 4, "expected pTex to be size 4");
static_assert(sizeof(struct GXTexObj) == 4, "expected struct GXTexObj to be size 4");

// struct tagGHMR_TEX
// 5 dependencies: struct GXTexObj, enum GHMR_TEXADDRESS, enum GHMR_TEXFILTER, enum _GXTexFmt, enum GHMR_TEXDOT_ASPECT
struct tagGHMR_TEX
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint8_t TMEFlag, offset 0x0>
	uint8_t TMEFlag;

	// <uint8_t AlphaFlag, offset 0x1>
	uint8_t AlphaFlag;

	// <uint8_t ImageBufferFreeFlag, offset 0x2>
	uint8_t ImageBufferFreeFlag;

	// <Filler, offset 0x3>
	char _Filler3[1];

	// <void* FileImage, offset 0x4>
	void* FileImage;

	// <void* ImageBuffer, offset 0x8>
	void* ImageBuffer;

	// <uint16_t Width, offset 0xc>
	uint16_t Width;

	// <uint16_t Height, offset 0xe>
	uint16_t Height;

	// <struct GXTexObj TexObj, offset 0x10>
	struct GXTexObj TexObj;

	// <enum GHMR_TEXADDRESS AddressMode, offset 0x14>
	enum GHMR_TEXADDRESS AddressMode;

	// <enum GHMR_TEXFILTER FilterMode, offset 0x18>
	enum GHMR_TEXFILTER FilterMode;

	// <enum _GXTexFmt GetScreenImageFormat, offset 0x1c>
	enum _GXTexFmt GetScreenImageFormat;

	// <int32_t ImageSize, offset 0x20>
	int32_t ImageSize;

	// <enum GHMR_TEXDOT_ASPECT Aspect, offset 0x24>
	enum GHMR_TEXDOT_ASPECT Aspect;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<tagGHMR_TEX>("tagGHMR_TEX")
			.addProperty("TMEFlag", &tagGHMR_TEX::TMEFlag)
			.addProperty("AlphaFlag", &tagGHMR_TEX::AlphaFlag)
			.addProperty("ImageBufferFreeFlag", &tagGHMR_TEX::ImageBufferFreeFlag)
			// void type not supported in LuaBridge
			//.addProperty("FileImage", &tagGHMR_TEX::FileImage)
			// void type not supported in LuaBridge
			//.addProperty("ImageBuffer", &tagGHMR_TEX::ImageBuffer)
			.addProperty("Width", &tagGHMR_TEX::Width)
			.addProperty("Height", &tagGHMR_TEX::Height)
			.addProperty("TexObj", &tagGHMR_TEX::TexObj)
			.addProperty("AddressMode", &tagGHMR_TEX::AddressMode)
			.addProperty("FilterMode", &tagGHMR_TEX::FilterMode)
			.addProperty("GetScreenImageFormat", &tagGHMR_TEX::GetScreenImageFormat)
			.addProperty("ImageSize", &tagGHMR_TEX::ImageSize)
			.addProperty("Aspect", &tagGHMR_TEX::Aspect)
		.endClass();
	}
#endif
};
static_assert(sizeof(tagGHMR_TEX::TMEFlag) == 1, "expected TMEFlag to be size 1");
static_assert(sizeof(tagGHMR_TEX::AlphaFlag) == 1, "expected AlphaFlag to be size 1");
static_assert(sizeof(tagGHMR_TEX::ImageBufferFreeFlag) == 1, "expected ImageBufferFreeFlag to be size 1");
static_assert(sizeof(tagGHMR_TEX::FileImage) == 4, "expected FileImage to be size 4");
static_assert(sizeof(tagGHMR_TEX::ImageBuffer) == 4, "expected ImageBuffer to be size 4");
static_assert(sizeof(tagGHMR_TEX::Width) == 2, "expected Width to be size 2");
static_assert(sizeof(tagGHMR_TEX::Height) == 2, "expected Height to be size 2");
static_assert(sizeof(tagGHMR_TEX::TexObj) == 4, "expected TexObj to be size 4");
static_assert(sizeof(tagGHMR_TEX::AddressMode) == 4, "expected AddressMode to be size 4");
static_assert(sizeof(tagGHMR_TEX::FilterMode) == 4, "expected FilterMode to be size 4");
static_assert(sizeof(tagGHMR_TEX::GetScreenImageFormat) == 4, "expected GetScreenImageFormat to be size 4");
static_assert(sizeof(tagGHMR_TEX::ImageSize) == 4, "expected ImageSize to be size 4");
static_assert(sizeof(tagGHMR_TEX::Aspect) == 4, "expected Aspect to be size 4");
static_assert(sizeof(struct tagGHMR_TEX) == 40, "expected struct tagGHMR_TEX to be size 40");

// union GXSamplerStuff
// no dependencies
union GXSamplerStuff
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint32_t wrapS, offset 0x0>
	uint32_t wrapS;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GXSamplerStuff>("GXSamplerStuff")
			.addProperty("wrapS", &GXSamplerStuff::wrapS)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXSamplerStuff::wrapS) == 4, "expected wrapS to be size 4");
static_assert(sizeof(union GXSamplerStuff) == 4, "expected union GXSamplerStuff to be size 4");

// class GXTexture
// 9 dependencies: class EE::RefObject, union GXSamplerStuff, class EE::SmartPtr<ID3D11ShaderResourceView>, struct GXTexture::GXSpecs, enum _GXTexFmt, class EE::SmartPtr<ID3D11Texture2D>, class EE::SmartPtr<ID3D11RenderTargetView>, class EE::SmartPtr<ID3D11DepthStencilView>, struct D3D11_MAPPED_SUBRESOURCE
class GXTexture : EE::RefObject
{
public:
	/// 1 namespace types: struct GXTexture::GXSpecs

	// struct GXTexture::GXSpecs
	// 1 dependencies: enum _GXTexFmt
	struct GXSpecs
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <uint16_t width, offset 0x0>
		uint16_t width;

		// <uint16_t height, offset 0x2>
		uint16_t height;

		// <uint16_t rtWidth, offset 0x4>
		uint16_t rtWidth;

		// <uint16_t rtHeight, offset 0x6>
		uint16_t rtHeight;

		// <enum _GXTexFmt format, offset 0x8>
		enum _GXTexFmt format;

		// <uint8_t mipmap, offset 0xc>
		uint8_t mipmap;

		// <uint8_t bias_clamp, offset 0xd>
		uint8_t bias_clamp;

		// <uint8_t do_edge_lod, offset 0xe>
		uint8_t do_edge_lod;

		// <Filler, offset 0xf>
		char _Filler8[1];

		// <uint32_t hash, offset 0x10>
		uint32_t hash;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<GXTexture::GXSpecs>("GXTexture::GXSpecs")
				.addProperty("width", &GXTexture::GXSpecs::width)
				.addProperty("height", &GXTexture::GXSpecs::height)
				.addProperty("rtWidth", &GXTexture::GXSpecs::rtWidth)
				.addProperty("rtHeight", &GXTexture::GXSpecs::rtHeight)
				.addProperty("format", &GXTexture::GXSpecs::format)
				.addProperty("mipmap", &GXTexture::GXSpecs::mipmap)
				.addProperty("bias_clamp", &GXTexture::GXSpecs::bias_clamp)
				.addProperty("do_edge_lod", &GXTexture::GXSpecs::do_edge_lod)
				.addProperty("hash", &GXTexture::GXSpecs::hash)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(GXTexture::GXSpecs::width) == 2, "expected width to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::height) == 2, "expected height to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::rtWidth) == 2, "expected rtWidth to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::rtHeight) == 2, "expected rtHeight to be size 2");
	static_assert(sizeof(GXTexture::GXSpecs::format) == 4, "expected format to be size 4");
	static_assert(sizeof(GXTexture::GXSpecs::mipmap) == 1, "expected mipmap to be size 1");
	static_assert(sizeof(GXTexture::GXSpecs::bias_clamp) == 1, "expected bias_clamp to be size 1");
	static_assert(sizeof(GXTexture::GXSpecs::do_edge_lod) == 1, "expected do_edge_lod to be size 1");
	static_assert(sizeof(GXTexture::GXSpecs::hash) == 4, "expected hash to be size 4");
	static_assert(sizeof(struct GXTexture::GXSpecs) == 20, "expected struct GXTexture::GXSpecs to be size 20");


	/// Struct member variables

	// <class EE::RefObject field_0, offset 0x0>
	// class EE::RefObject Super;

	// <uint32_t marker, offset 0x8>
	uint32_t marker;

	// <union GXSamplerStuff sampler, offset 0xc>
	union GXSamplerStuff sampler;

	// <class EE::SmartPtr<ID3D11ShaderResourceView> textureView, offset 0x10>
	class EE::SmartPtr<ID3D11ShaderResourceView> textureView;

	// <uint32_t textureViewId, offset 0x14>
	uint32_t textureViewId;

	// <struct GXTexture::GXSpecs gxSpecs, offset 0x18>
	struct GXTexture::GXSpecs gxSpecs;

	// <class EE::SmartPtr<ID3D11Texture2D> texture, offset 0x2c>
	class EE::SmartPtr<ID3D11Texture2D> texture;

	// <class EE::SmartPtr<ID3D11RenderTargetView> renderTargetView, offset 0x30>
	class EE::SmartPtr<ID3D11RenderTargetView> renderTargetView;

	// <class EE::SmartPtr<ID3D11DepthStencilView> depthStencilView, offset 0x34>
	class EE::SmartPtr<ID3D11DepthStencilView> depthStencilView;

	// <class EE::SmartPtr<ID3D11Texture2D> stagingTex, offset 0x38>
	class EE::SmartPtr<ID3D11Texture2D> stagingTex;

	// <struct D3D11_MAPPED_SUBRESOURCE stagingTexMap, offset 0x3c>
	struct D3D11_MAPPED_SUBRESOURCE stagingTexMap;

	// <struct EE::OptListNode<GXTexture *> renderTargetListNode, offset 0x48>
	struct EE::OptListNode<GXTexture *> renderTargetListNode;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<GXTexture>("GXTexture")
			.addProperty("marker", &GXTexture::marker)
			.addProperty("sampler", &GXTexture::sampler)
			.addProperty("textureView", &GXTexture::textureView)
			.addProperty("textureViewId", &GXTexture::textureViewId)
			.addProperty("gxSpecs", &GXTexture::gxSpecs)
			.addProperty("texture", &GXTexture::texture)
			.addProperty("renderTargetView", &GXTexture::renderTargetView)
			.addProperty("depthStencilView", &GXTexture::depthStencilView)
			.addProperty("stagingTex", &GXTexture::stagingTex)
			.addProperty("stagingTexMap", &GXTexture::stagingTexMap)
			.addProperty("renderTargetListNode", &GXTexture::renderTargetListNode)
		.endClass();
	}
#endif
};
static_assert(sizeof(GXTexture::marker) == 4, "expected marker to be size 4");
static_assert(sizeof(GXTexture::sampler) == 4, "expected sampler to be size 4");
static_assert(sizeof(GXTexture::textureView) == 4, "expected textureView to be size 4");
static_assert(sizeof(GXTexture::textureViewId) == 4, "expected textureViewId to be size 4");
static_assert(sizeof(GXTexture::gxSpecs) == 20, "expected gxSpecs to be size 20");
static_assert(sizeof(GXTexture::texture) == 4, "expected texture to be size 4");
static_assert(sizeof(GXTexture::renderTargetView) == 4, "expected renderTargetView to be size 4");
static_assert(sizeof(GXTexture::depthStencilView) == 4, "expected depthStencilView to be size 4");
static_assert(sizeof(GXTexture::stagingTex) == 4, "expected stagingTex to be size 4");
static_assert(sizeof(GXTexture::stagingTexMap) == 12, "expected stagingTexMap to be size 12");
static_assert(sizeof(GXTexture::renderTargetListNode) == 12, "expected renderTargetListNode to be size 12");
static_assert(sizeof(class GXTexture) == 84, "expected class GXTexture to be size 84");

// struct rAlphaAnime
// no dependencies
struct rAlphaAnime
{
public:
	/// No namespace types
	/// Struct member variables

	// <float Add, offset 0x0>
	float Add;

	// <float Target, offset 0x4>
	float Target;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rAlphaAnime>("rAlphaAnime")
			.addProperty("Add", &rAlphaAnime::Add)
			.addProperty("Target", &rAlphaAnime::Target)
		.endClass();
	}
#endif
};
static_assert(sizeof(rAlphaAnime::Add) == 4, "expected Add to be size 4");
static_assert(sizeof(rAlphaAnime::Target) == 4, "expected Target to be size 4");
static_assert(sizeof(struct rAlphaAnime) == 8, "expected struct rAlphaAnime to be size 8");

// struct rAnimeCounter
// no dependencies
struct rAnimeCounter
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint16_t Count, offset 0x0>
	uint16_t Count;

	// <uint16_t Frame, offset 0x2>
	uint16_t Frame;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rAnimeCounter>("rAnimeCounter")
			.addProperty("Count", &rAnimeCounter::Count)
			.addProperty("Frame", &rAnimeCounter::Frame)
		.endClass();
	}
#endif
};
static_assert(sizeof(rAnimeCounter::Count) == 2, "expected Count to be size 2");
static_assert(sizeof(rAnimeCounter::Frame) == 2, "expected Frame to be size 2");
static_assert(sizeof(struct rAnimeCounter) == 4, "expected struct rAnimeCounter to be size 4");

// struct rST
// no dependencies
struct rST
{
public:
	/// No namespace types
	/// Struct member variables

	// <float s, offset 0x0>
	float s;

	// <float t, offset 0x4>
	float t;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rST>("rST")
			.addProperty("s", &rST::s)
			.addProperty("t", &rST::t)
		.endClass();
	}
#endif
};
static_assert(sizeof(rST::s) == 4, "expected s to be size 4");
static_assert(sizeof(rST::t) == 4, "expected t to be size 4");
static_assert(sizeof(struct rST) == 8, "expected struct rST to be size 8");

// struct rColor
// no dependencies
struct rColor
{
public:
	/// No namespace types
	/// Struct member variables

	// <float r, offset 0x0>
	float r;

	// <float g, offset 0x4>
	float g;

	// <float b, offset 0x8>
	float b;

	// <float a, offset 0xc>
	float a;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rColor>("rColor")
			.addProperty("r", &rColor::r)
			.addProperty("g", &rColor::g)
			.addProperty("b", &rColor::b)
			.addProperty("a", &rColor::a)
		.endClass();
	}
#endif
};
static_assert(sizeof(rColor::r) == 4, "expected r to be size 4");
static_assert(sizeof(rColor::g) == 4, "expected g to be size 4");
static_assert(sizeof(rColor::b) == 4, "expected b to be size 4");
static_assert(sizeof(rColor::a) == 4, "expected a to be size 4");
static_assert(sizeof(struct rColor) == 16, "expected struct rColor to be size 16");

// class rPrimBase
// no dependencies
class rPrimBase
{
public:
	/// No namespace types
	/// Struct member variables

	// <void* (* field_0)[0x3], offset 0x0>
	void* (* field_0)[0x3];

	// <uint32_t m_BitFlag, offset 0x4>
	uint32_t m_BitFlag;

	// <rPrimBase* m_pPrev, offset 0x8>
	rPrimBase* m_pPrev;

	// <rPrimBase* m_pNext, offset 0xc>
	rPrimBase* m_pNext;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rPrimBase>("rPrimBase")
			// delegates are not supported in LuaBridge
			//.addProperty("field_0", &rPrimBase::field_0)
			.addProperty("m_BitFlag", &rPrimBase::m_BitFlag)
			.addProperty("m_pPrev", &rPrimBase::m_pPrev)
			.addProperty("m_pNext", &rPrimBase::m_pNext)
		.endClass();
	}
#endif
};
static_assert(sizeof(rPrimBase::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(rPrimBase::m_BitFlag) == 4, "expected m_BitFlag to be size 4");
static_assert(sizeof(rPrimBase::m_pPrev) == 4, "expected m_pPrev to be size 4");
static_assert(sizeof(rPrimBase::m_pNext) == 4, "expected m_pNext to be size 4");
static_assert(sizeof(class rPrimBase) == 16, "expected class rPrimBase to be size 16");

// class rTriangleList
// 6 dependencies: class rPrimBase, struct Vec, struct rColor, struct rST, struct rAnimeCounter, struct rAlphaAnime
class rTriangleList : rPrimBase
{
public:
	/// No namespace types
	/// Struct member variables

	// <class rPrimBase field_0, offset 0x0>
	// class rPrimBase Super;

	// <struct Vec m_Position, offset 0x10>
	struct Vec m_Position;

	// <struct rColor m_Color, offset 0x1c>
	struct rColor m_Color;

	// <struct rST m_ST, offset 0x2c>
	struct rST m_ST;

	// <struct rAnimeCounter m_AnimeCounter, offset 0x34>
	struct rAnimeCounter m_AnimeCounter;

	// <struct rAlphaAnime m_ColorAnime, offset 0x38>
	struct rAlphaAnime m_ColorAnime;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<rTriangleList>("rTriangleList")
			.addProperty("m_Position", &rTriangleList::m_Position)
			.addProperty("m_Color", &rTriangleList::m_Color)
			.addProperty("m_ST", &rTriangleList::m_ST)
			.addProperty("m_AnimeCounter", &rTriangleList::m_AnimeCounter)
			.addProperty("m_ColorAnime", &rTriangleList::m_ColorAnime)
		.endClass();
	}
#endif
};
static_assert(sizeof(rTriangleList::m_Position) == 12, "expected m_Position to be size 12");
static_assert(sizeof(rTriangleList::m_Color) == 16, "expected m_Color to be size 16");
static_assert(sizeof(rTriangleList::m_ST) == 8, "expected m_ST to be size 8");
static_assert(sizeof(rTriangleList::m_AnimeCounter) == 4, "expected m_AnimeCounter to be size 4");
static_assert(sizeof(rTriangleList::m_ColorAnime) == 8, "expected m_ColorAnime to be size 8");
static_assert(sizeof(class rTriangleList) == 64, "expected class rTriangleList to be size 64");

// class CVertexAnimation
// no dependencies
class CVertexAnimation
{
public:
	/// 1 namespace types: class CVertexAnimation::CVertex

	// class CVertexAnimation::CVertex
	// no dependencies
	class CVertex
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <int32_t m_nPosiIndex, offset 0x0>
		int32_t m_nPosiIndex;

		// <float m_fCenter, offset 0x4>
		float m_fCenter;

		// <int32_t m_nSinIndex, offset 0x8>
		int32_t m_nSinIndex;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<CVertexAnimation::CVertex>("CVertexAnimation::CVertex")
				.addProperty("m_nPosiIndex", &CVertexAnimation::CVertex::m_nPosiIndex)
				.addProperty("m_fCenter", &CVertexAnimation::CVertex::m_fCenter)
				.addProperty("m_nSinIndex", &CVertexAnimation::CVertex::m_nSinIndex)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(CVertexAnimation::CVertex::m_nPosiIndex) == 4, "expected m_nPosiIndex to be size 4");
	static_assert(sizeof(CVertexAnimation::CVertex::m_fCenter) == 4, "expected m_fCenter to be size 4");
	static_assert(sizeof(CVertexAnimation::CVertex::m_nSinIndex) == 4, "expected m_nSinIndex to be size 4");
	static_assert(sizeof(class CVertexAnimation::CVertex) == 12, "expected class CVertexAnimation::CVertex to be size 12");


	/// Struct member variables

	// <uint8_t* m_pbyNewMem, offset 0x0>
	uint8_t* m_pbyNewMem;

	// <uint8_t* m_abyNodePosiBuf[0x2], offset 0x4>
	uint8_t* m_abyNodePosiBuf[2];

	// <uint32_t m_nBufSize, offset 0xc>
	uint32_t m_nBufSize;

	// <class CStlVector<CVertexAnimation::CVertex> m_ainVertex, offset 0x10>
	class std::vector<CVertexAnimation::CVertex> m_ainVertex;

	// <float m_fOfstMax, offset 0x1c>
	float m_fOfstMax;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CVertexAnimation>("CVertexAnimation")
			// native pointer type (uint8_t*) not supported in LuaBridge (needs wrapper function)
			//.addProperty("m_pbyNewMem", &CVertexAnimation::m_pbyNewMem)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_abyNodePosiBuf", &CVertexAnimation::m_abyNodePosiBuf)
			.addProperty("m_nBufSize", &CVertexAnimation::m_nBufSize)
			.addProperty("m_ainVertex", &CVertexAnimation::m_ainVertex)
			.addProperty("m_fOfstMax", &CVertexAnimation::m_fOfstMax)
		.endClass();
	}
#endif
};
static_assert(sizeof(CVertexAnimation::m_pbyNewMem) == 4, "expected m_pbyNewMem to be size 4");
static_assert(sizeof(CVertexAnimation::m_abyNodePosiBuf) == 8, "expected m_abyNodePosiBuf to be size 8");
static_assert(sizeof(CVertexAnimation::m_nBufSize) == 4, "expected m_nBufSize to be size 4");
static_assert(sizeof(CVertexAnimation::m_ainVertex) == 12, "expected m_ainVertex to be size 12");
static_assert(sizeof(CVertexAnimation::m_fOfstMax) == 4, "expected m_fOfstMax to be size 4");
static_assert(sizeof(class CVertexAnimation) == 32, "expected class CVertexAnimation to be size 32");

// class TFAnmObjF32_3
// 1 dependencies: struct TFAnmObjF32_3::tagMAIN
class TFAnmObjF32_3
{
public:
	/// 1 namespace types: struct TFAnmObjF32_3::tagMAIN

	// struct TFAnmObjF32_3::tagMAIN
	// no dependencies
	struct tagMAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <Filler, offset 0x0>
		char _Filler[360];

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TFAnmObjF32_3::tagMAIN>("TFAnmObjF32_3::tagMAIN")
			.endClass();
		}
#endif
	};
	static_assert(sizeof(struct TFAnmObjF32_3::tagMAIN) == 360, "expected struct TFAnmObjF32_3::tagMAIN to be size 360");


	/// Struct member variables

	// <struct TFAnmObjF32_3::tagMAIN dat, offset 0x0>
	struct TFAnmObjF32_3::tagMAIN dat;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TFAnmObjF32_3>("TFAnmObjF32_3")
			.addProperty("dat", &TFAnmObjF32_3::dat)
		.endClass();
	}
#endif
};
static_assert(sizeof(TFAnmObjF32_3::dat) == 360, "expected dat to be size 360");
static_assert(sizeof(class TFAnmObjF32_3) == 360, "expected class TFAnmObjF32_3 to be size 360");

// union _WFAnmVal
// no dependencies
union _WFAnmVal
{
public:
	/// No namespace types
	/// Struct member variables

	// <float mFVal, offset 0x0>
	float mFVal;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<_WFAnmVal>("_WFAnmVal")
			.addProperty("mFVal", &_WFAnmVal::mFVal)
		.endClass();
	}
#endif
};
static_assert(sizeof(_WFAnmVal::mFVal) == 4, "expected mFVal to be size 4");
static_assert(sizeof(union _WFAnmVal) == 4, "expected union _WFAnmVal to be size 4");

// enum TFANMOBJDATATYPE
enum TFANMOBJDATATYPE : uint32_t
{
	// Enum values

	// <TFANMOBJDATATYPE_NONE = 0x0>
	TFANMOBJDATATYPE_NONE = 0,

	// <TFANMOBJDATATYPE_FLOAT = 0x1>
	TFANMOBJDATATYPE_FLOAT = 1,

	// <TFANMOBJDATATYPE_ROT = 0x2>
	TFANMOBJDATATYPE_ROT = 2,

	// <TFANMOBJDATATYPE_BOOL = 0x3>
	TFANMOBJDATATYPE_BOOL = 3,

	// <TFANMOBJDATATYPE_COLOR = 0x4>
	TFANMOBJDATATYPE_COLOR = 4,

	// <TFANMOBJDATATYPE_INT = 0x5>
	TFANMOBJDATATYPE_INT = 5,

	// <TFANMOBJDATATYPE_CALLBACK = 0x6>
	TFANMOBJDATATYPE_CALLBACK = 6,

	// <TFANMOBJDATATYPE_XYZ_POS = 0x7>
	TFANMOBJDATATYPE_XYZ_POS = 7,

	// <TFANMOBJDATATYPE_XYZ_ROT = 0x8>
	TFANMOBJDATATYPE_XYZ_ROT = 8

};

// class TFAnmObj
// 4 dependencies: struct TFAnmObj::tagMAIN, enum TFANMOBJDATATYPE, union _WFAnmVal, struct TFAnmObj::tagGETA
class TFAnmObj
{
public:
	/// 2 namespace types: struct TFAnmObj::tagGETA, struct TFAnmObj::tagMAIN

	// struct TFAnmObj::tagGETA
	// no dependencies
	struct tagGETA
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <float Value, offset 0x0>
		float Value;

		// <float Wait, offset 0x4>
		float Wait;

		// <float LockWait, offset 0x8>
		float LockWait;

		// <float InSlope, offset 0xc>
		float InSlope;

		// <float OutSlope, offset 0x10>
		float OutSlope;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TFAnmObj::tagGETA>("TFAnmObj::tagGETA")
				.addProperty("Value", &TFAnmObj::tagGETA::Value)
				.addProperty("Wait", &TFAnmObj::tagGETA::Wait)
				.addProperty("LockWait", &TFAnmObj::tagGETA::LockWait)
				.addProperty("InSlope", &TFAnmObj::tagGETA::InSlope)
				.addProperty("OutSlope", &TFAnmObj::tagGETA::OutSlope)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TFAnmObj::tagGETA::Value) == 4, "expected Value to be size 4");
	static_assert(sizeof(TFAnmObj::tagGETA::Wait) == 4, "expected Wait to be size 4");
	static_assert(sizeof(TFAnmObj::tagGETA::LockWait) == 4, "expected LockWait to be size 4");
	static_assert(sizeof(TFAnmObj::tagGETA::InSlope) == 4, "expected InSlope to be size 4");
	static_assert(sizeof(TFAnmObj::tagGETA::OutSlope) == 4, "expected OutSlope to be size 4");
	static_assert(sizeof(struct TFAnmObj::tagGETA) == 20, "expected struct TFAnmObj::tagGETA to be size 20");

	// struct TFAnmObj::tagMAIN
	// 3 dependencies: enum TFANMOBJDATATYPE, union _WFAnmVal, struct TFAnmObj::tagGETA
	struct tagMAIN
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <struct _WFAnmObjHeader* pAnmData, offset 0x0>
		struct _WFAnmObjHeader* pAnmData;

		// <enum TFANMOBJDATATYPE DataType, offset 0x4>
		enum TFANMOBJDATATYPE DataType;

		// <void* pData, offset 0x8>
		void* pData;

		// <void (* pCallback)(union _WFAnmVal*, void*), offset 0xc>
		void (* pCallback)(union _WFAnmVal*, void*);

		// <union _WFAnmVal NowValue, offset 0x10>
		union _WFAnmVal NowValue;

		// <uint32_t Flag, offset 0x14>
		uint32_t Flag;

		// <uint8_t NextType, offset 0x18>
		uint8_t NextType;

		// <uint8_t PrevType, offset 0x19>
		uint8_t PrevType;

		// <uint16_t KeyCount, offset 0x1a>
		uint16_t KeyCount;

		// <uint16_t KeyCountMax, offset 0x1c>
		uint16_t KeyCountMax;

		// <uint16_t KeyListCount, offset 0x1e>
		uint16_t KeyListCount;

		// <float Tick, offset 0x20>
		float Tick;

		// <float NextWait, offset 0x24>
		float NextWait;

		// <float PrevWait, offset 0x28>
		float PrevWait;

		// <void* pNextKey, offset 0x2c>
		void* pNextKey;

		// <void* pPrevKey, offset 0x30>
		void* pPrevKey;

		// <float NextValue, offset 0x34>
		float NextValue;

		// <float PrevValue, offset 0x38>
		float PrevValue;

		// <float NextSlope, offset 0x3c>
		float NextSlope;

		// <float PrevSlope, offset 0x40>
		float PrevSlope;

		// <struct TFAnmObj::tagGETA NextGeta, offset 0x44>
		struct tagGETA NextGeta;

		// <struct TFAnmObj::tagGETA PrevGeta, offset 0x58>
		struct tagGETA PrevGeta;

		// <struct _WFAnmObjKeyListHeader* pNowKeyListHeader, offset 0x6c>
		struct _WFAnmObjKeyListHeader* pNowKeyListHeader;

		// <struct TFAnmObj::tagGETA NowKeyGeta, offset 0x70>
		struct tagGETA NowKeyGeta;

		// <uint32_t NowKeyTypeSize, offset 0x84>
		uint32_t NowKeyTypeSize;

		// <void* pNowKey, offset 0x88>
		void* pNowKey;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<TFAnmObj::tagMAIN>("TFAnmObj::tagMAIN")
				.addProperty("pAnmData", &TFAnmObj::tagMAIN::pAnmData)
				.addProperty("DataType", &TFAnmObj::tagMAIN::DataType)
				// void type not supported in LuaBridge
				//.addProperty("pData", &TFAnmObj::tagMAIN::pData)
				// delegates are not supported in LuaBridge
				//.addProperty("pCallback", &TFAnmObj::tagMAIN::pCallback)
				.addProperty("NowValue", &TFAnmObj::tagMAIN::NowValue)
				.addProperty("Flag", &TFAnmObj::tagMAIN::Flag)
				.addProperty("NextType", &TFAnmObj::tagMAIN::NextType)
				.addProperty("PrevType", &TFAnmObj::tagMAIN::PrevType)
				.addProperty("KeyCount", &TFAnmObj::tagMAIN::KeyCount)
				.addProperty("KeyCountMax", &TFAnmObj::tagMAIN::KeyCountMax)
				.addProperty("KeyListCount", &TFAnmObj::tagMAIN::KeyListCount)
				.addProperty("Tick", &TFAnmObj::tagMAIN::Tick)
				.addProperty("NextWait", &TFAnmObj::tagMAIN::NextWait)
				.addProperty("PrevWait", &TFAnmObj::tagMAIN::PrevWait)
				// void type not supported in LuaBridge
				//.addProperty("pNextKey", &TFAnmObj::tagMAIN::pNextKey)
				// void type not supported in LuaBridge
				//.addProperty("pPrevKey", &TFAnmObj::tagMAIN::pPrevKey)
				.addProperty("NextValue", &TFAnmObj::tagMAIN::NextValue)
				.addProperty("PrevValue", &TFAnmObj::tagMAIN::PrevValue)
				.addProperty("NextSlope", &TFAnmObj::tagMAIN::NextSlope)
				.addProperty("PrevSlope", &TFAnmObj::tagMAIN::PrevSlope)
				.addProperty("NextGeta", &TFAnmObj::tagMAIN::NextGeta)
				.addProperty("PrevGeta", &TFAnmObj::tagMAIN::PrevGeta)
				.addProperty("pNowKeyListHeader", &TFAnmObj::tagMAIN::pNowKeyListHeader)
				.addProperty("NowKeyGeta", &TFAnmObj::tagMAIN::NowKeyGeta)
				.addProperty("NowKeyTypeSize", &TFAnmObj::tagMAIN::NowKeyTypeSize)
				// void type not supported in LuaBridge
				//.addProperty("pNowKey", &TFAnmObj::tagMAIN::pNowKey)
			.endClass();
		}
#endif
	};
	static_assert(sizeof(TFAnmObj::tagMAIN::pAnmData) == 4, "expected pAnmData to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::DataType) == 4, "expected DataType to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::pData) == 4, "expected pData to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::pCallback) == 4, "expected pCallback to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NowValue) == 4, "expected NowValue to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::Flag) == 4, "expected Flag to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NextType) == 1, "expected NextType to be size 1");
	static_assert(sizeof(TFAnmObj::tagMAIN::PrevType) == 1, "expected PrevType to be size 1");
	static_assert(sizeof(TFAnmObj::tagMAIN::KeyCount) == 2, "expected KeyCount to be size 2");
	static_assert(sizeof(TFAnmObj::tagMAIN::KeyCountMax) == 2, "expected KeyCountMax to be size 2");
	static_assert(sizeof(TFAnmObj::tagMAIN::KeyListCount) == 2, "expected KeyListCount to be size 2");
	static_assert(sizeof(TFAnmObj::tagMAIN::Tick) == 4, "expected Tick to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NextWait) == 4, "expected NextWait to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::PrevWait) == 4, "expected PrevWait to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::pNextKey) == 4, "expected pNextKey to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::pPrevKey) == 4, "expected pPrevKey to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NextValue) == 4, "expected NextValue to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::PrevValue) == 4, "expected PrevValue to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NextSlope) == 4, "expected NextSlope to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::PrevSlope) == 4, "expected PrevSlope to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NextGeta) == 20, "expected NextGeta to be size 20");
	static_assert(sizeof(TFAnmObj::tagMAIN::PrevGeta) == 20, "expected PrevGeta to be size 20");
	static_assert(sizeof(TFAnmObj::tagMAIN::pNowKeyListHeader) == 4, "expected pNowKeyListHeader to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::NowKeyGeta) == 20, "expected NowKeyGeta to be size 20");
	static_assert(sizeof(TFAnmObj::tagMAIN::NowKeyTypeSize) == 4, "expected NowKeyTypeSize to be size 4");
	static_assert(sizeof(TFAnmObj::tagMAIN::pNowKey) == 4, "expected pNowKey to be size 4");
	static_assert(sizeof(struct TFAnmObj::tagMAIN) == 140, "expected struct TFAnmObj::tagMAIN to be size 140");


	/// Struct member variables

	// <struct TFAnmObj::tagMAIN dat, offset 0x0>
	struct TFAnmObj::tagMAIN dat;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<TFAnmObj>("TFAnmObj")
			.addProperty("dat", &TFAnmObj::dat)
		.endClass();
	}
#endif
};
static_assert(sizeof(TFAnmObj::dat) == 140, "expected dat to be size 140");
static_assert(sizeof(class TFAnmObj) == 140, "expected class TFAnmObj to be size 140");

// class mot::IBoneEffectPJ
// no dependencies
namespace mot
{
	class IBoneEffectPJ
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <void* (* field_0)[0x17], offset 0x0>
		void* (* field_0)[0x17];

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<mot::IBoneEffectPJ>("mot::IBoneEffectPJ")
				// delegates are not supported in LuaBridge
				//.addProperty("field_0", &mot::IBoneEffectPJ::field_0)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(mot::IBoneEffectPJ::field_0) == 4, "expected field_0 to be size 4");
static_assert(sizeof(class mot::IBoneEffectPJ) == 4, "expected class mot::IBoneEffectPJ to be size 4");

// enum ECameraVibAnimeType
enum ECameraVibAnimeType : uint32_t
{
	// Enum values

	// <CAMERA_VIB_ANIME_TYPE_DAMAGE_HIT = 0x0>
	CAMERA_VIB_ANIME_TYPE_DAMAGE_HIT = 0,

	// <CAMERA_VIB_ANIME_TYPE_DAMAGE_FALL = 0x1>
	CAMERA_VIB_ANIME_TYPE_DAMAGE_FALL = 1,

	// <CAMERA_VIB_ANIME_TYPE_QUAKE = 0x2>
	CAMERA_VIB_ANIME_TYPE_QUAKE = 2,

	// <CAMERA_VIB_ANIME_TYPE_ATTACK = 0x3>
	CAMERA_VIB_ANIME_TYPE_ATTACK = 3,

	// <CAMERA_VIB_ANIME_TYPE_ATTACK_SIDE = 0x4>
	CAMERA_VIB_ANIME_TYPE_ATTACK_SIDE = 4,

	// <CAMERA_VIB_ANIME_TYPE_EXPLOSION = 0x5>
	CAMERA_VIB_ANIME_TYPE_EXPLOSION = 5,

	// <CAMERA_VIB_ANIME_TYPE_EXPLOSION_LONG = 0x6>
	CAMERA_VIB_ANIME_TYPE_EXPLOSION_LONG = 6,

	// <CAMERA_VIB_ANIME_TYPE_SHOCK = 0x7>
	CAMERA_VIB_ANIME_TYPE_SHOCK = 7,

	// <CAMERA_VIB_ANIME_TYPE_SHOCK_SIDE = 0x8>
	CAMERA_VIB_ANIME_TYPE_SHOCK_SIDE = 8,

	// <CAMERA_VIB_ANIME_TYPE_FILM_NOISE = 0x9>
	CAMERA_VIB_ANIME_TYPE_FILM_NOISE = 9,

	// <CAMERA_VIB_ANIME_TYPE_FILM_NOISE2 = 0xa>
	CAMERA_VIB_ANIME_TYPE_FILM_NOISE2 = 10,

	// <CAMERA_VIB_ANIME_TYPE_WIND_PRESS_SIDE = 0xb>
	CAMERA_VIB_ANIME_TYPE_WIND_PRESS_SIDE = 11,

	// <CAMERA_VIB_ANIME_TYPE_CRASH = 0xc>
	CAMERA_VIB_ANIME_TYPE_CRASH = 12,

	// <CAMERA_VIB_ANIME_TYPE_TURN_BANK = 0xd>
	CAMERA_VIB_ANIME_TYPE_TURN_BANK = 13,

	// <TOTAL_CAMERA_VIB_ANIME_TYPE = 0xe>
	TOTAL_CAMERA_VIB_ANIME_TYPE = 14

};

// class CCameraVibTiming
// 1 dependencies: enum ECameraVibAnimeType
class CCameraVibTiming
{
public:
	/// 1 namespace types: class CCameraVibTiming* CCameraVibTiming::getTable(int32_t* arg1, class mHRChara& arg2)

	// TODO: Function 'class CCameraVibTiming* CCameraVibTiming::getTable(int32_t* arg1, class mHRChara& arg2)'

	/// Struct member variables

	// <char const* m_sMotName, offset 0x0>
	char const* m_sMotName;

	// <float m_fMotFrame, offset 0x4>
	float m_fMotFrame;

	// <enum ECameraVibAnimeType m_eAnimeType, offset 0x8>
	enum ECameraVibAnimeType m_eAnimeType;

	// <float m_fAnimeScale, offset 0xc>
	float m_fAnimeScale;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CCameraVibTiming>("CCameraVibTiming")
			.addProperty("m_sMotName", &CCameraVibTiming::m_sMotName)
			.addProperty("m_fMotFrame", &CCameraVibTiming::m_fMotFrame)
			.addProperty("m_eAnimeType", &CCameraVibTiming::m_eAnimeType)
			.addProperty("m_fAnimeScale", &CCameraVibTiming::m_fAnimeScale)
		.endClass();
	}
#endif
};
static_assert(sizeof(CCameraVibTiming::m_sMotName) == 4, "expected m_sMotName to be size 4");
static_assert(sizeof(CCameraVibTiming::m_fMotFrame) == 4, "expected m_fMotFrame to be size 4");
static_assert(sizeof(CCameraVibTiming::m_eAnimeType) == 4, "expected m_eAnimeType to be size 4");
static_assert(sizeof(CCameraVibTiming::m_fAnimeScale) == 4, "expected m_fAnimeScale to be size 4");
static_assert(sizeof(class CCameraVibTiming) == 16, "expected class CCameraVibTiming to be size 16");

// enum eENVOICE
enum eENVOICE : uint32_t
{
	// Enum values

	// <eENVOICE_A = 0x0>
	eENVOICE_A = 0,

	// <eENVOICE_B = 0x5>
	eENVOICE_B = 5,

	// <eENVOICE_C = 0xa>
	eENVOICE_C = 10,

	// <eENVOICE_D = 0xf>
	eENVOICE_D = 15

};

// struct HRCHARAVOICE
// 1 dependencies: enum eENVOICE
struct HRCHARAVOICE
{
public:
	/// No namespace types
	/// Struct member variables

	// <char const* pFileName, offset 0x0>
	char const* pFileName;

	// <enum eENVOICE Voice, offset 0x4>
	enum eENVOICE Voice;

	// <uint32_t FileNameLength, offset 0x8>
	uint32_t FileNameLength;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HRCHARAVOICE>("HRCHARAVOICE")
			.addProperty("pFileName", &HRCHARAVOICE::pFileName)
			.addProperty("Voice", &HRCHARAVOICE::Voice)
			.addProperty("FileNameLength", &HRCHARAVOICE::FileNameLength)
		.endClass();
	}
#endif
};
static_assert(sizeof(HRCHARAVOICE::pFileName) == 4, "expected pFileName to be size 4");
static_assert(sizeof(HRCHARAVOICE::Voice) == 4, "expected Voice to be size 4");
static_assert(sizeof(HRCHARAVOICE::FileNameLength) == 4, "expected FileNameLength to be size 4");
static_assert(sizeof(struct HRCHARAVOICE) == 12, "expected struct HRCHARAVOICE to be size 12");

// class gameUtil::CPlane
// 4 dependencies: class tiVector, class vector4x, class vector4f, union __m128
namespace gameUtil
{
	class CPlane
	{
	public:
		/// No namespace types
		/// Struct member variables

		// <class tiVector m_inABCD, offset 0x0>
		class tiVector m_inABCD;

#ifdef WITH_LUA
		static void BindLua(luabridge::Namespace& NS)
		{
			NS = NS.beginClass<gameUtil::CPlane>("gameUtil::CPlane")
				.addProperty("m_inABCD", &gameUtil::CPlane::m_inABCD)
			.endClass();
		}
#endif
	};
}
static_assert(sizeof(gameUtil::CPlane::m_inABCD) == 16, "expected m_inABCD to be size 16");
static_assert(sizeof(class gameUtil::CPlane) == 16, "expected class gameUtil::CPlane to be size 16");

// class CStickShadow
// 5 dependencies: class gameUtil::CPlane, class tiVector, class vector4x, class vector4f, union __m128
class CStickShadow
{
public:
	/// No namespace types
	/// Struct member variables

	// <class gameUtil::CPlane m_inProjPlane, offset 0x0>
	class gameUtil::CPlane m_inProjPlane;

	// <int32_t m_nBoneID, offset 0x10>
	int32_t m_nBoneID;

	// <float m_fWidthHalf, offset 0x14>
	float m_fWidthHalf;

	// <float m_fDepthPlus, offset 0x18>
	float m_fDepthPlus;

	// <float m_fDepthMinus, offset 0x1c>
	float m_fDepthMinus;

	// <float m_fAlphaMaxDist, offset 0x20>
	float m_fAlphaMaxDist;

	// <float m_fAlphaMinDist, offset 0x24>
	float m_fAlphaMinDist;

	// <Filler, offset 0x28>
	char _Filler[8];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CStickShadow>("CStickShadow")
			.addProperty("m_inProjPlane", &CStickShadow::m_inProjPlane)
			.addProperty("m_nBoneID", &CStickShadow::m_nBoneID)
			.addProperty("m_fWidthHalf", &CStickShadow::m_fWidthHalf)
			.addProperty("m_fDepthPlus", &CStickShadow::m_fDepthPlus)
			.addProperty("m_fDepthMinus", &CStickShadow::m_fDepthMinus)
			.addProperty("m_fAlphaMaxDist", &CStickShadow::m_fAlphaMaxDist)
			.addProperty("m_fAlphaMinDist", &CStickShadow::m_fAlphaMinDist)
		.endClass();
	}
#endif
};
static_assert(sizeof(CStickShadow::m_inProjPlane) == 16, "expected m_inProjPlane to be size 16");
static_assert(sizeof(CStickShadow::m_nBoneID) == 4, "expected m_nBoneID to be size 4");
static_assert(sizeof(CStickShadow::m_fWidthHalf) == 4, "expected m_fWidthHalf to be size 4");
static_assert(sizeof(CStickShadow::m_fDepthPlus) == 4, "expected m_fDepthPlus to be size 4");
static_assert(sizeof(CStickShadow::m_fDepthMinus) == 4, "expected m_fDepthMinus to be size 4");
static_assert(sizeof(CStickShadow::m_fAlphaMaxDist) == 4, "expected m_fAlphaMaxDist to be size 4");
static_assert(sizeof(CStickShadow::m_fAlphaMinDist) == 4, "expected m_fAlphaMinDist to be size 4");
static_assert(sizeof(class CStickShadow) == 48, "expected class CStickShadow to be size 48");

// struct CharControlMotID
// no dependencies
struct CharControlMotID
{
public:
	/// No namespace types
	/// Struct member variables

	// <int32_t WalkNeutral, offset 0x0>
	int32_t WalkNeutral;

	// <int32_t WalkFront, offset 0x4>
	int32_t WalkFront;

	// <int32_t WalkBack, offset 0x8>
	int32_t WalkBack;

	// <int32_t WalkSideLeft, offset 0xc>
	int32_t WalkSideLeft;

	// <int32_t WalkSideRight, offset 0x10>
	int32_t WalkSideRight;

	// <int32_t Run, offset 0x14>
	int32_t Run;

	// <int32_t EvacuateBack, offset 0x18>
	int32_t EvacuateBack;

	// <int32_t EvacuateLeft, offset 0x1c>
	int32_t EvacuateLeft;

	// <int32_t EvacuateRight, offset 0x20>
	int32_t EvacuateRight;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CharControlMotID>("CharControlMotID")
			.addProperty("WalkNeutral", &CharControlMotID::WalkNeutral)
			.addProperty("WalkFront", &CharControlMotID::WalkFront)
			.addProperty("WalkBack", &CharControlMotID::WalkBack)
			.addProperty("WalkSideLeft", &CharControlMotID::WalkSideLeft)
			.addProperty("WalkSideRight", &CharControlMotID::WalkSideRight)
			.addProperty("Run", &CharControlMotID::Run)
			.addProperty("EvacuateBack", &CharControlMotID::EvacuateBack)
			.addProperty("EvacuateLeft", &CharControlMotID::EvacuateLeft)
			.addProperty("EvacuateRight", &CharControlMotID::EvacuateRight)
		.endClass();
	}
#endif
};
static_assert(sizeof(CharControlMotID::WalkNeutral) == 4, "expected WalkNeutral to be size 4");
static_assert(sizeof(CharControlMotID::WalkFront) == 4, "expected WalkFront to be size 4");
static_assert(sizeof(CharControlMotID::WalkBack) == 4, "expected WalkBack to be size 4");
static_assert(sizeof(CharControlMotID::WalkSideLeft) == 4, "expected WalkSideLeft to be size 4");
static_assert(sizeof(CharControlMotID::WalkSideRight) == 4, "expected WalkSideRight to be size 4");
static_assert(sizeof(CharControlMotID::Run) == 4, "expected Run to be size 4");
static_assert(sizeof(CharControlMotID::EvacuateBack) == 4, "expected EvacuateBack to be size 4");
static_assert(sizeof(CharControlMotID::EvacuateLeft) == 4, "expected EvacuateLeft to be size 4");
static_assert(sizeof(CharControlMotID::EvacuateRight) == 4, "expected EvacuateRight to be size 4");
static_assert(sizeof(struct CharControlMotID) == 36, "expected struct CharControlMotID to be size 36");

// class CharController
// 3 dependencies: struct CharControlMotID, struct Vec, enum CharController::eChrCntrlMoveMode
class CharController
{
public:
	/// 2 namespace types: enum CharController::eChrCntrlMoveMode, void __convention("thiscall") CharController::CharController(class CharController* const this, class mHRChara* arg2)

	// enum CharController::eChrCntrlMoveMode
	enum eChrCntrlMoveMode : uint32_t
	{
		// Enum values

		// <eChrCntrlMoveMode_WalkSideLeft = 0x0>
		eChrCntrlMoveMode_WalkSideLeft = 0,

		// <eChrCntrlMoveMode_WalkSideRight = 0x1>
		eChrCntrlMoveMode_WalkSideRight = 1,

		// <eChrCntrlMoveMode_WalkForward = 0x2>
		eChrCntrlMoveMode_WalkForward = 2,

		// <eChrCntrlMoveMode_WalkBack = 0x3>
		eChrCntrlMoveMode_WalkBack = 3,

		// <eChrCntrlMoveMode_RunForward = 0x4>
		eChrCntrlMoveMode_RunForward = 4,

		// <eChrCntrlMoveMode_Idle = 0x5>
		eChrCntrlMoveMode_Idle = 5,

		// <eChrCntrlMoveMode_NumMax = 0x6>
		eChrCntrlMoveMode_NumMax = 6

	};

	// TODO: Function 'void __convention("thiscall") CharController::CharController(class CharController* const this, class mHRChara* arg2)'

	/// Struct member variables

	// <uint8_t m_boNowUnderControl, offset 0x0>
	uint8_t m_boNowUnderControl;

	// <uint8_t m_boEnableControl, offset 0x1>
	uint8_t m_boEnableControl;

	// <Filler, offset 0x2>
	char _Filler2[2];

	// <class mHRChara* m_pOwnerChar, offset 0x4>
	class mHRChara* m_pOwnerChar;

	// <struct CharControlMotID m_RegMotID, offset 0x8>
	struct CharControlMotID m_RegMotID;

	// <uint8_t m_boRegistMove, offset 0x2c>
	uint8_t m_boRegistMove;

	// <uint8_t m_boRegistAttack, offset 0x2d>
	uint8_t m_boRegistAttack;

	// <uint8_t m_boLockon, offset 0x2e>
	uint8_t m_boLockon;

	// <Filler, offset 0x2f>
	char _Filler7[1];

	// <struct Vec m_PcDirection, offset 0x30>
	struct Vec m_PcDirection;

	// <struct Vec m_MoveVec, offset 0x3c>
	struct Vec m_MoveVec;

	// <struct Vec m_VecStickL, offset 0x48>
	struct Vec m_VecStickL;

	// <float m_fStickInpRatio, offset 0x54>
	float m_fStickInpRatio;

	// <enum CharController::eChrCntrlMoveMode m_MoveMode, offset 0x58>
	enum CharController::eChrCntrlMoveMode m_MoveMode;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CharController>("CharController")
			.addProperty("m_boNowUnderControl", &CharController::m_boNowUnderControl)
			.addProperty("m_boEnableControl", &CharController::m_boEnableControl)
			.addProperty("m_pOwnerChar", &CharController::m_pOwnerChar)
			.addProperty("m_RegMotID", &CharController::m_RegMotID)
			.addProperty("m_boRegistMove", &CharController::m_boRegistMove)
			.addProperty("m_boRegistAttack", &CharController::m_boRegistAttack)
			.addProperty("m_boLockon", &CharController::m_boLockon)
			.addProperty("m_PcDirection", &CharController::m_PcDirection)
			.addProperty("m_MoveVec", &CharController::m_MoveVec)
			.addProperty("m_VecStickL", &CharController::m_VecStickL)
			.addProperty("m_fStickInpRatio", &CharController::m_fStickInpRatio)
			.addProperty("m_MoveMode", &CharController::m_MoveMode)
		.endClass();
	}
#endif
};
static_assert(sizeof(CharController::m_boNowUnderControl) == 1, "expected m_boNowUnderControl to be size 1");
static_assert(sizeof(CharController::m_boEnableControl) == 1, "expected m_boEnableControl to be size 1");
static_assert(sizeof(CharController::m_pOwnerChar) == 4, "expected m_pOwnerChar to be size 4");
static_assert(sizeof(CharController::m_RegMotID) == 36, "expected m_RegMotID to be size 36");
static_assert(sizeof(CharController::m_boRegistMove) == 1, "expected m_boRegistMove to be size 1");
static_assert(sizeof(CharController::m_boRegistAttack) == 1, "expected m_boRegistAttack to be size 1");
static_assert(sizeof(CharController::m_boLockon) == 1, "expected m_boLockon to be size 1");
static_assert(sizeof(CharController::m_PcDirection) == 12, "expected m_PcDirection to be size 12");
static_assert(sizeof(CharController::m_MoveVec) == 12, "expected m_MoveVec to be size 12");
static_assert(sizeof(CharController::m_VecStickL) == 12, "expected m_VecStickL to be size 12");
static_assert(sizeof(CharController::m_fStickInpRatio) == 4, "expected m_fStickInpRatio to be size 4");
static_assert(sizeof(CharController::m_MoveMode) == 4, "expected m_MoveMode to be size 4");
static_assert(sizeof(class CharController) == 92, "expected class CharController to be size 92");

// class CTimeRatioInterpolate
// no dependencies
class CTimeRatioInterpolate
{
public:
	/// No namespace types
	/// Struct member variables

	// <float m_fOneRatioTime, offset 0x0>
	float m_fOneRatioTime;

	// <float m_fRatio, offset 0x4>
	float m_fRatio;

	// <float m_fTimer, offset 0x8>
	float m_fTimer;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<CTimeRatioInterpolate>("CTimeRatioInterpolate")
			.addProperty("m_fOneRatioTime", &CTimeRatioInterpolate::m_fOneRatioTime)
			.addProperty("m_fRatio", &CTimeRatioInterpolate::m_fRatio)
			.addProperty("m_fTimer", &CTimeRatioInterpolate::m_fTimer)
		.endClass();
	}
#endif
};
static_assert(sizeof(CTimeRatioInterpolate::m_fOneRatioTime) == 4, "expected m_fOneRatioTime to be size 4");
static_assert(sizeof(CTimeRatioInterpolate::m_fRatio) == 4, "expected m_fRatio to be size 4");
static_assert(sizeof(CTimeRatioInterpolate::m_fTimer) == 4, "expected m_fTimer to be size 4");
static_assert(sizeof(class CTimeRatioInterpolate) == 12, "expected class CTimeRatioInterpolate to be size 12");

// enum enWepChangeProc
enum enWepChangeProc : uint32_t
{
	// Enum values

	// <eWepChangeInit = 0x0>
	eWepChangeInit = 0,

	// <eWepChangeWait = 0x1>
	eWepChangeWait = 1,

	// <eWepChangeMax = 0x2>
	eWepChangeMax = 2

};

// union uniSMflag
// no dependencies
union uniSMflag
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint16_t smBaceActivSubMission, offset 0x0>
	uint16_t smBaceActivSubMission;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<uniSMflag>("uniSMflag")
			.addProperty("smBaceActivSubMission", &uniSMflag::smBaceActivSubMission)
		.endClass();
	}
#endif
};
static_assert(sizeof(uniSMflag::smBaceActivSubMission) == 2, "expected smBaceActivSubMission to be size 2");
static_assert(sizeof(union uniSMflag) == 2, "expected union uniSMflag to be size 2");

// enum enScreenChangeKind
enum enScreenChangeKind : uint32_t
{
	// Enum values

	// <eScreenChangeStencil = 0x0>
	eScreenChangeStencil = 0,

	// <eScreenChangeFade = 0x1>
	eScreenChangeFade = 1,

	// <eScreenChangeMax = 0x2>
	eScreenChangeMax = 2

};

// struct stFade
// 1 dependencies: enum enScreenChangeKind
struct stFade
{
public:
	/// No namespace types
	/// Struct member variables

	// <enum enScreenChangeKind kind, offset 0x0>
	enum enScreenChangeKind kind;

	// <uint8_t requestStart, offset 0x4>
	uint8_t requestStart;

	// <uint8_t requestEnd, offset 0x5>
	uint8_t requestEnd;

	// <Filler, offset 0x6>
	char _Filler3[2];

	// <class HrOverLap* pOverLap, offset 0x8>
	class HrOverLap* pOverLap;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stFade>("stFade")
			.addProperty("kind", &stFade::kind)
			.addProperty("requestStart", &stFade::requestStart)
			.addProperty("requestEnd", &stFade::requestEnd)
			.addProperty("pOverLap", &stFade::pOverLap)
		.endClass();
	}
#endif
};
static_assert(sizeof(stFade::kind) == 4, "expected kind to be size 4");
static_assert(sizeof(stFade::requestStart) == 1, "expected requestStart to be size 1");
static_assert(sizeof(stFade::requestEnd) == 1, "expected requestEnd to be size 1");
static_assert(sizeof(stFade::pOverLap) == 4, "expected pOverLap to be size 4");
static_assert(sizeof(struct stFade) == 12, "expected struct stFade to be size 12");

// class HROBJDummy
// 26 dependencies: class mHRChara, class ghmListObj, struct stCharaStatus, enum enCharaType, struct Vec, struct Quaternion, struct stVec, class WAnimF, class WAnim, enum enCharaCondition, class ghmGcCollObjHitResultObj, class ghmPlane, class ghmTriangle, struct stDamageInfo, class ghmGcCollObjCapsule, class ghmGcCollObj, class ghmGcOctTreeNodeObj, enum ghmGcCollObj::Type, class ghmCapsule, class ghmSegment, class stCharaFileData, struct stCharaEffect, class CAmbientShadow, class CDoubleSpringInterpolate, class CSpringInterpolate, enum enCharaInitProc
class HROBJDummy : mHRChara
{
public:
	/// No namespace types
	/// Struct member variables

	// <class mHRChara field_0, offset 0x0>
	// class mHRChara Super;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<HROBJDummy>("HROBJDummy")
		.endClass();
	}
#endif
};
static_assert(sizeof(class HROBJDummy) == 1408, "expected class HROBJDummy to be size 1408");

// struct stTiger
// 1 dependencies: struct Vec
struct stTiger
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint8_t visible, offset 0x0>
	uint8_t visible;

	// <Filler, offset 0x1>
	char _Filler1[3];

	// <class TGmf* pGmf, offset 0x4>
	class TGmf* pGmf;

	// <class TGan* pGan[0x8], offset 0x8>
	class TGan* pGan[8];

	// <int32_t motNo, offset 0x28>
	int32_t motNo;

	// <char const* motName, offset 0x2c>
	char const* motName;

	// <uint8_t dispPc, offset 0x30>
	uint8_t dispPc;

	// <uint8_t dispTiger, offset 0x31>
	uint8_t dispTiger;

	// <Filler, offset 0x32>
	char _Filler7[2];

	// <struct Vec startPos, offset 0x34>
	struct Vec startPos;

	// <class CStlVector<CStickShadow> m_ainFootShadow, offset 0x40>
	class std::vector<CStickShadow> m_ainFootShadow;

	// <int32_t endFadeTick, offset 0x4c>
	int32_t endFadeTick;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stTiger>("stTiger")
			.addProperty("visible", &stTiger::visible)
			.addProperty("pGmf", &stTiger::pGmf)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("pGan", &stTiger::pGan)
			.addProperty("motNo", &stTiger::motNo)
			.addProperty("motName", &stTiger::motName)
			.addProperty("dispPc", &stTiger::dispPc)
			.addProperty("dispTiger", &stTiger::dispTiger)
			.addProperty("startPos", &stTiger::startPos)
			.addProperty("m_ainFootShadow", &stTiger::m_ainFootShadow)
			.addProperty("endFadeTick", &stTiger::endFadeTick)
		.endClass();
	}
#endif
};
static_assert(sizeof(stTiger::visible) == 1, "expected visible to be size 1");
static_assert(sizeof(stTiger::pGmf) == 4, "expected pGmf to be size 4");
static_assert(sizeof(stTiger::pGan) == 32, "expected pGan to be size 32");
static_assert(sizeof(stTiger::motNo) == 4, "expected motNo to be size 4");
static_assert(sizeof(stTiger::motName) == 4, "expected motName to be size 4");
static_assert(sizeof(stTiger::dispPc) == 1, "expected dispPc to be size 1");
static_assert(sizeof(stTiger::dispTiger) == 1, "expected dispTiger to be size 1");
static_assert(sizeof(stTiger::startPos) == 12, "expected startPos to be size 12");
static_assert(sizeof(stTiger::m_ainFootShadow) == 12, "expected m_ainFootShadow to be size 12");
static_assert(sizeof(stTiger::endFadeTick) == 4, "expected endFadeTick to be size 4");
static_assert(sizeof(struct stTiger) == 80, "expected struct stTiger to be size 80");

// struct stHugWalk
// no dependencies
struct stHugWalk
{
public:
	/// No namespace types
	/// Struct member variables

	// <class TGmf* pGmf, offset 0x0>
	class TGmf* pGmf;

	// <class TGan* pGan[0x6], offset 0x4>
	class TGan* pGan[6];

	// <int32_t motNo, offset 0x1c>
	int32_t motNo;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stHugWalk>("stHugWalk")
			.addProperty("pGmf", &stHugWalk::pGmf)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("pGan", &stHugWalk::pGan)
			.addProperty("motNo", &stHugWalk::motNo)
		.endClass();
	}
#endif
};
static_assert(sizeof(stHugWalk::pGmf) == 4, "expected pGmf to be size 4");
static_assert(sizeof(stHugWalk::pGan) == 24, "expected pGan to be size 24");
static_assert(sizeof(stHugWalk::motNo) == 4, "expected motNo to be size 4");
static_assert(sizeof(struct stHugWalk) == 32, "expected struct stHugWalk to be size 32");

// struct stPcEffect
// no dependencies
struct stPcEffect
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[656];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stPcEffect>("stPcEffect")
		.endClass();
	}
#endif
};
static_assert(sizeof(struct stPcEffect) == 656, "expected struct stPcEffect to be size 656");

// enum enPcInputMode
enum enPcInputMode : uint32_t
{
	// Enum values

	// <ePcInputIdle = 0x0>
	ePcInputIdle = 0,

	// <ePcInputCamera = 0x1>
	ePcInputCamera = 1,

	// <ePcInputMove = 0x2>
	ePcInputMove = 2,

	// <ePcInputBattleMove = 0x3>
	ePcInputBattleMove = 3,

	// <ePcInputBattleIdle = 0x4>
	ePcInputBattleIdle = 4,

	// <ePcInputBike = 0x5>
	ePcInputBike = 5,

	// <ePcInputMenu = 0x6>
	ePcInputMenu = 6,

	// <ePcInputDamage = 0x7>
	ePcInputDamage = 7,

	// <ePcInputTiger = 0x8>
	ePcInputTiger = 8,

	// <ePcInputJump = 0x9>
	ePcInputJump = 9,

	// <ePcInputDash = 0xa>
	ePcInputDash = 10,

	// <ePcInputDigHole = 0xb>
	ePcInputDigHole = 11,

	// <ePcInputWepChange = 0xc>
	ePcInputWepChange = 12,

	// <ePcInputDeadFukki = 0xd>
	ePcInputDeadFukki = 13,

	// <ePcInputMax = 0xe>
	ePcInputMax = 14

};

// enum enSeReadProc
enum enSeReadProc : uint32_t
{
	// Enum values

	// <eSeRead = 0x0>
	eSeRead = 0,

	// <eSeReadWait = 0x1>
	eSeReadWait = 1,

	// <eSeReadMax = 0x2>
	eSeReadMax = 2

};

// struct stPcSndData
// 3 dependencies: enum enSeReadProc, class WAnimF, class WAnim
struct stPcSndData
{
public:
	/// No namespace types
	/// Struct member variables

	// <int32_t seHdlLightsavorReady, offset 0x0>
	int32_t seHdlLightsavorReady;

	// <float seVolLightsavorReady, offset 0x4>
	float seVolLightsavorReady;

	// <uint8_t seDontPlaySeAgainLSReady, offset 0x8>
	uint8_t seDontPlaySeAgainLSReady;

	// <Filler, offset 0x9>
	char _Filler3[3];

	// <int32_t seHdlSlow, offset 0xc>
	int32_t seHdlSlow;

	// <float oldBgmVol, offset 0x10>
	float oldBgmVol;

	// <int32_t oldBgmHdl, offset 0x14>
	int32_t oldBgmHdl;

	// <int32_t oldBgmNo, offset 0x18>
	int32_t oldBgmNo;

	// <int32_t nowBgmHdl, offset 0x1c>
	int32_t nowBgmHdl;

	// <enum enSeReadProc seReadProc, offset 0x20>
	enum enSeReadProc seReadProc;

	// <class WAnimF pitchBgm, offset 0x24>
	class WAnimF pitchBgm;

	// <uint32_t oldFinishBgmVol, offset 0x44>
	uint32_t oldFinishBgmVol;

	// <uint32_t oldFinishSeVol, offset 0x48>
	uint32_t oldFinishSeVol;

	// <int32_t seHdlCharge, offset 0x4c>
	int32_t seHdlCharge;

	// <class WAnimF pitchCharge, offset 0x50>
	class WAnimF pitchCharge;

	// <int32_t seHdlChargeMax, offset 0x70>
	int32_t seHdlChargeMax;

	// <class WAnimF pitchChargeMax, offset 0x74>
	class WAnimF pitchChargeMax;

	// <int32_t seHdlAlarm, offset 0x94>
	int32_t seHdlAlarm;

	// <int32_t seHdlTel, offset 0x98>
	int32_t seHdlTel;

	// <int32_t seHdlDsBreath, offset 0x9c>
	int32_t seHdlDsBreath;

	// <int32_t seHdlTsubazeri, offset 0xa0>
	int32_t seHdlTsubazeri;

	// <int32_t seHdlSNBElecDmg, offset 0xa4>
	int32_t seHdlSNBElecDmg;

	// <int32_t seHdlPoison, offset 0xa8>
	int32_t seHdlPoison;

	// <uint8_t playBackAttackSe, offset 0xac>
	uint8_t playBackAttackSe;

	// <uint8_t playBackAttackPullSe, offset 0xad>
	uint8_t playBackAttackPullSe;

	// <Filler, offset 0xae>
	char _Filler[2];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stPcSndData>("stPcSndData")
			.addProperty("seHdlLightsavorReady", &stPcSndData::seHdlLightsavorReady)
			.addProperty("seVolLightsavorReady", &stPcSndData::seVolLightsavorReady)
			.addProperty("seDontPlaySeAgainLSReady", &stPcSndData::seDontPlaySeAgainLSReady)
			.addProperty("seHdlSlow", &stPcSndData::seHdlSlow)
			.addProperty("oldBgmVol", &stPcSndData::oldBgmVol)
			.addProperty("oldBgmHdl", &stPcSndData::oldBgmHdl)
			.addProperty("oldBgmNo", &stPcSndData::oldBgmNo)
			.addProperty("nowBgmHdl", &stPcSndData::nowBgmHdl)
			.addProperty("seReadProc", &stPcSndData::seReadProc)
			.addProperty("pitchBgm", &stPcSndData::pitchBgm)
			.addProperty("oldFinishBgmVol", &stPcSndData::oldFinishBgmVol)
			.addProperty("oldFinishSeVol", &stPcSndData::oldFinishSeVol)
			.addProperty("seHdlCharge", &stPcSndData::seHdlCharge)
			.addProperty("pitchCharge", &stPcSndData::pitchCharge)
			.addProperty("seHdlChargeMax", &stPcSndData::seHdlChargeMax)
			.addProperty("pitchChargeMax", &stPcSndData::pitchChargeMax)
			.addProperty("seHdlAlarm", &stPcSndData::seHdlAlarm)
			.addProperty("seHdlTel", &stPcSndData::seHdlTel)
			.addProperty("seHdlDsBreath", &stPcSndData::seHdlDsBreath)
			.addProperty("seHdlTsubazeri", &stPcSndData::seHdlTsubazeri)
			.addProperty("seHdlSNBElecDmg", &stPcSndData::seHdlSNBElecDmg)
			.addProperty("seHdlPoison", &stPcSndData::seHdlPoison)
			.addProperty("playBackAttackSe", &stPcSndData::playBackAttackSe)
			.addProperty("playBackAttackPullSe", &stPcSndData::playBackAttackPullSe)
		.endClass();
	}
#endif
};
static_assert(sizeof(stPcSndData::seHdlLightsavorReady) == 4, "expected seHdlLightsavorReady to be size 4");
static_assert(sizeof(stPcSndData::seVolLightsavorReady) == 4, "expected seVolLightsavorReady to be size 4");
static_assert(sizeof(stPcSndData::seDontPlaySeAgainLSReady) == 1, "expected seDontPlaySeAgainLSReady to be size 1");
static_assert(sizeof(stPcSndData::seHdlSlow) == 4, "expected seHdlSlow to be size 4");
static_assert(sizeof(stPcSndData::oldBgmVol) == 4, "expected oldBgmVol to be size 4");
static_assert(sizeof(stPcSndData::oldBgmHdl) == 4, "expected oldBgmHdl to be size 4");
static_assert(sizeof(stPcSndData::oldBgmNo) == 4, "expected oldBgmNo to be size 4");
static_assert(sizeof(stPcSndData::nowBgmHdl) == 4, "expected nowBgmHdl to be size 4");
static_assert(sizeof(stPcSndData::seReadProc) == 4, "expected seReadProc to be size 4");
static_assert(sizeof(stPcSndData::pitchBgm) == 32, "expected pitchBgm to be size 32");
static_assert(sizeof(stPcSndData::oldFinishBgmVol) == 4, "expected oldFinishBgmVol to be size 4");
static_assert(sizeof(stPcSndData::oldFinishSeVol) == 4, "expected oldFinishSeVol to be size 4");
static_assert(sizeof(stPcSndData::seHdlCharge) == 4, "expected seHdlCharge to be size 4");
static_assert(sizeof(stPcSndData::pitchCharge) == 32, "expected pitchCharge to be size 32");
static_assert(sizeof(stPcSndData::seHdlChargeMax) == 4, "expected seHdlChargeMax to be size 4");
static_assert(sizeof(stPcSndData::pitchChargeMax) == 32, "expected pitchChargeMax to be size 32");
static_assert(sizeof(stPcSndData::seHdlAlarm) == 4, "expected seHdlAlarm to be size 4");
static_assert(sizeof(stPcSndData::seHdlTel) == 4, "expected seHdlTel to be size 4");
static_assert(sizeof(stPcSndData::seHdlDsBreath) == 4, "expected seHdlDsBreath to be size 4");
static_assert(sizeof(stPcSndData::seHdlTsubazeri) == 4, "expected seHdlTsubazeri to be size 4");
static_assert(sizeof(stPcSndData::seHdlSNBElecDmg) == 4, "expected seHdlSNBElecDmg to be size 4");
static_assert(sizeof(stPcSndData::seHdlPoison) == 4, "expected seHdlPoison to be size 4");
static_assert(sizeof(stPcSndData::playBackAttackSe) == 1, "expected playBackAttackSe to be size 1");
static_assert(sizeof(stPcSndData::playBackAttackPullSe) == 1, "expected playBackAttackPullSe to be size 1");
static_assert(sizeof(struct stPcSndData) == 176, "expected struct stPcSndData to be size 176");

// struct stDarkSideInfo
// no dependencies
struct stDarkSideInfo
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[52];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stDarkSideInfo>("stDarkSideInfo")
		.endClass();
	}
#endif
};
static_assert(sizeof(struct stDarkSideInfo) == 52, "expected struct stDarkSideInfo to be size 52");

// struct stPcSaveData
// no dependencies
struct stPcSaveData
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[1636];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stPcSaveData>("stPcSaveData")
		.endClass();
	}
#endif
};
static_assert(sizeof(struct stPcSaveData) == 1636, "expected struct stPcSaveData to be size 1636");

// struct stMiniDemo
// no dependencies
struct stMiniDemo
{
public:
	/// No namespace types
	/// Struct member variables

	// <uint8_t play, offset 0x0>
	uint8_t play;

	// <uint8_t pauseStart, offset 0x1>
	uint8_t pauseStart;

	// <uint8_t fadeInPermission, offset 0x2>
	uint8_t fadeInPermission;

	// <Filler, offset 0x3>
	char _Filler3[1];

	// <int32_t warpWaitFrame, offset 0x4>
	int32_t warpWaitFrame;

	// <int32_t warpTargetIndex, offset 0x8>
	int32_t warpTargetIndex;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stMiniDemo>("stMiniDemo")
			.addProperty("play", &stMiniDemo::play)
			.addProperty("pauseStart", &stMiniDemo::pauseStart)
			.addProperty("fadeInPermission", &stMiniDemo::fadeInPermission)
			.addProperty("warpWaitFrame", &stMiniDemo::warpWaitFrame)
			.addProperty("warpTargetIndex", &stMiniDemo::warpTargetIndex)
		.endClass();
	}
#endif
};
static_assert(sizeof(stMiniDemo::play) == 1, "expected play to be size 1");
static_assert(sizeof(stMiniDemo::pauseStart) == 1, "expected pauseStart to be size 1");
static_assert(sizeof(stMiniDemo::fadeInPermission) == 1, "expected fadeInPermission to be size 1");
static_assert(sizeof(stMiniDemo::warpWaitFrame) == 4, "expected warpWaitFrame to be size 4");
static_assert(sizeof(stMiniDemo::warpTargetIndex) == 4, "expected warpTargetIndex to be size 4");
static_assert(sizeof(struct stMiniDemo) == 12, "expected struct stMiniDemo to be size 12");

// struct stPcStatus
// no dependencies
struct stPcStatus
{
public:
	/// No namespace types
	/// Struct member variables

	// <Filler, offset 0x0>
	char _Filler[2308];

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<stPcStatus>("stPcStatus")
		.endClass();
	}
#endif
};
static_assert(sizeof(struct stPcStatus) == 2308, "expected struct stPcStatus to be size 2308");

// class mHRPc
// 42 dependencies: class mHRChara, class ghmListObj, struct stCharaStatus, enum enCharaType, struct Vec, struct Quaternion, struct stVec, class WAnimF, class WAnim, enum enCharaCondition, class ghmGcCollObjHitResultObj, class ghmPlane, class ghmTriangle, struct stDamageInfo, class ghmGcCollObjCapsule, class ghmGcCollObj, class ghmGcOctTreeNodeObj, enum ghmGcCollObj::Type, class ghmCapsule, class ghmSegment, class stCharaFileData, struct stCharaEffect, class CAmbientShadow, class CDoubleSpringInterpolate, class CSpringInterpolate, enum enCharaInitProc, struct stPcStatus, struct stMiniDemo, struct stPcSaveData, struct stDarkSideInfo, struct stPcSndData, enum enSeReadProc, enum enPcInputMode, struct stPcEffect, struct stHugWalk, struct stTiger, class HROBJDummy, struct stFade, enum enScreenChangeKind, union uniSMflag, enum enWepChangeProc, class CTimeRatioInterpolate
class mHRPc : mHRChara
{
public:
	/// 43 namespace types: class mHRChara* __convention("thiscall") mHRPc::mGetTsubaNpc(class mHRPc* const this), class mHRChara* __convention("thiscall") mHRPc::mGetLockOnNpc(class mHRPc* const this), void __convention("thiscall") mHRPc::mSetLastAttackNpc(class mHRPc* const this, class mHRChara* arg2), class mHRChara* __convention("thiscall") mHRPc::mGetLastAttackNpc(class mHRPc* const this), void __convention("thiscall") mHRPc::mSetAttackFromBackNpc(class mHRPc* const this, class mHRChara* arg2), class mHRChara* __convention("thiscall") mHRPc::mGetAttackFromBackNpc(class mHRPc* const this), class mHRChara* __convention("thiscall") mHRPc::mGetLockOnDummyPtr(class mHRPc* const this), class mHRChara* __convention("thiscall") mHRPc::mGetCatchNpc(class mHRPc* const this), uint8_t __convention("thiscall") mHRPc::mTestCanDownAttack(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mCallFightAttackDmgEffect(class mHRPc* const this, class mHRChara* arg2), void __convention("thiscall") mHRPc::mCallNormalAttackEffect(class mHRPc* const this, class mHRChara* arg2), void __convention("thiscall") mHRPc::CreateCutMarkEffect(class mHRPc* const this, class mHRChara* arg2, enum eEfDmgLevel arg3), void __convention("thiscall") mHRPc::mSePlayChargeAttack(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mCallFinishAttackEffect(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mCheckFinishNpc(class mHRPc* const this, class mHRChara* arg2), class mHRChara* __convention("thiscall") mHRPc::mSearchRapidFinishNpc(class mHRPc* const this), uint8_t __convention("thiscall") mHRPc::mCheckResistRapidFinishNpc(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mSetRapidFinishNpc(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mCheckTargetObject(class mHRPc* const this, class mHRChara* arg2), class mHRChara* __convention("thiscall") mHRPc::mSearchAttackTargetNpc(class mHRPc* const this, float arg2, uint8_t arg3), class mHRChara* __convention("thiscall") mHRPc::mSearchDarkSideWarpTargetNpc(class mHRPc* const this), class mHRChara* __convention("thiscall") mHRPc::mSearchNearNpc(class mHRPc* const this, float arg2), class mHRChara* __convention("thiscall") mHRPc::mLookAttackTargetNpc(class mHRPc* const this), class mHRChara* __convention("thiscall") mHRPc::mLockNearNpc(class mHRPc* const this, float arg2, class mHRChara* arg3), class mHRChara* __convention("thiscall") mHRPc::mLockNearCatchNpc(class mHRPc* const this, float arg2, uint8_t arg3), void __convention("thiscall") mHRPc::mAddKillNpcCombo(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mPcMoveFrontOfNpc4DarkSideMode(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mPcMoveFrontOfNpc(class mHRPc* const this, class mHRChara* arg2, uint8_t arg3, int32_t arg4), class mHRChara* __convention("thiscall") mHRPc::mSearchNextNpc(class mHRPc* const this), uint8_t __convention("thiscall") mHRPc::mCheckFinishMode(class mHRPc* const this, class mHRChara* arg2), void __convention("thiscall") mHRPc::mPrepareInputFinish(class mHRPc* const this, class mHRChara* arg2), void __convention("thiscall") mHRPc::mSetIntoTsubazeriai(class mHRPc* const this, class mHRChara* arg2), void __convention("thiscall") mHRPc::mTrvStartDownAttack(class mHRPc* const this, class mHRChara* arg2), int32_t __convention("thiscall") mHRPc::mGetPcThrowMotNo(class mHRPc* const this, enum enThrowDir arg2, class mHRChara* arg3, int32_t* arg4), int32_t __convention("thiscall") mHRPc::mGetThrowDamageMotion(class mHRPc* const this, class mHRChara* arg2, int32_t* arg3), uint8_t __convention("thiscall") mHRPc::mCheckLastTarget(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mStartCatchAttack(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mHitCheck(class mHRPc* const this, class mHRChara* arg2), uint8_t __convention("thiscall") mHRPc::mSetElectricDamage(class mHRPc* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10, int32_t arg11), uint8_t __convention("thiscall") mHRPc::mSetDamage(class mHRPc* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10), int32_t __convention("thiscall") mHRPc::mConvertGuardMotion(class mHRPc* const this, int32_t arg2, class mHRChara* arg3), void __convention("thiscall") mHRPc::mSetDamageIK(class mHRPc* const this, class mHRChara* arg2, uint8_t arg3), uint8_t __convention("thiscall") mHRPc::mCallAttackEffect(class mHRPc* const this, enum enPcAttackEffect arg2, class mHRChara* arg3, uint8_t arg4, struct Vec* arg5)

	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mGetTsubaNpc(class mHRPc* const this)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mGetLockOnNpc(class mHRPc* const this)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mSetLastAttackNpc(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mGetLastAttackNpc(class mHRPc* const this)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mSetAttackFromBackNpc(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mGetAttackFromBackNpc(class mHRPc* const this)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mGetLockOnDummyPtr(class mHRPc* const this)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mGetCatchNpc(class mHRPc* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mTestCanDownAttack(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCallFightAttackDmgEffect(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mCallNormalAttackEffect(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRPc::CreateCutMarkEffect(class mHRPc* const this, class mHRChara* arg2, enum eEfDmgLevel arg3)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mSePlayChargeAttack(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCallFinishAttackEffect(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCheckFinishNpc(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mSearchRapidFinishNpc(class mHRPc* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCheckResistRapidFinishNpc(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mSetRapidFinishNpc(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCheckTargetObject(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mSearchAttackTargetNpc(class mHRPc* const this, float arg2, uint8_t arg3)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mSearchDarkSideWarpTargetNpc(class mHRPc* const this)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mSearchNearNpc(class mHRPc* const this, float arg2)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mLookAttackTargetNpc(class mHRPc* const this)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mLockNearNpc(class mHRPc* const this, float arg2, class mHRChara* arg3)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mLockNearCatchNpc(class mHRPc* const this, float arg2, uint8_t arg3)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mAddKillNpcCombo(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mPcMoveFrontOfNpc4DarkSideMode(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mPcMoveFrontOfNpc(class mHRPc* const this, class mHRChara* arg2, uint8_t arg3, int32_t arg4)'
	// TODO: Function 'class mHRChara* __convention("thiscall") mHRPc::mSearchNextNpc(class mHRPc* const this)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCheckFinishMode(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mPrepareInputFinish(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mSetIntoTsubazeriai(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mTrvStartDownAttack(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'int32_t __convention("thiscall") mHRPc::mGetPcThrowMotNo(class mHRPc* const this, enum enThrowDir arg2, class mHRChara* arg3, int32_t* arg4)'
	// TODO: Function 'int32_t __convention("thiscall") mHRPc::mGetThrowDamageMotion(class mHRPc* const this, class mHRChara* arg2, int32_t* arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCheckLastTarget(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mStartCatchAttack(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mHitCheck(class mHRPc* const this, class mHRChara* arg2)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mSetElectricDamage(class mHRPc* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10, int32_t arg11)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mSetDamage(class mHRPc* const this, float arg2, int32_t arg3, int32_t arg4, int32_t arg5, float arg6, int32_t arg7, float arg8, float arg9, class mHRChara* arg10)'
	// TODO: Function 'int32_t __convention("thiscall") mHRPc::mConvertGuardMotion(class mHRPc* const this, int32_t arg2, class mHRChara* arg3)'
	// TODO: Function 'void __convention("thiscall") mHRPc::mSetDamageIK(class mHRPc* const this, class mHRChara* arg2, uint8_t arg3)'
	// TODO: Function 'uint8_t __convention("thiscall") mHRPc::mCallAttackEffect(class mHRPc* const this, enum enPcAttackEffect arg2, class mHRChara* arg3, uint8_t arg4, struct Vec* arg5)'

	/// Struct member variables

	// <class mHRChara field_0, offset 0x0>
	// class mHRChara Super;

	// <int32_t mEscapeActionInit, offset 0x580>
	int32_t mEscapeActionInit;

	// <struct stPcStatus mPcStatus, offset 0x584>
	struct stPcStatus mPcStatus;

	// <struct stMiniDemo mMiniDemo, offset 0xe88>
	struct stMiniDemo mMiniDemo;

	// <struct stPcSaveData mPcSaveData, offset 0xe94>
	struct stPcSaveData mPcSaveData;

	// <struct stDarkSideInfo mDarkSideInfo, offset 0x14f8>
	struct stDarkSideInfo mDarkSideInfo;

	// <class mHRBike* mpBike, offset 0x152c>
	class mHRBike* mpBike;

	// <struct stPcSndData mSnd, offset 0x1530>
	struct stPcSndData mSnd;

	// <enum enPcInputMode mInputMode, offset 0x15e0>
	enum enPcInputMode mInputMode;

	// <enum enPcInputMode mInputModeOld, offset 0x15e4>
	enum enPcInputMode mInputModeOld;

	// <enum enPcInputMode mInputModeBefore, offset 0x15e8>
	enum enPcInputMode mInputModeBefore;

	// <uint8_t mPauseAll, offset 0x15ec>
	uint8_t mPauseAll;

	// <uint8_t mPauseNpc, offset 0x15ed>
	uint8_t mPauseNpc;

	// <uint8_t mOperate, offset 0x15ee>
	uint8_t mOperate;

	// <uint8_t mOnlyMove, offset 0x15ef>
	uint8_t mOnlyMove;

	// <uint8_t mMotSpdAdj, offset 0x15f0>
	uint8_t mMotSpdAdj;

	// <uint8_t mDead, offset 0x15f1>
	uint8_t mDead;

	// <uint8_t mDeadPause, offset 0x15f2>
	uint8_t mDeadPause;

	// <uint8_t mCameraOperate, offset 0x15f3>
	uint8_t mCameraOperate;

	// <uint8_t mBattouDemoRequest, offset 0x15f4>
	uint8_t mBattouDemoRequest;

	// <uint8_t mStageChangeInitEnd, offset 0x15f5>
	uint8_t mStageChangeInitEnd;

	// <uint8_t mStageChangeTermEnd, offset 0x15f6>
	uint8_t mStageChangeTermEnd;

	// <uint8_t mStageChangeMuteki, offset 0x15f7>
	uint8_t mStageChangeMuteki;

	// <uint8_t mBanStatusScreen, offset 0x15f8>
	uint8_t mBanStatusScreen;

	// <Filler, offset 0x15f9>
	char _Filler24[3];

	// <int32_t mAtkPauseTime, offset 0x15fc>
	int32_t mAtkPauseTime;

	// <int32_t mStopRenderFrameNum, offset 0x1600>
	int32_t mStopRenderFrameNum;

	// <int32_t mWait1Frame, offset 0x1604>
	int32_t mWait1Frame;

	// <struct stPcEffect mPcEffect, offset 0x1608>
	struct stPcEffect mPcEffect;

	// <struct stHugWalk mPcHug, offset 0x1898>
	struct stHugWalk mPcHug;

	// <struct stTiger mTiger, offset 0x18b8>
	struct stTiger mTiger;

	// <struct Vec mLockOnPos, offset 0x1908>
	struct Vec mLockOnPos;

	// <class mHRChara* mpLockOnNpc, offset 0x1914>
	class mHRChara* mpLockOnNpc;

	// <class mHRChara* mpTsubaNpc, offset 0x1918>
	class mHRChara* mpTsubaNpc;

	// <class mHRChara* mpCatchNpc, offset 0x191c>
	class mHRChara* mpCatchNpc;

	// <class mHRChara* mpCatchReserveNpc, offset 0x1920>
	class mHRChara* mpCatchReserveNpc;

	// <class mHRChara* mpEscapeNpc, offset 0x1924>
	class mHRChara* mpEscapeNpc;

	// <class mHRChara* mpInitFinishNpc, offset 0x1928>
	class mHRChara* mpInitFinishNpc;

	// <class mHRChara* mpNextFinishNpc, offset 0x192c>
	class mHRChara* mpNextFinishNpc;

	// <class mHRChara* mpFinishNpc[0x8], offset 0x1930>
	class mHRChara* mpFinishNpc[8];

	// <class mHRChara* mpFinishReserveNpc, offset 0x1950>
	class mHRChara* mpFinishReserveNpc;

	// <class mHRChara* mpDSTargetNpc, offset 0x1954>
	class mHRChara* mpDSTargetNpc;

	// <class mHRChara* mpDwnAtkNpc, offset 0x1958>
	class mHRChara* mpDwnAtkNpc;

	// <class mHRChara* mpLastAtkNpc, offset 0x195c>
	class mHRChara* mpLastAtkNpc;

	// <class mHRChara* mpAttackFromBackNpc, offset 0x1960>
	class mHRChara* mpAttackFromBackNpc;

	// <class HROBJDummy mLockOnDummy, offset 0x1964>
	class HROBJDummy mLockOnDummy;

	// <uint8_t mSavehitOidashiDisEnable, offset 0x1ee4>
	uint8_t mSavehitOidashiDisEnable;

	// <Filler, offset 0x1ee5>
	char _Filler46[3];

	// <int32_t mSlowMotionSytemMotNo, offset 0x1ee8>
	int32_t mSlowMotionSytemMotNo;

	// <int32_t mSlowMotionSytemButton, offset 0x1eec>
	int32_t mSlowMotionSytemButton;

	// <class ghmTriangle mWepCollL, offset 0x1ef0>
	class ghmTriangle mWepCollL;

	// <class ghmTriangle* m_pAttackHitTriangle, offset 0x1f14>
	class ghmTriangle* m_pAttackHitTriangle;

	// <struct stFade mFade, offset 0x1f18>
	struct stFade mFade;

	// <union uniSMflag mSubMissionflag, offset 0x1f24>
	union uniSMflag mSubMissionflag;

	// <uint8_t mSubMissionPcPosStoreFlag, offset 0x1f26>
	uint8_t mSubMissionPcPosStoreFlag;

	// <Filler, offset 0x1f27>
	char _Filler53[1];

	// <struct Vec mSubMissionStorePos, offset 0x1f28>
	struct Vec mSubMissionStorePos;

	// <struct Vec mSubMissionStoreRot, offset 0x1f34>
	struct Vec mSubMissionStoreRot;

	// <uint8_t mSubMissionBikePosStoreFlag, offset 0x1f40>
	uint8_t mSubMissionBikePosStoreFlag;

	// <Filler, offset 0x1f41>
	char _Filler56[3];

	// <struct Vec mSubMissionStoreBikePos, offset 0x1f44>
	struct Vec mSubMissionStoreBikePos;

	// <struct Vec mSubMissionStoreBikeRot, offset 0x1f50>
	struct Vec mSubMissionStoreBikeRot;

	// <class EventAreaCamera* mpSubMissionJumpCameraHandle, offset 0x1f5c>
	class EventAreaCamera* mpSubMissionJumpCameraHandle;

	// <int32_t mDisEnableBtlPoseCalc, offset 0x1f60>
	int32_t mDisEnableBtlPoseCalc;

	// <uint8_t mTamePush, offset 0x1f64>
	uint8_t mTamePush;

	// <uint8_t mTameMax, offset 0x1f65>
	uint8_t mTameMax;

	// <uint8_t mTameSe, offset 0x1f66>
	uint8_t mTameSe;

	// <Filler, offset 0x1f67>
	char _Filler63[1];

	// <int32_t mDigAction, offset 0x1f68>
	int32_t mDigAction;

	// <enum enWepChangeProc mChangeWepProc, offset 0x1f6c>
	enum enWepChangeProc mChangeWepProc;

	// <int32_t mChangeWepKind, offset 0x1f70>
	int32_t mChangeWepKind;

	// <int32_t mMenuDisEnableFrame, offset 0x1f74>
	int32_t mMenuDisEnableFrame;

	// <char const* m_sMotName, offset 0x1f78>
	char const* m_sMotName;

	// <char const* m_sPreMotName, offset 0x1f7c>
	char const* m_sPreMotName;

	// <char m_sOutMotName[0x10], offset 0x1f80>
	char m_sOutMotName[16];

	// <uint8_t m_bIsBootStageHitEffect, offset 0x1f90>
	uint8_t m_bIsBootStageHitEffect;

	// <Filler, offset 0x1f91>
	char _Filler71[3];

	// <struct Vec m_inPreWeaponTopPosi, offset 0x1f94>
	struct Vec m_inPreWeaponTopPosi;

	// <uint8_t m_bIsPreTigerVisible, offset 0x1fa0>
	uint8_t m_bIsPreTigerVisible;

	// <uint8_t m_bIsPreFinishAttack, offset 0x1fa1>
	uint8_t m_bIsPreFinishAttack;

	// <uint8_t m_bIsBeginFinishAttack, offset 0x1fa2>
	uint8_t m_bIsBeginFinishAttack;

	// <uint8_t m_bIsPlayCamBankMotion, offset 0x1fa3>
	uint8_t m_bIsPlayCamBankMotion;

	// <class CTimeRatioInterpolate m_inWeaponLengthRatio, offset 0x1fa4>
	class CTimeRatioInterpolate m_inWeaponLengthRatio;

#ifdef WITH_LUA
	static void BindLua(luabridge::Namespace& NS)
	{
		NS = NS.beginClass<mHRPc>("mHRPc")
			.addProperty("mEscapeActionInit", &mHRPc::mEscapeActionInit)
			.addProperty("mPcStatus", &mHRPc::mPcStatus)
			.addProperty("mMiniDemo", &mHRPc::mMiniDemo)
			.addProperty("mPcSaveData", &mHRPc::mPcSaveData)
			.addProperty("mDarkSideInfo", &mHRPc::mDarkSideInfo)
			.addProperty("mpBike", &mHRPc::mpBike)
			.addProperty("mSnd", &mHRPc::mSnd)
			.addProperty("mInputMode", &mHRPc::mInputMode)
			.addProperty("mInputModeOld", &mHRPc::mInputModeOld)
			.addProperty("mInputModeBefore", &mHRPc::mInputModeBefore)
			.addProperty("mPauseAll", &mHRPc::mPauseAll)
			.addProperty("mPauseNpc", &mHRPc::mPauseNpc)
			.addProperty("mOperate", &mHRPc::mOperate)
			.addProperty("mOnlyMove", &mHRPc::mOnlyMove)
			.addProperty("mMotSpdAdj", &mHRPc::mMotSpdAdj)
			.addProperty("mDead", &mHRPc::mDead)
			.addProperty("mDeadPause", &mHRPc::mDeadPause)
			.addProperty("mCameraOperate", &mHRPc::mCameraOperate)
			.addProperty("mBattouDemoRequest", &mHRPc::mBattouDemoRequest)
			.addProperty("mStageChangeInitEnd", &mHRPc::mStageChangeInitEnd)
			.addProperty("mStageChangeTermEnd", &mHRPc::mStageChangeTermEnd)
			.addProperty("mStageChangeMuteki", &mHRPc::mStageChangeMuteki)
			.addProperty("mBanStatusScreen", &mHRPc::mBanStatusScreen)
			.addProperty("mAtkPauseTime", &mHRPc::mAtkPauseTime)
			.addProperty("mStopRenderFrameNum", &mHRPc::mStopRenderFrameNum)
			.addProperty("mWait1Frame", &mHRPc::mWait1Frame)
			.addProperty("mPcEffect", &mHRPc::mPcEffect)
			.addProperty("mPcHug", &mHRPc::mPcHug)
			.addProperty("mTiger", &mHRPc::mTiger)
			.addProperty("mLockOnPos", &mHRPc::mLockOnPos)
			.addProperty("mpLockOnNpc", &mHRPc::mpLockOnNpc)
			.addProperty("mpTsubaNpc", &mHRPc::mpTsubaNpc)
			.addProperty("mpCatchNpc", &mHRPc::mpCatchNpc)
			.addProperty("mpCatchReserveNpc", &mHRPc::mpCatchReserveNpc)
			.addProperty("mpEscapeNpc", &mHRPc::mpEscapeNpc)
			.addProperty("mpInitFinishNpc", &mHRPc::mpInitFinishNpc)
			.addProperty("mpNextFinishNpc", &mHRPc::mpNextFinishNpc)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("mpFinishNpc", &mHRPc::mpFinishNpc)
			.addProperty("mpFinishReserveNpc", &mHRPc::mpFinishReserveNpc)
			.addProperty("mpDSTargetNpc", &mHRPc::mpDSTargetNpc)
			.addProperty("mpDwnAtkNpc", &mHRPc::mpDwnAtkNpc)
			.addProperty("mpLastAtkNpc", &mHRPc::mpLastAtkNpc)
			.addProperty("mpAttackFromBackNpc", &mHRPc::mpAttackFromBackNpc)
			.addProperty("mLockOnDummy", &mHRPc::mLockOnDummy)
			.addProperty("mSavehitOidashiDisEnable", &mHRPc::mSavehitOidashiDisEnable)
			.addProperty("mSlowMotionSytemMotNo", &mHRPc::mSlowMotionSytemMotNo)
			.addProperty("mSlowMotionSytemButton", &mHRPc::mSlowMotionSytemButton)
			.addProperty("mWepCollL", &mHRPc::mWepCollL)
			.addProperty("m_pAttackHitTriangle", &mHRPc::m_pAttackHitTriangle)
			.addProperty("mFade", &mHRPc::mFade)
			.addProperty("mSubMissionflag", &mHRPc::mSubMissionflag)
			.addProperty("mSubMissionPcPosStoreFlag", &mHRPc::mSubMissionPcPosStoreFlag)
			.addProperty("mSubMissionStorePos", &mHRPc::mSubMissionStorePos)
			.addProperty("mSubMissionStoreRot", &mHRPc::mSubMissionStoreRot)
			.addProperty("mSubMissionBikePosStoreFlag", &mHRPc::mSubMissionBikePosStoreFlag)
			.addProperty("mSubMissionStoreBikePos", &mHRPc::mSubMissionStoreBikePos)
			.addProperty("mSubMissionStoreBikeRot", &mHRPc::mSubMissionStoreBikeRot)
			.addProperty("mpSubMissionJumpCameraHandle", &mHRPc::mpSubMissionJumpCameraHandle)
			.addProperty("mDisEnableBtlPoseCalc", &mHRPc::mDisEnableBtlPoseCalc)
			.addProperty("mTamePush", &mHRPc::mTamePush)
			.addProperty("mTameMax", &mHRPc::mTameMax)
			.addProperty("mTameSe", &mHRPc::mTameSe)
			.addProperty("mDigAction", &mHRPc::mDigAction)
			.addProperty("mChangeWepProc", &mHRPc::mChangeWepProc)
			.addProperty("mChangeWepKind", &mHRPc::mChangeWepKind)
			.addProperty("mMenuDisEnableFrame", &mHRPc::mMenuDisEnableFrame)
			.addProperty("m_sMotName", &mHRPc::m_sMotName)
			.addProperty("m_sPreMotName", &mHRPc::m_sPreMotName)
			// static arrays are not supported in LuaBridge (only std::vector)
			//.addProperty("m_sOutMotName", &mHRPc::m_sOutMotName)
			.addProperty("m_bIsBootStageHitEffect", &mHRPc::m_bIsBootStageHitEffect)
			.addProperty("m_inPreWeaponTopPosi", &mHRPc::m_inPreWeaponTopPosi)
			.addProperty("m_bIsPreTigerVisible", &mHRPc::m_bIsPreTigerVisible)
			.addProperty("m_bIsPreFinishAttack", &mHRPc::m_bIsPreFinishAttack)
			.addProperty("m_bIsBeginFinishAttack", &mHRPc::m_bIsBeginFinishAttack)
			.addProperty("m_bIsPlayCamBankMotion", &mHRPc::m_bIsPlayCamBankMotion)
			.addProperty("m_inWeaponLengthRatio", &mHRPc::m_inWeaponLengthRatio)
		.endClass();
	}
#endif
};
static_assert(sizeof(mHRPc::mEscapeActionInit) == 4, "expected mEscapeActionInit to be size 4");
static_assert(sizeof(mHRPc::mPcStatus) == 2308, "expected mPcStatus to be size 2308");
static_assert(sizeof(mHRPc::mMiniDemo) == 12, "expected mMiniDemo to be size 12");
static_assert(sizeof(mHRPc::mPcSaveData) == 1636, "expected mPcSaveData to be size 1636");
static_assert(sizeof(mHRPc::mDarkSideInfo) == 52, "expected mDarkSideInfo to be size 52");
static_assert(sizeof(mHRPc::mpBike) == 4, "expected mpBike to be size 4");
static_assert(sizeof(mHRPc::mSnd) == 176, "expected mSnd to be size 176");
static_assert(sizeof(mHRPc::mInputMode) == 4, "expected mInputMode to be size 4");
static_assert(sizeof(mHRPc::mInputModeOld) == 4, "expected mInputModeOld to be size 4");
static_assert(sizeof(mHRPc::mInputModeBefore) == 4, "expected mInputModeBefore to be size 4");
static_assert(sizeof(mHRPc::mPauseAll) == 1, "expected mPauseAll to be size 1");
static_assert(sizeof(mHRPc::mPauseNpc) == 1, "expected mPauseNpc to be size 1");
static_assert(sizeof(mHRPc::mOperate) == 1, "expected mOperate to be size 1");
static_assert(sizeof(mHRPc::mOnlyMove) == 1, "expected mOnlyMove to be size 1");
static_assert(sizeof(mHRPc::mMotSpdAdj) == 1, "expected mMotSpdAdj to be size 1");
static_assert(sizeof(mHRPc::mDead) == 1, "expected mDead to be size 1");
static_assert(sizeof(mHRPc::mDeadPause) == 1, "expected mDeadPause to be size 1");
static_assert(sizeof(mHRPc::mCameraOperate) == 1, "expected mCameraOperate to be size 1");
static_assert(sizeof(mHRPc::mBattouDemoRequest) == 1, "expected mBattouDemoRequest to be size 1");
static_assert(sizeof(mHRPc::mStageChangeInitEnd) == 1, "expected mStageChangeInitEnd to be size 1");
static_assert(sizeof(mHRPc::mStageChangeTermEnd) == 1, "expected mStageChangeTermEnd to be size 1");
static_assert(sizeof(mHRPc::mStageChangeMuteki) == 1, "expected mStageChangeMuteki to be size 1");
static_assert(sizeof(mHRPc::mBanStatusScreen) == 1, "expected mBanStatusScreen to be size 1");
static_assert(sizeof(mHRPc::mAtkPauseTime) == 4, "expected mAtkPauseTime to be size 4");
static_assert(sizeof(mHRPc::mStopRenderFrameNum) == 4, "expected mStopRenderFrameNum to be size 4");
static_assert(sizeof(mHRPc::mWait1Frame) == 4, "expected mWait1Frame to be size 4");
static_assert(sizeof(mHRPc::mPcEffect) == 656, "expected mPcEffect to be size 656");
static_assert(sizeof(mHRPc::mPcHug) == 32, "expected mPcHug to be size 32");
static_assert(sizeof(mHRPc::mTiger) == 80, "expected mTiger to be size 80");
static_assert(sizeof(mHRPc::mLockOnPos) == 12, "expected mLockOnPos to be size 12");
static_assert(sizeof(mHRPc::mpLockOnNpc) == 4, "expected mpLockOnNpc to be size 4");
static_assert(sizeof(mHRPc::mpTsubaNpc) == 4, "expected mpTsubaNpc to be size 4");
static_assert(sizeof(mHRPc::mpCatchNpc) == 4, "expected mpCatchNpc to be size 4");
static_assert(sizeof(mHRPc::mpCatchReserveNpc) == 4, "expected mpCatchReserveNpc to be size 4");
static_assert(sizeof(mHRPc::mpEscapeNpc) == 4, "expected mpEscapeNpc to be size 4");
static_assert(sizeof(mHRPc::mpInitFinishNpc) == 4, "expected mpInitFinishNpc to be size 4");
static_assert(sizeof(mHRPc::mpNextFinishNpc) == 4, "expected mpNextFinishNpc to be size 4");
